[
  {
    "year": "2020",
    "theme": "Let Christ be formed in you",
    "scripture": "Galatians 4:19",
    "introduction": "None",
    "acknowledgement": "ACKNOWLEDGEMENT \n\nIt is with a sense of gratitude and humility that I express gratitude to those who in diverse ways helped in the production of this carefully prepared Bible Study Outline on the General Assembly theme of the year (2019/2020): \"Let Christ be formed in you\" (Galatians 4:18-19, Romans 8:29). \n\nThis Bible Study Outline was produced by a team of Presbyterian Ministers under the selfless leadership of Rev. Gideon Buernor Puplampu, Director at the Ramseyer Training Centre, Abetifi. On behalf of the Department of Church Life and Nurture and the whole Presbyterian Church of Ghana, I express deep appreciation and gratitude to them for the exceptional work they did. Those who sacrificed immensely in writing this Bible Study outline are: \n\n\n1. Rev. Andrew Shardow \n2. Rev Ebenezer Ahenkan Owusu \n3. Rev. Leticia Adjei \n4. Rev. Rose Bueki Puplampu \n5. Rev. Frederick Ashaley Kotey \n6. Mr. Eric Okai \n7. Rev. Lydia Anowaah 8. Rev. Nicholas Ofori \n\nRev. Dr. Martin A. Obeng is also commended for the editorial work on the material. Our Appreciation also goes to the Guild of vernacular Translators who have worked hard to translate the Bible Study Outline into the various vernaculars. They are: \n\nDangme: \nRev'ds. Escober Leiku, Felix Nyarkotey and Mr. Moses Torgbenu \n\nEwe:\nRev'ds. E.K. Agblegah, W.S. K. Anyigba, Rev. E.O. Tettey, Mr. Thomas Agbo, Mr. Courage Magblemdio, \n\nAkan: \nRev'ds. K.B. Asante, Margaret Aboagye (Mrs), Evelyn Budu (Mrs), Percy Offei, Mr. D. Atua Angua and Samuel Mare - Ayeh. \n\nGa: \nRev'ds. Solomom Ni Mensah Adjei, George A. Tsalde, J. A. Obodai, Alphonso Laryea \n\nLet me also appreciate the enormous support of the Moderator of General Assembly, Rt. Rev. Prof. Joseph Obiri Yeboah Mante and the Clerk of General Assembly, Rev. Dr. Godwin Nii Noi Odonkor for their assistance. \n\nIt is my prayer that we will all make use of this Bible Study Material and diligently apply ourselves to what we learn. \n\nRev. Mrs. Esther Oduro \nDirector, Department of Church Life and Nurture \n",
    "wordFromModerator": "A WORD FROM THE MODERATOR \n\n I convey to you and the entire membership of the Presbyterian Church of Ghana my warmest greetings and happy new ecclesiastical year on behalf of the General Assembly of the Presbyterian Church of Ghana. A New Year has dawned on us as a Church to assiduously reflect on our spiritual journey with the Lord and to also engage practically how we are impacting lives by being ambassadors of Christ. For seven (7) continuous years, the church focused on the person and ministry of the Holy Spirit in the life of the believer. The last theme on this subject was \"When the Holy Spirit moves...\" which the theme that followed made us to understand that when the Holy Spirit indeed moves, \"The earth hears about Christ\". The Church was then called to be intentional about evangelism and discipleship. For me, that made sense because, if we are truly empowered, filled, anointed and moved by the Holy Spirit, we cannot suspend the critical aspect of evangelising the unconverted and discipling such people. This year's theme which is also the focus of this Bible Study material \"LET CHRIST BE FORMED IN YOU\" (GALATIANS 4:19) is equally calling every member of the Church to spiritual growth/maturity. Many people are developing a spirituality these days that is not centered or anchored in Christ Jesus. When spirituality is not rooted in Jesus it can go bizzare and we cannot afford to have that in the Presbyterian Church of Ghana. Our spirituality is expressed in our vision which says that we want to be a Christ-centered church. \n\n\nWhen Paul said in Galatians 4:19, \"My little children for whom I labor in birth again until Christ is formed in you\", the context was legalism versus antinomianism. There were the Jewish legalists on the one hand who emphasized that it was not enough for one to believe in Jesus for salvation; they insisted that believers should in addition accept some of the Jewish ceremonial laws, especially circumcision and ceremonial festivals. \n\nI dedicate this study material to all who desire to see every Christian grow into Christlikeness. At the General Assembly Office and the General Assembly Council, we will do all that we are able to create opportunity to \"LET CHRIST BE FORMED\" in every individual church member so that together, we will achieve VISION 1.5 for Christ. \nMay your love and trust be in the Lord alone who empowers us for His work. \n\nPeace Be With You. \n\n\nRT. REV. PROF. JOSEPH OBIRI YEBOAH MANTE \nModerator of General Assembly \nPresbyterian Church of Ghana \nChurch House, Osu, Accra January 2020 \n",
    "sections": [
      {
        "title": "CHARACTERISTICS  OF THE CHRIST KIND OF LIFE\n",
        "introduction": "This section is expected to describe the Christ-kind of life that a Christian must desire. Our Lord Jesus Christ while on earth lived a life full of obedience, humility, holiness, self-control aMong others. This Session will be divided into four lessons to deal with some characteristics of the Christ-kind of life He lived out while on this earth. The study, therefore, aims at explaining in clear and vivid terms the selected characteristics of the Christ-kind of life towards God the Father, towards Himself, towards His call and ministry and towards others. \n",
        "lessons": [
          {
            "title": "THE CHARACTERISTICS OF CHRIST'S LIFE IN HIS RELATIONSHIP WITH GOD, THE FATHER",
            "introduction": "Christ Jesus, while on earth lived a life that testifies to anon-father relationship between him and the father. His words and behaviour which are those of a perfect servant implies an authority that belongs to God. He was conscious of the fact that He was the only begotten son of God and in this sense, was God by nature. He freely and willingly accepted the Father's will to give His own life for the salvation of humankind. To fulfil this will, He had a constant relationship with the Father. In this relationship, He demonstrated some characteristics that we can emulate for the Christ-kind of life to be formed in us. In this lesson, we shall look at some of the characteristics of Jesus' relationship with God the Father.",
            "scriptures": "Philippians 2:5-8 (Mark 10:45, John 5:19)",
            "content": "Markdown Data",
            "objectives": ["Identify the characteristics that Christ Jesus portrayed as He lived on earth in relationship with God \n","Explain these characteristics clearly \n","Be able to point out some ways to manifest these characteristics in our relationship with God. \n"],
            "exploration": ["Read Philippians 2: 5-8. From the passage \ni. Identify the two main characteristics that Christ Jesus portrayed while He lived on earth, according to the passage. (Note verse 8) \n ii. Explain clearly these characteristics mentioned in question above? \n", "Read the following passages and explain how Christ lived out the two main characteristics identified above; \ni. Mark 10: 45 \n\nii. John 4:34 \n\niii. John 5:19"],
            "application": [" Refer to the answers to Bible exploration 2, where we see the example of how Christ lived out his relationship with the father and discuss how can we also live out the character of humility and obedience in our relationship with God?"],
            "assignment": "After this study, reflect on the lessons you have learnt and make a list of some practical ways by which you will live in humility and obedience in your relationship with God in whatever you do. \n",
            "conclusion": "The life of Christ Jesus, while on earth, was not separated from God the Father. He clearly demonstrated the attitude of humility and obedience by submitting to the will of God and totally depending on Him. In our relationship with God, therefore, we must willingly submit to His will and commit to fully depend on Him. ",
            "remember": "We must be humble and obedient in our relationship with God. \n"
          },
          {
            "title": "THE CHARACTERISTICS OF CHRIST'S LIFE TOWARDS HIMSELF",
            "introduction": "Relating to ourselves, (self-regard, self-respect, self-honour without g is one of the most important relationships in life. We learn from others by relating to them and we expect others to relate with us but we must also learn how to relate with our own selves very well. To relate better with our own selves, we need a relationship with Christ Jesus, because when we give up our personal goals in order to serve Jesus, we are required to answer to God the Father totally. Our relationship with Him informs or shapes how we relate to ourselves and this aids our personal development as true Christians. In this lesson, we will focus on Christ's example of relating to Himself so as to help us develop an attitude of relating well with our own selves. ",
            "scriptures": "1 Peter 2:21-23 (Luke 4:1-4, Heb. 4:15) ",
            "content": "Markdown Data",
            "objectives": ["List the characteristics that Christ portrayed as He lived this God-kind of life in relating to Himself,","Describe how Christ demonstrated these characteristics towards Himself, and","Identify some practical ways of how to apply these characteristics in our daily lives in relating to ourselves."],
            "exploration": ["Read the following passages and identify the two characteristics of Christ Jesus' personality? \ni. Read 1 Peter 2:21-23\nii. Read Luke 4:1 ", "Explain clearly how Jesus demonstrate these characteristics identified in question 1. i. 1 Peter 2:22 \n\nii. Lk 4:1-4","According to 1 Peter 2:28, how was Jesus able to exercise such self-control. \n", "Read Hebrew 4:15 and explain how Jesus was able to exhibit Holiness and Self-control. \n"],
            "application": ["Refer to the answers to Bible Exploration question 2 and identify some practical ways through which we can apply this truth in our daily living. ", "",""],
            "assignment": "Take an aspect of your life, for example, marriage or work and consider such areas as speech, eating, the desire to defend and explain yourself, etc, etc,. Clearly outline the steps you will take to live a holy and self-controlled life while relating to yourself as a believer. You will share your answer with us in the next class. ",
            "conclusion": "Conclusion Christ ensured that He lived a holy and self-controlled life by not defiling Himself in both deed and word. He was able to do this by committing Himself to the Father. This means to totally believe in the standards of Father and depending on the word of God. We emulate this example by making a conscious effort to live a holy and self-controlled life both in deed and word as we trust God's standards completely and depend on His Word.",
            "remember": "We learn from Christ Jesus, how important it is to relate well with ourselves. \n"
          },
          {
            "title": "",
            "introduction": "",
            "scriptures": "",
            "content": "Markdown Data",
            "objectives": ["","",""],
            "exploration": ["", "",""],
            "application": ["", "",""],
            "assignment": "",
            "conclusion": "",
            "remember": ""
          },
          {
            "title": "",
            "introduction": "",
            "scriptures": "",
            "content": "Markdown Data",
            "objectives": ["","",""],
            "exploration": ["", "",""],
            "application": ["", "",""],
            "assignment": "",
            "conclusion": "",
            "remember": ""
          }
        ]
      },
      {
        "title": "",
        "introduction": "",
        "lessons": [
          {
            "title": "",
            "introduction": "",
            "scriptures": "",
            "content": "Markdown Data",
            "objectives": ["","",""],
            "exploration": ["", "",""],
            "application": ["", "",""],
            "assignment": "",
            "conclusion": "",
            "remember": ""
          },
          {
            "title": "",
            "introduction": "",
            "scriptures": "",
            "content": "Markdown Data",
            "objectives": ["","",""],
            "exploration": ["", "",""],
            "application": ["", "",""],
            "assignment": "",
            "conclusion": "",
            "remember": ""
          },
          {
            "title": "",
            "introduction": "",
            "scriptures": "",
            "content": "Markdown Data",
            "objectives": ["","",""],
            "exploration": ["", "",""],
            "application": ["", "",""],
            "assignment": "",
            "conclusion": "",
            "remember": ""
          },
          {
            "title": "",
            "introduction": "",
            "scriptures": "",
            "content": "Markdown Data",
            "objectives": ["","",""],
            "exploration": ["", "",""],
            "application": ["", "",""],
            "assignment": "",
            "conclusion": "",
            "remember": ""
          }
        ]
      },
      {
        "title": "",
        "introduction": "",
        "lessons": [
          {
            "title": "",
            "introduction": "",
            "scriptures": "",
            "content": "Markdown Data",
            "objectives": ["","",""],
            "exploration": ["", "",""],
            "application": ["", "",""],
            "assignment": "",
            "conclusion": "",
            "remember": ""
          },
          {
            "title": "",
            "introduction": "",
            "scriptures": "",
            "content": "Markdown Data",
            "objectives": ["","",""],
            "exploration": ["", "",""],
            "application": ["", "",""],
            "assignment": "",
            "conclusion": "",
            "remember": ""
          },
          {
            "title": "",
            "introduction": "",
            "scriptures": "",
            "content": "Markdown Data",
            "objectives": ["","",""],
            "exploration": ["", "",""],
            "application": ["", "",""],
            "assignment": "",
            "conclusion": "",
            "remember": ""
          },
          {
            "title": "",
            "introduction": "",
            "scriptures": "",
            "content": "Markdown Data",
            "objectives": ["","",""],
            "exploration": ["", "",""],
            "application": ["", "",""],
            "assignment": "",
            "conclusion": "",
            "remember": ""
          }
        ]
      },
      {
        "title": "",
        "introduction": "",
        "lessons": [
          {
            "title": "",
            "introduction": "",
            "scriptures": "",
            "content": "Markdown Data",
            "objectives": ["","",""],
            "exploration": ["", "",""],
            "application": ["", "",""],
            "assignment": "",
            "conclusion": "",
            "remember": ""
          },
          {
            "title": "",
            "introduction": "",
            "scriptures": "",
            "content": "Markdown Data",
            "objectives": ["","",""],
            "exploration": ["", "",""],
            "application": ["", "",""],
            "assignment": "",
            "conclusion": "",
            "remember": ""
          },
          {
            "title": "",
            "introduction": "",
            "scriptures": "",
            "content": "Markdown Data",
            "objectives": ["","",""],
            "exploration": ["", "",""],
            "application": ["", "",""],
            "assignment": "",
            "conclusion": "",
            "remember": ""
          },
          {
            "title": "",
            "introduction": "",
            "scriptures": "",
            "content": "Markdown Data",
            "objectives": ["","",""],
            "exploration": ["", "",""],
            "application": ["", "",""],
            "assignment": "",
            "conclusion": "",
            "remember": ""
          }
        ]
      }
    ]
  }
]
