
  {
    "name": "PEH 500",
    "verses": [
      "O Jesus, Jesus, Son of God, Our High Priest and Intercessor, We love You Lord and cherish. You know my heart and know all things, You know I truly love You Lord, In You there is no darkness. I love, You Lord, With my heart I love You Jesus, You I seek Lord, Seek You with my heart and being ",
      "Lord I confess to You a pain, My love for You is incomplete, I have not loved You fully. When I perceive Your love, O God, I feel ashamed of my poor love, My love for You is so small. Grant Lord, Your love, Fill my heart now, be in my soul and my being. Fill my life with love from You Lord. ",
      "Lord I confess to You a pain, My love for You is incomplete, I have not loved You fully. When I perceive Your love, O God, I feel ashamed of my poor love, My love for You is so small. Grant Lord, Your love, Fill my heart now, be in my soul and my being. Fill my life with love from You Lord. ",
      "For those that love You from the heart, You love them and You give them peace, You fill their hearts with gladness. Their joy is not joy of the world, But joy in trouble and suffering, Joy in all circumstances. Joy they, shall have, Joy eternal, lasting pleasure, You shall give them. Sorrow and all tears shall soon cease. ",
      "I therefore seek You Lord Jesus, Seek Your love and Your compassion, In this I have great pleasure. Help me to do what pleases You, Help me obey You and Your Word, Seek always to please You, Lord. Now and, always, Please You in life, and in suffering and in dying. And be with You Lord in Heaven. ",
      "I’ll soon shall taste of God’s great love, Partake of blessings sweet in Him; Enjoy His holy blessings. I’ll soon, shall see God’s holy face, With these eyes I shall then see Him, I shall not tremble nor fear. Soon I shall drink Living waters And be clothed in God’s righteousness; I shall always be before Him."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 501",
    "verses": [
      "Jesus the very thought Thee, With sweetness fills my breast, But sweeter far Thy face to see, And in Thy presence rest. ",
      "Nor voice can sing, nor heart can frame, Nor can the memory find. A sweeter sound than Thy blest Name, O Savior of mankind. ",
      "O hope of every contrite heart, O joy of all the meek. To those who fall how kind Thou art! How good to those who seek.  ",
      "But what to those who find, ah this, Nor tongue nor pen can show. The love of Jesus what it is, None but His loved ones know. ",
      "Jesus our only joy be Thou, As though our prize wilt be. Jesu be Thou our glory now, And through eternity. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 503",
    "verses": [
      "Safe in the arms of Jesus, safe on His gentle breast, There by His love o’ershaded, sweetly my soul shall rest. Hark! ’tis the voice of angels, borne in a song to me. Over the fields of glory, over the crystal sea. ",
      "Safe in the arms of Jesus, safe on His gentle breast, There by His love o’ershaded, sweetly my soul shall rest. ",
      "Safe in the arms of Jesus, safe on His gentle breast, There by His love o’ershaded, sweetly my soul shall rest. ",
      "Safe in the arms of Jesus, safe from corroding care, Safe from the world’s temptations, sin cannot harm me there. Free from the blight of sorrow, free from my doubts and fears; Only a few more trials, only a few more tears! ",
      "Jesus, my heart’s dear Refuge, Jesus has died for me; Firm on the Rock of Ages, ever my trust shall be. Here let me wait with patience, wait till the night is over; Wait till I see the morning break on the golden shore."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 504",
    "verses": [
      "What glorious blessings have, as lambs of Jesus, For Jesus Christ, Good Shepherd, cares for you. There is no safer place, you’ll find here on earth, Than in Christ Jesus, Lamb of God, Shepherd, What this world cannot offer us, That we now have in Jesus Christ, the Lamb of God. ",
      "This Shepherd will provide green pastures for you, He’ll lead you always by streams of waters. His glorious beauty none has seen nor witnessed, Of His majesty we have but a glimpse. Here on earth we have life of Christ, Life everlasting we have, life eternal now. ",
      "See how, the death of God’s saints is so peaceful, For they are in the arms of Christ, the Lord. Death, Christ destroyed forever by His own Death, Therefore death cannot frighten when it comes. The flesh shall die, and turn to dust, The soul shall live eternal, no corruption see. ",
      "The sheep shall lay in bosom of the Shepherd, The Shepherd’s watchful eyes are on the sheep. No angry wolves shall come devour the Lord’s sheep, For those who live by faith shall overcome. They are secure forever more, They shall not end in death, they shall not fear death here. ",
      "We now have taste of glory and of worship, But soon we’ll have eternal joy in Christ. The Lamb of God shall feed His sheep in Heaven, By water of life, Jesus shall feed them. All shall be plain on that great Day, Great glory we shall bring to Jesus Christ, our Lord."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 505",
    "verses": [
      "Why should I grieve, sorrowful be? If I have Jesus Christ, Who can take Him from me? Who can take away my blessings? Jesus gave all to me, By faith I shall hold Him. ",
      "Naked came I, this world of sin, When I first breathed the air, Life began for me here. Naked shall I leave this life here, When this life ends in death, Like a mist of life be. ",
      "Flesh, blood and life and strength and all, The soul too, with spirit, God gave all for me here. When God takes from me these blessings, Him I’ll praise, all are His, Joyfully, I’ll praise Him. ",
      "When I bear the cross of pain here, When I suffer much pain, I shall not fear evil. Sovereign God who acts best for me, He acts best in His time, His relief shall soon come. ",
      "In His time He will send relief, With all joy and goodness; The cross I will bear then. God is good and full of mercies, He prescribes what we need; He will never leave us. ",
      "Satan’s agents, demons and foes, Cannot overcome us; Only mock God’s people. They come laughing, denigrating, Immanuel, God with us; He will vindicate us. ",
      "Fear not, you that are in Jesus, Christian be not frightened, God shall strengthen and keep. When death threatens you in this life, Patiently, wait for God, And rejoice in your God. ",
      "Death cannot destroy your life now, It is needful event, It releases the soul. Death frees us from suffering on  earth, It opens door for us, It sets path to Heaven. ",
      "When in Heaven I shall have joy, Great joy I shall have then, I shall forget pains here. Life on earth is short and evil, All that is in this world, All shall be soon no more. ",
      "What then is the treasure on earth? It’s nothing, only chaff, It’s like sand, not worth much. Treasure rich is stored in Heaven, Jesus keeps this for me, He shall give this treasure. ",
      "Lord, You are my guide and guardian, You are mine forever, Life eternal, I have. I belong to You, dear Jesus, You have blessed me with life, You have loved and saved me. ",
      "You are mine, I have faith in You, You I trust, God my Light, There is none I have, Lord. Grant me to be with You ever, Where I’ll see You always, Always truly know You. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 506",
    "verses": [
      "“Come to me you that labor”, Jesus says to you today. He shall bear your burdens great, He shall give you rest in Him. ",
      "You, who men have so deceived, Beguiled you and made you blind. Listen to the Word of Christ, Darkness in you shall be light. ",
      "You, who men have so deceived, Beguiled you and made you blind. Listen to the Word of Christ, Darkness in you shall be light. ",
      "When you turn away from sin, And believe in Jesus Christ. He will take away your sin, Life eternal He shall give. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 507",
    "verses": [
      "God is my light, my salvation, Whom shall I fear then in this life? I shall lack nothing good then. I have delight in God’s own Word, Pleasure I have in God’s Spirit, And I have peace in my soul. ",
      "God lives in me and I in Him, And nothing shall come separate us, Eternal covenant, this. The Father gave His own Son, In Christ I have all God’s blessings, Now I am rich in Jesus. ",
      "All pleasures that I find in life, Attractive, lustful things on earth, They satisfy no longer. Our Savior give, Your Manna now, Eternal life, eternal peace, More precious blessings we seek. ",
      "No longer should I live for self, Jesus now lives in me, I’m His, My hope is in Christ Jesus. I do believe in Jesus Christ, I trust the Lord and hope in Him, Soon I shall be with Him in Heav’n. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 508",
    "verses": [
      "What God ordains is always good, What He permits is best here. My life He ordered best for me, I shall be still before Him. My God is good, He knows all things, He’ll be with me in all things, I’ll therefore leave all to Him. ",
      "What God ordains is always good, He gives what is best for me. In paths of righteousness, He guides, Joyful He makes me always. God’s glory is, my heart’s desire, He’ll soon end all my sufferings, Safe I am in Him always. ",
      "What God ordains is always good, Remember me, O Lord now. Wonderful God, my Savior is, Remedy from Him, potent. He’ll not forsake, His chosen ones, I’ll lean on Jesus always, And claim His gracious mercies. ",
      "What God ordains is always good, He is my light and my life. No evil He will grant for me, On Him I shall depend here. I shall then lean on Him always, In sorrow or joy, I’ll trust. His truth abides forever. ",
      "What God ordains is always good, Though now I drink cup painful. The sufferings of this evil life, With hate and envy suffer. I shall not fear, for all shall end, All shall turn for my goodness, All sufferings shall be over. ",
      "What God ordains is always good, I shall believe in His Word. Although the path is hard to tread, I shall press on, till death comes. My Lord and God, Jehovah is, His mighty Hand sustains me, I’ll therefore leave all to Him. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 509",
    "verses": [
      "My soul yield not to despair, Loose not hope, in pain and grief, When the Lord regards you not, In a way He does for some. Be content with God alone, In Him you have all you need ",
      "You and all of God’s children, Shall not seek vain treasures here, For God’s children here on earth, Sojourners they are on earth, For the Lord your Sovereign God, Shall provide manna you need. ",
      "Flesh and all its craving needs, Should not rule your life on earth, For your true inheritance, Is with God in heav’n above, Everlasting joy is there, Everlasting peace shall have. ",
      "Foolish men with anxious care Toil for perishable ‘food’ But God gives to those He loves Wealth imperishable rich Royals of the Lord the King Seek their heritage so full. ",
      "See great treasures of this life, Things that you desire to have. But all these that men possess, They cannot take them away. At the grave where we shall rest, We shall have none of these things. ",
      "What the soul needs most in life, Is the life of Christ the Lord; Death cannot rob you of that, This shall last forever more. When this earth shall be destroyed, What the soul has shall survive. ",
      "Live to please the Lord your God, Look to Him and please Him here. What He gives you here is best, By His plans and purpose gives; If they bring you much pain here, Trust the Lord, He’ll bless at last. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 510",
    "verses": [
      "Living faith I have now, Precious faith this is. Faith that comes from Jesus, Full of life it brings. Priceless gift from Jesus, Gift most wonderful. Faith, true faith, this is a Precious gift from God. ",
      "Living faith I have now, Not faith from this world. Precious faith from Jesus, In His Blood, such faith. Those that seek destruction, Turn their backs to God. In the time of death, they Shall all run from God. ",
      "Chosen ones of Jesus, God’s elected ones. In Christ you have new life, Freedom you have now. Precious Blood of Jesus, In this you are free. Jesus who has conquered, Sits with God on High. ",
      "Therefore come to Jesus, Come now to the Lord. Crown of life so precious, He gives all His own. Holy Spirit seeks you, To the Savior bring, Branches of the Vine we, May all be in Christ."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 511",
    "verses": [
      "Jesus is my heart’s joy, I desire You, Jesus, You, I’ll glorify. What is there to frighten, Frighten me in this life, Jesus is with me. God’s own Son, I love You much, Nothing pleases me than Jesus, You alone, I love, Lord. ",
      "I shall hide in You, Lord, Refuge safe is Jesus, No evil can touch. Satan shall be worried, Demons shall be frightened, You are mine, O Lord. Thunder, lightening, all perils, Danger and all persecutions, Jesus Christ, protects me. ",
      "Principalities, powers, Death and life and things here, None can harm me here. Madness is this world’s life, True life is in Jesus, In Him I rejoice. God Himself protects me, Devils and all hell do know this, Silent be, before God. ",
      "All things here shall perish, Therefore trust in Jesus, Lasting grace He gives. The vain glories of life, Transient, they shall not last, Pleasures too shall cease. What can separate us from God? Neither death nor angels can do, Neither suffering, nor pain. ",
      "Spirit of depression, Get behind me, leave me, I have joy in Christ. All the Saints of Jesus, Suffer much in this life, But great blessings have. I may suffer shame in life, But I have great hope in Jesus, He is source of all joy. ",
      "Father God in Heaven, Hallowed be Thy Name now, Your Kingdom shall come. Give us daily bread, Lord, Forgive our trespasses, Cover all our sin. From evil, deliver us, Lead us not into temptation, Father, hear our prayer. ",
      "Lord receive my spirit, Take my soul and body, Take all that I have. To You I commit all, I yield all to You now, I yield all in death. Refuge I have is in Christ, When the time has come to leave here, My life, I’ll yield to Him. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 512",
    "verses": [
      "Christians who are good and faithful, They shine like stars in Heav’n, They are so beautiful. Who the Lord Himself has so cleansed? They are children of God, Christ their elder Brother. ",
      "Kingdom of this world and crowns here, They are of no value, They shall all soon perish. Crown of life that God has for you, You shall surely have soon, It is safe in Heaven. ",
      "Glory of the Lord is hidden, Hidden from all mankind, It is hidden, covered. Glory of God shall soon be seen, It’s hidden in the Lord, Glory, God shall reveal. ",
      "Jesus, Bridegroom of His Church here, Knows the pain of the Bride, He prepares the Bride well. Comfort He brings to His Bride here, He makes her, beautiful, Jesus loves the Bride much. ",
      "The Bride shall rejoice with great joy When she sees, the Bridegroom, Come to her from Heaven. When this Day comes for the Bridegroom, He’ll be one, with the Bride, Nothing shall separate them. ",
      "She shall reign with Christ in Heaven, Everlasting, Kingdom, Precious jewels all seen. On that Day all people shall know, That Jesus is so great, All shall bow and worship. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 513",
    "verses": [
      "Our Jesus, Lord, You the Savior, We come to You Lord, You are the Savior. Who has life in himself? None but the Lord Jesus. We come to You Lord; You are the Savior. ",
      "Our Jesus, Lord, you are Savior, We come to You Lord, that you’ll save us now. Who is the one who died? Jesus, You are the One. We come to You Lord; You are the Savior. ",
      "Christ Jesus, Lord, the light of Life, We come to You Lord; you eternal Light. Who took darkness away? Jesus Christ, You did so. We come to You Lord; You the light of Life. ",
      "Christ Jesus, the Way to Heaven, We come to You Lord; show us way to Heav’n. Who is the one to save? Jesus, You are the One, We come to You Lord, show the way to Heav’n. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 514",
    "verses": [
      "Christians expect the coming of Jesus, Christ’s Word is sure and His promises stand. In stormy winds of life, and in all dangers, He is with us, in the boat of our lives. When I have troubles, faced with persecutions, In Christ alone, I must trust, and hold to Him. ",
      "Should there be famine, with nothing to eat here, The land, be dry, with no water or rain. Let scorching sun dry out crops in our farmlands, Our lands may be dry and hard as the stone. The peace we have in Christ shall remain ever, For we know God our creator lives and reigns. ",
      "The good you seek in this life and all blessings, They are beyond the grave and life on earth. Heaven shall be yours, why worry in this life, Be not afraid nor distressed, child of God. Take heart you servants of Jesus the Savior, Be still and know that the Lord our Lord is God. ",
      "God’s lasting peace and His joy shall be for you, With life eternal and all blessings give. You shall have riches abundant in Heaven, And shall rejoice with all angels and saints. Soon, the Lord shall come with glory and power, He’ll gather ‘Home’, all His children from the earth. ",
      "To Jesus Christ all authority given, In Him we all shall be strong and endure. You are exalted, Your Name is above all, You are the Comforter for the fearful. Grant us Your grace to wait upon the Father, Patiently wait on Him who shall vindicate. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 515",
    "verses": [
      "Rise up and come to Jesus, Why are you cast down low? Why are you sorely troubled? And worried with great fear. Let not the devil trick you, He seeks you to destroy, He seeks to steal joy from you, The joy the Savior gives. ",
      "Lift up your head and say now, “Get behind, me Satan”, You seek to harm with venom, You seek to steal my joy. Your head Jesus crushed, destroyed, His Blood availed for me. His Blood has cleansed and purchased, Eternal life, I have. ",
      "The world cries out to tell me, I am not loved by God. This is not true, is falsehood, A great lie they proclaim. If God hates mankind truly, He shall not give His Son, To die to save us sinners, He’ll not bless me this much. ",
      "I am God’s own child truly, He is mine evermore. Who shall break bond between us? Not Christ who died for us. My God has plans for me here, Suffering He may allow. His will, expresses for me, All things shall come to pass.",
      "Do not regard so lightly, The discipline of God. The Saints the Lord chastises, Are helped to grow in Him. Why then should I lose courage? When God works on me, chastening? When God prunes to rid of sin, To make me more righteous. ",
      "We labor in great pain now, With weeping we serve here. But soon there shall be blessings, God’s promises shall stand. Harvest time shall come quickly, You shall soon see the fruit. With joyful songs, you’ll reap much, You’ll reap eternal fruit. ",
      "All believers must note this, And not lose heart again. The present suffering and pain, Shall be replaced with joy. Come then to Christ, rejoicing, Sing to the Lord and praise Him, Come glorify and worship, The Lord shall act. Amen."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 516",
    "verses": [
      "To You Lord I lift up my soul, O my God in Thee I’ve trusted. Let me not be put to shame, You my God shall help me through. ",
      "When Your help seems far away Lord, Help me to be still before You. For Your time is always right, You have perfect plans for us. ",
      "As a father waits for right time, To give what his children will need. So the Lord does for His saints, He gives to us what we need. ",
      "I rejoice in God my Savior, I still trust Him in my sufferings. For He knows and cares for me, More than earthly parents do. ",
      "I can boast before the devil, And can smile at evil he does. Cross I bear, I dread that not, God my Father is with me. ",
      "I shall smile when death approaches, I shall boast of grace of Jesus. All who envied and hated, God has made me His own friend. ",
      "If I am rejected in life, I have Home in Heaven above, This I seek to have in life, I have more than all I need. ",
      "If I have the Lord my Savior, I shall give up all I have here, Even in death in the grave, Lord, You are my life and all. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 517",
    "verses": [
      "The sorrows of this present earth, All pleasures too on earth. None can compare with life in Heav’n, Eternal joy we’ll have. ",
      "Dwell not on vanities of life, Seek not pride, riches here. Sorrow and pain may have, But Jesus Christ is all, in all. ",
      "I seek no treasures of this life, They do not last for long. In Christ alone, I hope, Eternal life, I have in Him."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 518",
    "verses": [
      "Hold Thou my hands, dear Jesus, Lead Thou me on. Be with me always, throughout, Depart not, Lord. This life I cannot travel, Fearful it is. If You will not go with me, I’ll neither go. ",
      "My faint heart strengthen, Jesus, In You abide. In joy and in all sorrow, This heart make still. Grant me abiding peace, God, Peace from You Lord. When raging storms are o’er me, Be near me, Lord. ",
      "When doubts and fears assail me, Help me, dear Lord. You are my Rock and Shield, Lord, In You I trust. Hold Thou my feeble hands, Lord, Help me, O God. And guide me through life, Jesus, To Home bring me. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 519",
    "verses": [
      "Who would true valor see, Let him come hither. One here will constant be, Come wind, come weather. There’s no discouragement, Shall make him once relent, His first avowed intent, To be a pilgrim. ",
      "Who so beset him round, With dismal stories, Do but themselves confound, His strength the more is. No lion can, him fright, He’ll with a giant fight, But he will have a right, To be a pilgrim. ",
      "Hobgoblin nor foul fiend, Can daunt his spirit, He knows he at the end, Life shall inherit. Then fancies fly away, He’ll fear not what men say; He’ll labor night and day, To be a pilgrim."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 520",
    "verses": [
      "O Jesus I have promised, To serve Thee to the end. Be Thou forever near me, My Master and my Friend. I shall not fear the battle, If Thou art by my side, Nor wander from the pathway, If Thou wilt be my Guide. ",
      "O let me feel Thee near me, The world is ever near. I see the sights that dazzle, The tempting sounds I hear. My foes are ever near me, Around me and within, But Jesus draw Thou nearer, And shield my soul from sin. ",
      "O let me hear Thee speaking, In accents clear and still, Above the storms of passion, The murmurs of self will. O speak to reassure me, To hasten or control, O speak and make me listen, Thou guardian of my soul. ",
      "O Jesus Thou hast promised, To all who follow Thee, That were Thou art in Glory, There shall Thy servant be. And, Jesus I have promised, To serve Thee to the end, O give me grace to follow, My Master and my Friend. ",
      "O let me see Thy footprints, And in them plant mine own; My hope to follow duly, Is in Thy strength alone. O guide me, call me, draw me, Uphold me to the end; And then in Heaven receive me, My Savior and my Friend."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 521",
    "verses": [
      "My Lord, to You I yield my heart, It is my gift to You. It is Your own, You gave me all, I give it back to You. ",
      "Break me and melt my heart for You, Mould it to worship You. And set it free from pride and self, With tearful joy, I give. ",
      "Lord strengthen faith I have in You, The Blood You shed, is power, By this I’m sealed as Your own child, Forgiveness have, for sin. ",
      "Your righteousness and life from You, Give me as gift dear Lord, You took away, sin of this world, You paid all wages due. ",
      "The Light of God that shines in us, The light that shows the truth, Take darkness, falsehood, hate away, And lead me right in life. ",
      "Help me a faithful servant be, Faithful to You my God; Temptation to distract, is great, Wisdom of this world, traps. ",
      "Help me devote my heart to You, Help me to stand for You; You Lord will not, forsake Your child, Your glory gives much joy. ",
      "Lord, take my heart and make it Yours, I yield it all to You; When I complete the journey here, Then I shall be with You. ",
      "I leave the pleasures of this world, My heart I give to Christ! I give it to You as a gift, Now and for evermore! "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 522",
    "verses": [
      "My soul hear now the Word of God, The Word of Christ Your Lord, Obey His voice and follow Him, When You His voice shall hear. ",
      "Be humble, meek and lowly then, Praise God for all His gifts, And give Him thanks for chastening you, The best He gives always. ",
      "When Jesus Christ, glory reveals, Bestows His gifts on you, Remember this is grace from Him, His grace He gives to all. ",
      "When Jesus calls to work with you, Rise up and follow Him; When He has other plans for you, Silently wait on Him. ",
      "My soul, give all to Christ your Lord, Give heart, mind and spirit, In life, in death and evermore, Give Him eternal praise. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 523",
    "verses": [
      "Christ the Lord is King of glory In You we have strength we need. You did not abhor the Virgin, Mary’s womb You chose to be. You have carried all our burdens, All diseases Lord You healed. In Your glorious Resurrection, Your Church, established in us. ",
      "Gracious Lord, full of compassion, You have saved us from our sin. On the Cross you died for sinners, New life we all have in You. Grant us to be faithful servants, Fill us with Your Spirit, Lord, Sin forgiven, we have new life, Your Church, establish in us. ",
      "Gracious gifts You gave to all men, Varied gifts y You gave the Church. Lord inspire faith, love within us, Take away self-centered life. In our varied missions on earth, Gracious Spirit, help us all. Grant us meekness like You Jesus, Your Church, establish in us. ",
      "By our work and love we preach You, We reveal You to the world. Lord, You know how frail we all are, Strengthen us to live for You. In humility and meekness, Make us be like You, O Lord. Let Your Kingdom come, O Jesus, Your Church, establish in us. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 524",
    "verses": [
      "“Must I go, and empty handed” Thus my dear Redeemer meet? Not one day of service give Him? Lay no trophy at His feet? ",
      "“Must I go, and empty handed” Must I meet my Savior so? Not one soul with which to greet Him, Must I empty handed go? ",
      "Not at death I shrink or falter, For my Savior saves me now. But to meet Him empty-handed, I shall be ashamed in Heav’n. ",
      "O the years in sinning wasted, Could I but re-call them now; I would give them to my Savior, To His will I’d gladly bow ",
      "O the years in sinning wasted, Could I but re-call them now; I would give them to my Savior, To His will I’d gladly bow,"
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 525",
    "verses": [
      "Son of God, eternal Savior, Source of Life and Truth and Grace; Son of Man, whose birth incarnate, Hallows all our human race; Thou, our Head, who is in Heav’n, For Thine own You ever plead, Fill us with Thy love and pity, Heal our wrongs, and help our needs here. ",
      "As Thou, Lord, has lived for others, So may we for others live. Freely have Thy gifts been granted, Freely may Thy servants give. Thine the gold and silver all, Thine the wealth of land and sea, We but stewards of Thy bounty, Held in solemn trust, for Thee, O Lord. ",
      "Come, O Christ, and reign among us, King of Love and Prince of Peace; Hush the storm of strife and passion Bid its cruel discords cease. Ah, the past is dark behind, In the darkness we all walked, But before us gleams the vision, Vision of the coming brotherhood! ",
      "See the Christ-like host advancing, High and lowly, great and small, Linked in bonds of common service, For the common Lord of all Thou who prayedst Thou who willest, That Thy people should be one. Grant, O grant our hope for much fruit, Here on earth Thy will be done, O Lord. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 526",
    "verses": [
      "Come saints of Christ, come fight the foe, Be victorious as soldiers. In this world and in all our lives, There is no peace around us. All those that would not fight the foe, They shall not have the crown of life. ",
      "The devil comes so craftily, Pleasure of flesh and lust brings. Forsake the flesh, forsake its lusts, These are temptations, trappings. If you shall not forsake the flesh, You shall not be victorious.",
      "Remember that you promised God, You’ll fight the fight against flesh. The Lord regarded you valiant, He sent you into battle. Those that will not fight for the Lord, They shall not have joy of the Lord. ",
      "In this great fight turn not your back, But stand face to face and fight. Leave not the fortress in this fight, For then the devil shall hurt. Do not surrender to evil, This shall be great defeat for you. ",
      "The victors that come from the fight, They shall be rulers with God. Jesus shall welcome all warriors, They shall receive great honor. The Name of God, Jesus shall write, A new Name He shall write for them. ",
      "My brethren fight the good fight now. For you shall win the battle. With great courage, perseverance, God shall fulfill His promise. Be faithful to the Lord till death, A crown of life He shall give you. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 527",
    "verses": [
      "Come follow Jesus Christ the Lord, Follow the Lord Almighty. Be careful in this life of sin, Hear Him, obey Him servants. “If any man will follow me” Himself, deny the cross to take. ",
      "“I am the Light”, Christ Jesus said, Holy He is before you. The way to life is by His Light, There is no other way, friend. “I am the Way, the Truth, the Life”, Jesus said, to all who seek Him. ",
      "Learn from the Lord, learn from His life, The Lord so humble, loving! The Lord who is the Word of God, He treasured Scriptures, believed. Grant that my mind, my spirit all, Dwell on the Lord and follow Him. ",
      "Flee from all passions of this world, Flee fornication, sinful. Pride, sinful life put all away, Let not your heart desire these. Your life is rooted in the Lord, In Christ you have a hope of Heav’n. ",
      "When you are pressed on every side, Jesus is near to help you, He will protect, defend you, friend, He will deliver and save. The enemy shall flee from you, He’ll flee when Jesus Christ appears. ",
      "All those that seek to save their lives, They shall lose soul so precious. But they that lay down here their lives, They shall have life in Heaven. All those that bear the Cross in life, They shall please Jesus Christ the Lord. ",
      "Come now with heart and soul and mind, Come follow Jesus Christ now. Come suffer with the Lord Jesus, The hope of glory, will share. Be faithful unto death, dear friend, The crown of life, Jesus will give. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 528",
    "verses": [
      "All you that follow Jesus Christ, True Saints of God arise; Come one come all His trumpet calls The clarion call He sounds. His banner has been raised, Come now, come soon to Him, Come all you Saints of God the Lord Come now the trumpet calls. ",
      "All you who seek to serve the King, Come now and wait for Him. His Spirit He will give to you, To serve Him well and true; He comes with great reward, For those who serve Him now, The hidden Manna He will give, Rich clothes He’ll give to you. ",
      "You soldiers put your armor on, And watch and pray always. Be ready for the battle now, You may be on your own. With God’s Word in your hand, His promises believe, For soon the battle shall be o’er Sweet vict’ry shall be yours. ",
      "The field for battle is this world, Satan the enemy. He comes deceiving with sweet things, To compromise our faith. He also persecutes, In great anger he fights. So hold firmly to Jesus Christ, That you may stand the foe. ",
      "Fight sin and hateful things in life, This is command from Christ Be faithful, keep all promises, And fight the battle well. Hold firmly to the Lord, Be faithful in all things, Lead life of sacrifice of love, Reward awaits you soon. ",
      "Remember that Jesus the Lord, Himself is in this fight. He suffered pain and toil and death, Through which the glory came. He will help you quite through, He loves His dear ones here, He’ll bring them Home to glory soon, Eternal blessings give. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 529",
    "verses": [
      "Jesus still lead on, Till our rest be won. And although the way be cheerless, We will follow calm and fearless; Guide us by Thy Hand, To our Fatherland! ",
      "If the way be drear, If the foe be near. Let not faithless fears o’ertake us, Let not faith and hope forsake us, For through many a foe, To our Home we go. ",
      "When we seek relief, From a long-felt grief. When oppressed by new temptations, Lord increase and perfect patience, Show us that bright shore, Where we weep no more. ",
      "Jesus still lead on, Till our rest be won. Heavenly Leader, still direct us. Still support, console, protect us, Till we safely stand, In our Fatherland!"
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 530",
    "verses": [
      "I know a precious treasure here, A treasure that exceeds all. This treasure is in God’s Kingdom. Righteousness by faith, God gives. Exceeding great wealth we do have, By faith in God, have righteousness. ",
      "The Father shall not give us up, Cast away sinful nature. The Lord will give all that you need, All that we need to serve Him. If we shall faithful servants be, Great shall be our reward in Heaven. ",
      "Do not seek pleasures of this life, Let not your heart crave pleasures. Seek things above, eternal things, God’s righteousness, seek in life. All that you need to drink and eat, God shall Himself, provide for you. ",
      "Those that labor, seeking pleasures, Vain things they only seek here. Temptations great they shall fall in, Much hurt they shall bring on them. The love of money is evil, It leads men to great sin on earth. ",
      "Father we come to seek Your grace, Grant us our daily bread, Lord. The needs of body, You know well, That too You shall provide us. Protect us from evil desires, Deliver us from evil ways. ",
      "Nothing we brought into this world, Nothing we shall take from it. But bless us Lord with heavn’ly things, Bless us with righteousness, Lord. When we depart this earth in death, We shall be with You, Lord, in Heav’n. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 531",
    "verses": [
      "In freedom of my Savior Lord, I walk in path to Heav’n. In His, own footsteps, plant my own, The Lord before me walks. ",
      "In desert lands I travel now, Great throngs of people meet. But there is Christ, who guides me through, With Him, I am so safe. ",
      "Great foes surround me, seek to harm, Traps deadly they all set. But Jesus Christ protects and guides, He leads me safely through.",
      "With Jesus right beside me now, The world I shall forsake. My great desire, is for the Lord, Christ Jesus keeps me safe. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 532",
    "verses": [
      "Christian, work for Jesus, Who on earth for thee, Labored, wearied, suffered, Died upon the Tree! ",
      "Work with lips so fervid, That Thy words may prove, Thou, has brought a message, From the Love of God. ",
      "Work with hearts that burneth. Humbly at His feet! Priceless gems on offer, For His crown made meet.",
      "Work with prayer unceasing. Borne of faith’s strong wing! Earnestly beseeching, Trophies for the King!",
      "Work while strength endureth, Until death draw near. Then the Lord’s sweet welcome, Thou in Heav’n shall hear. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 533",
    "verses": [
      "In great humility, O Lord, We bring our gifts to You. An offering pleasant we now bring, With heart of love we give. Dear Lord Jesus, You gave Your life, You laid Your life to save. Grant us the grace to give You all, Until we leave this earth. ",
      "Give us the grace to love all men, Serve others with Your love. Help us to offer sacrifice, Our lives laid down for all. You Saints of God, this must you seek, Obey the call to love. Remember Christ shed blood to save, So love all people here."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 534",
    "verses": [
      "Fight the good fight with all thy might, Christ is thy strength and Christ thy right; Lay hold on life and it shall be, Thy joy and crown eternally! ",
      "Run the straight race; Through God’s good grace, Lift up thine eyes, and seek His face. Life with its path before us lies, Christ is the way, and Christ the prize. ",
      "Cast care aside; Lean on thy Guide, His boundless mercy will provide. Lean, and thy trusting soul shall prove, Christ is thy life, and Christ thy love. ",
      "Faint not, nor fear; His arm is near, He changeth not, and thou art dear. Only believe, and thou shall see, That Christ is all in all to thee. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 535",
    "verses": [
      "All saints put on God’s full armor, You that are in Jesus, be praying, The enemy seeks you to harm. Satan comes roaring against you, Be watchful, ready for the battle, ",
      "The powerful Word of God must have. The enemy comes now, But Jesus is with us, Hallelujah.  In Him we shall Victorious be, We shall defeat the evil one. ",
      "Pray that Jesus Christ may help you, Sin pleasures to rid from your life now, That you may righteous be in Him. Have the Name of Jesus always, ",
      "For in His Name you have all power. You shall have power from the Lord. You shall not stumble, fall. When life is hard for you, Do remember. Your Home is Heav’n And not on earth, You shall have peace eternal there. ",
      "Death shall come and you’ll be no more, Fight then with all your might in each day. We soon shall leave this world of sin. Day of Judgment soon shall be here, And all the dead in sin shall perish, The righteous shall have life in God. ",
      "If this world hates you now, And persecutes you much, Seeks to kill you. You shall prevail, For Jesus lives, You shall behold His glorious face. ",
      "Jesus strengthen all Your saints here, You shed Your precious Blood to save us. Make us victorious, Lord we pray. Come now Lord reveal your presence, And drive away all fear of evil, Give us Your Holy Spirit now. ",
      "Pour love into our hearts, And bless us with Your peace, Give us great joy. With this we shall Courageous be, And travel to our home in Heav’n. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 536",
    "verses": [
      "Take my life, and let it be, Consecrated Lord to Thee; Take my moments and my days, Let them flow in ceaseless praise. ",
      "Take my hands, and let them move, At the impulse of Your Love! Take my feet and let them be, Swift and beautiful for Thee. ",
      "Take my voice, and let me sing, Always, only, for my King; Take my lips, and let them be, Filled with messages from Thee ",
      "Take my silver and my gold, Not a mite would I withhold; Take my intellect, and use, Every power as Thou shall choose. ",
      "Take my will, and make it Thine, It shall be no longer mine; Take my heart, it is Thine own, It shall be Thy Royal Throne. ",
      "Take my love; my Lord, I pour At Thy feet it’s treasure-store. Take myself and I will be Ever only all for Thee. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 537",
    "verses": [
      "Come to Jesus, He will teach you, You shall learn much from the Lord. All that, follow Christ the Savior, They are His true Saints on earth. Those that trust in Jesus Christ, And proclaim His Name always. Those that strive to please their Master, They shall also bless others here. ",
      "Blessed are the poor in Spirit, Humble men and women are. They are those that boast of nothing, But they put their trust in God. They give thanks for all they have, To such God’s Kingdom belong. All poor in spirit are blessed, They are glorified in Jesus. ",
      "Blessed are all those that mourn here, All that, grieve and seek the Lord. All that sorrow, all that weep much, All that mourn for their own sins. Those that weep before the Lord, Plead with God for all their sins. God shall comfort all such mourners, Blessed they shall be forever. ",
      "Blessed are all peacemakers here. Blessed are the meek on earth. Blessed are the persecuted, All who suffer for the right. Blessed when you suffer much, Suffer evil and great shame. When you leave these for the Lord God, Great reward He shall give to you. ",
      "Blessed they that thirst and hunger, Seek the righteousness of God. Blessed you are, when men revile, Utter all kinds of evil. Those that thirst for righteousness, Hating all that is evil. Faithful servants of Jehovah, They shall all be satisfied soon. ",
      "Blessed are they that show mercy, Heart of compassion they have. They that pity all that suffer, They that seek the poor to help. They that pray for those in need, They that freely give all things, They that love the poor and needy, Great reward they all soon shall have. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 538",
    "verses": [
      "Problem with file"
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 539",
    "verses": [
      "A bosom friend, the Lord my God is, He is present on earth and Heav’n, He knows my worries and my problems And gives me help from Heav’n above. All power on earth and in the Heavens, Is given to this heavenly friend! ",
      "His Name is Jesus Christ, the Savior, He is Redeemer of the world; He has redeemed us from the devil, And from eternal death and hell. O Jesus, Lover and Redeemer, Our wondrous, everlasting friend, Christ ",
      "He is a friend to all His creatures, He is the Savior of sinners; He draws us to Himself to save us, To taste the sweetness of His Love. None can be found so truly friendly, None can compare with Jesus Christ, Lord!"
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 540",
    "verses": [
      "Love that made me in Your image, Lord in Your image You made me. Glorious love that came from above, Love You saved us, sinners on earth. Love, I am yours forever more, I shall live for You Lord my God. ",
      "Love that knew me before I came, Eternal love You have for me. Love, You came as flesh to live here, Became like me on dreadful earth. Love I am Yours forever more, I shall live for You, Lord, my God. ",
      "Love, You suffered pain and sorrow, In love You died for me and all. Love You agonized for sinners, In You we may have life in full. Love I am Yours forever more, I shall live for You, Lord, my God. ",
      "Love that binds me now to the Cross, The Cross You bore for me and all. Love that claims my heart and my all, To You I give my life and all. Love I am Yours forever more, I shall live for You, Lord, my God. ",
      "Love shall be with me unto death, He shall raise me from death one Day, Love shall give me a precious crown, I shall be with Him in Heaven. Love I am Yours forever more, I shall live for You, Lord, my God."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 541",
    "verses": [
      "One thing so precious in this life, Mary has found and treasured much. That I should seek with all my heart, Search for that only in this life. ",
      "This treasure is in Jesus Christ, Jesus the priceless Gift to find. There is no treasure to compare, The Gift of Heav’n, none else we know. ",
      "I am so blind and little know, I need the Holy Spirit’s help. To guide me in the narrow way, The narrow way that leads to God. ",
      "Open my mind and shine Your light, Grant me to understand Your Word. Thy hidden truths, the precious Word, The Word of Truth that leads to Heav’n. ",
      "Christ Jesus, Lord of all my life, You saved me by Your precious Blood. By faith in You, new life I have, Eternally, I’m bound to You. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 542",
    "verses": [
      "Heal us O Lord Immanuel, Your healing touch we need, Restore our broken spirit Lord; Savior we come to You. ",
      "Our faith is feeble and so weak, We doubt You often, Lord. Do not withhold Your loving grace, For we have none but Thee. ",
      "We come to You, our Loving God, With tears, like him who said, “O Lord my God, yes, I believe, Help Thou my unbelief”. ",
      "She too who secretly touched You, You welcomed and You healed. Blessing with peace and saying then, “Your faith has made you whole”. ",
      "Like her, we come to You our Lord, This healing touch we need. Receive us now with mercy Lord, Grant us Your healing grace. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 543",
    "verses": [
      "No wisdom of man can ever discern, God’s way and God’s truth, that leads us to Heaven. In dust and in ashes this flesh shall be lost, Dwell not on man’s wisdom, The Lord shall provide. ",
      "We panic and fret, in trouble and stress, Forgetting to seek, our Savior the Lord, Let storms rage with thunder or sun’s scorching heat, Look only to Jesus, The Lord shall provide. ",
      "When you are distressed, with lustful desires, When this troubles much, in soul and in mind! Turn to the Lord Jesus on Golgotha’s Cross, And pray without ceasing, The Lord shall provide. ",
      "When you are confused, seeking for the right, When you are tempted to fear and to fret, Take heart, the Lord Jesus is always with you, Be joyful, beloved, The Lord shall provide. ",
      "The Lord God knows well, your troubles and all, Strength He will provide, enough for the storm. His purpose shall ripen for you at His time, This too is His plan, then The Lord shall provide. ",
      "When grave is your home, the body it keeps; When this body lies in wait for new life; Then faith shall be active, life above prepares, Faith shall sing from this earth, The Lord shall provide. Albert Knapp ",
      "Be silent in life, in all things be still, His grace sufficient, shall keep you in life, When you walk in darkness and no light you see, Believe in Christ Jesus, The Lord shall provide."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 544",
    "verses": [
      "Trust your life to Jesus Christ, Bow to Him in full submission. Your own strength is not sufficient And you need His constant help. Trust your life to Jesus Christ. ",
      "Trust yourself to Jesus Christ, He protects the meek and humble; He’ll support you when you stumble, Lead you to eternal life. Trust yourself to Jesus Christ. ",
      "Give your all to Jesus Christ, When the devil tries to hurt you, Your Lord Jesus won’t desert you; He will help you to succeed. Give your all to Jesus Christ."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 545",
    "verses": [
      "Rock of Ages, cleft for me, Let me hide myself in Thee. Let the water and the blood, From Thy riven side which flowed. Be of sin the double cure, Cleanse me from its guilt and power. ",
      "Not the labors of my hands, Can fulfill Thy Law’s demand; Could my zeal no respite know, Could my tears for ever flow, All for sin could not atone, Thou must save, and Thou alone. ",
      "Nothing in my hand I bring, Simply to Thy Cross I cling; Naked, come to Thee for dress, Helpless, look to Thee for grace; Foul, I to the Fountain fly; Wash me, Savior, or I die. ",
      "While I draw this fleeting breath, When mine eyelids close in death; When I soar through tracts unknown, See Thee on Thy Judgment Throne; Rock of Ages, cleft for me, Let me hide myself in Thee. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 546",
    "verses": [
      "Come, let us to the Lord our God, With contrite hearts return; Our God is gracious, will not leave, The desolate to mourn! ",
      "His voice commands the tempest forth, And stills the stormy wave; And though His arm be strong to smite, ‘Tis also strong to save! ",
      "Long hath the night of sorrow reigned, The dawn shall bring us light; God shall appear, and we shall rise, With gladness in His sight! ",
      "Our hearts, if God we seek to know, Shall know Him, and rejoice. His coming like the morn shall be, Like morning songs His voice. ",
      "As dew upon the tender herb, Diffusing fragrance round; As showers that usher in the Spring, And cheer the thirsty ground! ",
      "So shall His presence bless our souls, And shed a joyful light; That hallowed morn shall chase away, The sorrows of the night!"
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 547",
    "verses": [
      "I know that my Redeemer lives, What joy the blest assurance gives! He lives, He lives, who once was dead; He lives, my everlasting Head. ",
      "He lives, to bless me with His love, He lives, to plead for me above; He lives, my hungry soul to feed, He lives, to help in time of need. ",
      "He lives, and grants me daily breath; He lives, and I shall conquer death; He lives, my mansion to prepare; He lives, to lead me safely there.",
      "He lives, all glory to His Name, He Lives, my Savior, still the same; What joy the blest assurance gives, I know that my Redeemer lives! "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 548",
    "verses": [
      "Cast all cares, troubles, Anxieties, worries, On Jesus Christ who is your Savior. ",
      "Distressed with hardships, The soul with problems, Take refuge and comfort in Jesus. ",
      "He’ll hear and answer, He knows your troubles, The merciful Christ shall come to save. ",
      "Our gracious Jesus, Sweet blessings He’ll give, Peace from His own Father, He’ll give you. ",
      "Christ shall protect you, Fear is ever gone, Death is no longer a dread for you. ",
      "If Jesus, your Lord, His own life, your life, Then you have eternal peace in Him. ",
      "Take heart, your troubles All soon, be over. You’ll drink from river of life in Heav’n. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 549",
    "verses": [
      "I am one of Jesus’ lambs, In this blessing I rejoice. I have Christ as Shepherd in life, In Him I have all I need here. Jesus knows me and loves me, And He calls me by my name.",
      "His banner is over me, I am safe and sound in Him. By His riches, I lack nothing, I am filled with all His blessings. When my soul is thirsty here, To the ‘waters’ He’ll lead me.",
      "Joy and peace, I have in Him, Jesus loves and cares for me. When this earthly life is over, To the Father, You will bring me, In Your bosom, I shall lay, Amen! Great joy this shall be."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 550",
    "verses": [
      "The true life of Christians must shine with bright radiance, This life must shine brightly in toil on this earth. For what they have received is light from Christ Jesus, No one knows of such light, but those who are blessed.",
      "What none on earth, has heard, What too no one has seen, That they now have seen with eyes opened from Heaven, They now see God’s glory; the Kingdom have received.",
      "These all have come from the race of the first Adam, The nature of Adam, they too have all shared. They struggled in this life with suffering from bondage, They share all flesh needs here, of food and of drink.",
      "They share with all mankind, The cares of the flesh here, They share in all things this flesh seeks to live on earth, But there is one difference; vain pleasures they now hate.",
      "The life they live in this flesh, is from Christ Jesus, For they all have new life, new life in the Lord. The Blood of Christ Jesus is source of life for them, Born anew in Jesus, they are His own now.",
      "Angels are one with them, They are blessed brothers, We join with them singing the praise of Christ Jesus, This joyful fellowship; the blessed host above.",
      "Christ who is our own life, shall come in great glory, Jesus the Christ we’ll see in glory and might. This glory of Jesus shall fill our hearts with joy, But great shame shall cover all who hated Him.",
      "Those who have loved Jesus, They shall reign with Him then, They shall all shine with the radiance of Jesus Christ, Sing joyfully praising, sing always to their God. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 551",
    "verses": [
      "Jesus is my Lord forever, I shall worship Him alone. What shall separate me from Jesus? None can turn me back from Him. You are Lord my life’s foundation, And my spirit’s righteousness, As the stem feeds all its branches, From You Lord I have all needs.",
      "Who gives grace sufficient for needs? It is Jesus Christ the Lord. Precious grace and grace in fullness,Jesus gives to all in need. Who shall comfort me in sorrow? Jesus Christ my truest friend. Authority, granted Jesus, Every power reposed in Him.",
      "Who is there like Jesus Christ, Lord? Who has laid His life like Christ? Precious Blood Jesus shed for us, Blood of Jesus gave us life. So I now belong to Jesus, He is mine forever more. I have promised now to follow,Follow Jesus Christ alone",
      "Let me suffer pain and sorrow, I shall always follow Christ, To Him I’ve committed all things I’ve resigned my life to Him. I desire to do His will now And submit my life to Him, What is best for me, He’ll give me, Therefore I’ve surrendered all.",
      "Help me Lord to travel this life, As I walk through death’s dark vale. When my eyelids close in death here, As death’s clouds come cover me. Place Your Hands upon Your servant, Blessings pour upon me, Lord. Let Your servant hear You saying, “My Rest, you shall enter now”.",
      "When time comes for me to leave here, Grant me Lord the faith to trust, Take away from me fear of death, Be the Light for me in death. When this life is dimmed by darkness, Shine Your light so brightly then. That I may come Home to meet You, Pilgrim from this world I come."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 552",
    "verses": [
      "When we seek God’s Kingdom and blessings, And we rejoice in righteousness. We have the favor of the Lord God, And have His presence in our life. All those that put not trust in Christ, Upon the sand they build their lives.",
      "What hope is there in this life for us? What groaning we have here in life? We suffer pain and so much trouble, Each day we see much suffering here. The cross we bear may heavy be, We bear it with great sorrow here. ",
      "Cast all your burdens unto Jesus, Rejoice in Him alone always. See how much love Jesus has shown you, He will bear all your burdens now. The God to whom we now belong, Knows all our troubles, knows our pain. ",
      "God comes to us with special blessings, He comes to soothe our sufferings here. When we are faithful and good servants, And we are not scornful in life. Jesus will soon refresh us here, He’ll comfort us and bless us all. ",
      "When you are in distress with troubles, The Lord has not forsaken you. Think not that those who are in Jesus, Have no troubles in this life here. In God's own time we'll know the truth, Know that God blesses through the pain. ",
      "The ways of God no man can fathom, The Lord alone acts by His will. He may turn riches into nothing, The poor in life, He may lift high, Wonderful, just, the ways of God, He raises men and brings them low. ",
      "Praise God and pray, fulfill your mission, And humbly walk before the Lord. Seek from Him blessings for your welfare, Fresh blessings seek each day to grow. For those that wait upon the Lord, The Lord shall not forsake them here. ",
      "I come seeking refuge in Jesus, I seek to hide in You my Lord. Forsake me not, do not reject me, You know all things and see all things. Lord save me now and keep me safe, In Jesus I am always safe. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 553",
    "verses": [
      "My strength renew, O Lord my God, In all my life on earth. Grant that with all my strength serve You, Love You with all my life. ",
      "Lord Jesus, help Thy servants now, Behold Thee as Thou art. Delight in service here on earth, Most glorious be in Heav’n. ",
      "The sufferings of this present time, And sin shall be no more. We’ll join the host of Saints above, Sing Hallelujah, there. ",
      "The life in Heaven shall be great, Eyes have not seen such life. But we believe what Jesus said, His glory we shall share."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 554",
    "verses": [
      "As the Ark did travel, In the raging storms, Tossed about but steady, On the storms it rode. So my faith must travel, In the storms of life, Safe in Jesus now, God is with me always. ",
      "So did Moses travel, Through the parted sea, With him all of Israel, Dry land walked through sea. Boldly I must pass through, In this wilderness, Jesus is my life, God is with me always. ",
      "Jonah spent three dark nights, In belly of whale, Rescued by His Maker, Miracle was this. When great storms come o’er me, When I’m frightened much, To my Lord I’ll turn, God is with me always. ",
      "Daniel cast to lions, In the den was he, Angels rescued Daniel, Lions mouths they shut. In death’s dark great valley, Where I’ll soon shall be, In my Lord I trust, God is with me always. ",
      "Friends of Daniel also, Cast into the fire, Praising God Jehovah, Fire did not hurt them. Fire, storms and perils, None can shake my faith, Jesus I shall praise, God is with me always. ",
      "Empty grave of Jesus, And the wooden Cross, See my Savior Jesus, Victory He won. Death is conquered ever,  We have freedom now, Salvation is mine, God is with me always. ",
      "Peter fastened, fettered, In the stocks with chains, Paul was stoned and suffered, God was with them all. When I suffer hate here, When I bear all shame, I shall praise my Lord, God is with me always. ",
      "I shall praise my Savior, Hallelujah sing! Satan’s wrath and fury, None can frighten me. Let him send fierce arrows, None can harm me now; Safe in Christ I am, God is with me always. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 555",
    "verses": [
      "The Lord God is my Shepherd, In Him I nothing lack. He feeds me, and He helps me, He guides me through this life. My soul He saved, from sin and hell, He leads me on the Way to Heav’n. ",
      "He sets His eyes upon me, When in death’s vale I walk. Then shall I fear no evil, For God is with me still. Your rod and staff they comfort me, You’ll give your servant joy always. ",
      "Jehovah spreads a banquet, A table He has set. Before my foes, He’ll bless me, Great honor He shall give. Goodness and mercy shall be mine, Eternal joy I’ll have in Him. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 556",
    "verses": [
      "The Father sees, so rest in Him, He hears you, trust Him still. The Father comes, go welcome Him, He calls you, come to Him. ",
      "The Father is not flesh and blood, But He is always near. Believe in Him and on His Word, His presence is with you. ",
      "Hold fast to Him believe in Him, With faith that sees His face. He’ll never leave you nor forsake; Walk with Him righteously. ",
      "In trouble cast your cares on Him, Call Him as children true. In Jesus Christ, we pray to You, Dear Father, hear us pray. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 557",
    "verses": [
      "Jesus, Lover of my soul, Let me to Thy bosom fly; While the nearer waters roll, While the tempest still is high; Hide me, O my Savior, hide, Till the storm of life is past, Safe into the haven guide, O, receive my soul at last! ",
      "Other refuge have I none; Hangs my helpless soul on Thee; Leave, ah! Leave me not alone; Still support and comfort me. All my trust on Thee is stayed; All my help from Thee I bring; Cover my defenseless head, With the shadow of Thy wing, ",
      "Thou, O Christ, art all I want, More than all in Thee I find; Raise the fallen, cheer the faint;, Heal the sick, and lead the blind. Just and holy is Thy Name, I am all unrighteousness; False and full of sin I am, Thou art full of truth and grace. ",
      "Plenteous grace with Thee is found, Grace to cover all my sin; Let the healing streams abound; Make and keep me pure within. Thou of life the Fountain art, Freely let me take of Thee; Spring Thou up within my heart, Rise to all eternity! "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 558",
    "verses": [
      "Jesus Christ, is now and ever, For eternity, the same; He is Priest and ever shall be, To the Father He brought us. Jesus is my joy and gladness, Faith’s foundation is in Jesus, Sun of Righteousness is Jesus, Now forever more He’s Lord. ",
      "When in sin, I groped in darkness, Lost and dead and hopeless one, Jesus came to me such sinner, And He saved my life from hell.  Wondrous grace I have in Jesus, Grace that made me now His own, Patiently, He bore my sufferings, With great patience He guides me. ",
      "Now I follow Christ my Savior, Bearing shame and scorn in life. I must follow Christ more closely, I must seek to please Him now. Now I bear the cross of suffering, Follow Jesus Christ my Lord, For I know that what He’s promised, He will keep, and He will do. ",
      "When the time of death is nearing, When the grave is closely by, Let me hear You say to me Lord, “Today you will be with me”. Grant me Jesus, all Your blessings, In the precious Blood You shed, That I might receive Your fullness, To be like You Lord, I pray. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 559",
    "verses": [
      "In You, O Lord, I take a refuge, Let me never be put to shame. Your righteousness is my salvation, Rescue me Lord, deliver me. Give ear to me and save Thy servant, You are my Rock and fortress still, My refuge and my safest haven, Jehovah is my only hope. ",
      "My sure foundation is Jehovah, A steadfast Rock is God the Lord. Deliver me O Lord my Savior, Save me from evil, wicked ones. From cruel men and all pretenders, From wicked ones who seek my life. My hope and confidence, You are Lord, The Sovereign Lord, my Savior is. ",
      "My trust is in You Lord, my maker, From youthful days, I’ve trusted You. From birth till now You are Protector, I have relied on You my Lord. When in my mother’s womb as baby, You watched and brought me safely out. I’ll sing and praise You Lord Jehovah, I’ll praise You Lord for evermore. ",
      "You’ve showed the world how much You’ve blessed me, This has brought hate from wicked men. But Lord I know You are my refuge, My mouth is filled with praise for You. I shall declare Your splendor always, I’ll worship You with all my life. Lord when my years are full and over, Forsake me not, nor cast me out. ",
      "When all my energies are spent here, When frail and weak, no strength I have. When enemies shall speak against me, And say “God has forsaken him”. When they pursue and seek to seize me, When there is none to save me, Lord. Be not far from me, come to help me, Come quickly then to help me God. ",
      "My honor Lord you have increased now, Once more I have Your comfort Lord. I’ll praise You Lord with harp and trumpets, My lips shall shout for joy in You. My tongue shall tell Your righteous judgments, Thy faithfulness, I shall declare. For those that sought my life to harm me, Are shamed, confused, for God has blessed. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 560",
    "verses": [
      "The Lord’s my Shepherd, I’ll not want, He makes me down to lie. In pastures green; He leadeth me, The quiet waters by. ",
      "My soul He doth restore again, And me to walk dost make, Within the paths, of righteousness, E’en for His own Name’s sake! ",
      "Yea, though I walk in death’s dark vale, Yet will I fear no ill. For Thou art with me, and Thy rod, And staff me comfort still. ",
      "My table Thou hast furnished, In presence of my foes; My head Thou dost with oil anoint, And my cup overflows. ",
      "Goodness and mercy all my life, Shall surely follow me, And in God’s House for evermore, My dwelling-place shall be. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 561",
    "verses": [
      "God is working, trust Him, I shall trust Him always, Trust Him with all things. By His will, He formed me, Knew me before all time, My birth too He knew. By His sovereign will He plans, Gives me all I need to serve Him, Gives me all I need here. ",
      "God is working, trust Him, Joy I have in Him now, I have peace in Him. He will not forsake me, Food and clothes and all else, He provides for me. When the cross is heavy still, When I cannot bear the sufferings, He sustains and saves me. ",
      "He is there to help me. God is working, trust Him, Trust Him in the storms. Tempests, earthquakes may come. When the angry waves roar, When strong winds frighten, Jonah suffered three full days, When you are in such distress here, God upholds you always. ",
      "4. God is working, trust Him, He knows all your sufferings, He knows all your pains. Fear not in the battle, Yield not to temptations, For the Lord is near. If the Lord is with you, As your refuge and your succor, Then all fear shall vanish. ",
      "God is working, trust Him, When I’m weak and weary, Then I’m strong in Him. Put your trust in Jesus, Those that trust in Jesus, He’ll not disappoint. All shall pass, with all sufferings, But God’s Word remains forever, He will bless you ever. ",
      "God is working, trust Him, In the face of death, trust, Trust Him, don’t despair. When this life is over, When the grave your resting place, He will be with you. He will lift you from the grave, He will bring you Home to Heaven, And will grant you new life. ",
      "God is working, trust Him, Satan’s work of evil, Christ has now destroyed. All God’s blessed children, Walk the narrow, hard way, Wondrous grace they have. Trust Him now with everything, Trust Him when in joy or sorrow, God is working, trust Him. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 562",
    "verses": [
      "Commit your life and mission, Into the hands of God; Your heart and mind surrender, Give all to God in Heav’n. He who controls the weather, Who winds and seas obey, Will guide your steps and keep you, And help you follow Him. ",
      "Trust in the Lord your Savior, In this you will succeed. His mission must concern you, He will reward you much. Do not complain in service, Worried with anxious care; The Lord is grieved by such life, Rely on Him in prayer. ",
      "In glorious wisdom, knowledge, The Lord God plans your life. What best for you, He gives you, This also you must choose. His plans, no man can hinder, He directs all our paths, Into His will for our lives, God’s will shall always stand. ",
      "The ways the Lord directs you, Are best, nothing you’ll lack. That way is full of blessings, His light shines on that way. No stumbling blocks you’ll find there. Nothing can change God’s plans, The Lord acts best in all things, Blessing His children here! ",
      "Satan shall try to hinder, The plans of God for you; But he shall never succeed, God shall put him to shame. What God ordains for you here, Shall come to pass for you; All shall be done as God planned, God’s will shall be fulfilled. ",
      "Fear not, fresh courage take now, Be not anxious again. Rely on God your Savior, Trust Him and look to Him. He’ll come to you, surprise you, In His own time He’ll act. He’ll glorify and honor, He’ll shine His light on you ",
      "Cast fears and doubts away now, Cast them into the sea. Fear not the troubles in life, And all that worries you. You do not control this world, You cannot make things right. God has full control of life, He’ll direct perfectly. ",
      "Leave all in God’s Hands always, King of Wisdom is He. And if you do not doubt Him, Wonderfully He’ll act. All shall end well in beauty, Problems shall be blessings. His purposes, wonderful, All shall ripen with time. ",
      "Stand firm and waver not here, Stand in God’s Word alone. The Lord shall soon come visit, At time you’ll not expect. He’ll lift the burden from you, He’ll take it all away, Much joy shall fill your heart soon, For same burdens you bore. ",
      "Therefore I leave all to You, Do as You please my God. Complete the sufferings assigned, Comfort us in them all. To You we surrender all, Our lives and all we yield, The way, Lord You have chosen, Shall lead to Home above."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 563",
    "verses": [
      "God will order, your life such that, All shall work out for your good. Stormy winds you may encounter, Put your trust in Christ alone. ",
      "When so tempted, doubting God’s help, Filled with thoughts that all is lost; You will suffer needless sorrow, Those that doubt suffer in vain. ",
      "Doubting brethren, God your Savior, Never slumbers, neither sleeps. Lift your head to see the heavens, Faith must rest in this alone. ",
      "God shall send help now or later, At His own appointed time. Be not anxious, weighed with sorrow, God your Savior cares for you. ",
      "Trust Him always, for He’ll give you, What is best He has for you. In great patience, you’ll discover Riches kept for you alone. ",
      "When you doubt Him, and you fear much, Wait for God, wait patiently. He sees present and knows future, Leave to Him the plan of life. ",
      "God is present, acting always, Omnipotent God is He. What seems so hard, what none can do, Sovereign Lord can do all things. ",
      "Wondrous things that God has done here, All confirm His promises; All shall work out perfectly then, Just as planned by God the Lord. ",
      "At the right time, He appointed, God Himself shall intervene; Then you shall be filled with much shame, Shame for doubts and worries had. ",
      "Patiently then, wait for God’s time, Trust in Him, always rejoice. If you grumble and you murmur, Great sin you’ll commit in life. ",
      "If you wait upon Christ Jesus, Take His yoke and follow Him. Crown of life Jesus shall give you, He shall bless before His Throne. ",
      "Amen, Amen, Christ, best Treasure, Treasure that will never fade, Kept for you alone in Heaven, Christ the Treasure, best for you. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 564",
    "verses": [
      "My soul rise up, Jesus to see, Comfort you have in Him. The troubles you will suffer here, Draw you to Him alone. There is no succor here, No peace or joy you’ll find, Christ Jesus is your precious friend, Stay by His side always. ",
      "In Christ you have great victory, Trust Him and hung on Him. Cast all your cares on Jesus now, He’ll take care of your needs. His righteousness prevails, Your enemies shall fail, Let nothing frighten, bother you, Be still and wait on God. ",
      "When tempted, turn to prayer alone, Turn to the Lord alone. He has inclined His ear to hear, The Lord shall fight to save. When others hate you much, Your Savior is with you. He’ll come to help His chosen ones, Stick to the Lord your God. ",
      "Lift up your head your Savior see, Rely not on this world. With faith in Him must persevere, And follow Christ your King. Give all your life to Him, On Him depend always, For He has suffered on the Cross, Now gives you life indeed. ",
      "Rise up look to the things above, Your heart must be in that. Your Savior has your treasure there, Nothing shall fade in Heav’n. Vain treasures of this life, All pleasures here on earth, Eternal joy and lasting peace In Christ alone is found."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 565",
    "verses": [
      "Who have I, but You Lord? Christ my Lord alone. Nothing here on earth is pleasing, All the longings of my soul, Christ’s dear sweetest true love, Needs my soul and all my life here, always. ",
      "Jesus Christ my true friend, To You I’ll repair. With resolve to follow closely, You my Lord, my God, my all. If men shall forsake You, I shall seek You now and always truly. ",
      "If I have my Jesus, I’ll forsake the world. For in Him I have all treasures, Peace and health and joy He gives; If I seek Him always, Fearless I shall go through death’s dark valleys. ",
      "If Christ Jesus is mine, Heaven shall be mine. He’ll refresh my soul and spirit, Body, mind and all my being, I shall praise Him always, Glorify and laud Him for His favors. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 566",
    "verses": [
      "My God and Lord and savior, I shall not fear the foe. He hears my pleadings, prayer, And gives me joy in life. We are His sheep, we hear Him, We listen to His Word. Our foes He will destroy now, And save us from all harm. ",
      "I know in truth that Jesus, Loves me and cares for me. This gives me joy and comfort, That God Himself loves me. He is beside me always, He’ll drive away my foes. God is with me forever, Therefore I’ll live in peace. ",
      "I’ll praise my Savior Jesus, I’ll seek His honor now. If Jesus is not friendly, And He is not in me. I cannot stand before God, I cannot face the Judge. Eternal hell I’ll suffer, Condemned I shall be then. ",
      "My sin Jesus has borne them, Wages for sin He paid. He bled to take away sin, Holy Blood Jesus shed. This Blood has cleansed my soul now, And sets me free from sin. In this I now have great peace, Eternal joy I have. ",
      "Jesus my great comforter, Who helps my pain to bear.  In Him all troubles of life, Could not cause fear in me. The Spirit bears the witness, My heart knows all is well. The suffering and all pain here, Shall be a blessing soon. ",
      "Destroy this world and all things, Jesus shall always be. His power is everlasting, His love will never end. No enemy can separate, Nor break the bond with Christ. I shall be close to Jesus, His love will never fade. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 567",
    "verses": [
      "Spirit of God, Your help we seek, Jehovah Lord, to You we cry. In You are wisdom, might and strength, None can compare with You, O Lord. ",
      "Spirit of God, Your help we seek, Deliverer, God; come now to save. Your promises are ever sure, You Lord we trust, and only You. ",
      "Spirit of God, your help we seek, The God of Truth, the only way. Our Friend and Priest, the Advocate, You’ll plead our case before the Throne. ",
      "Spirit of God, Your help we seek, Eternal God, the Only Lord, You neither sleep nor slumber, Lord, Working to bless, and keep all safe. ",
      "So send Thy gracious help to all, According to Your sovereign will, And help me too, dear Lord I pray, Help me fulfill, Thy gracious will. ",
      "Lord You desire, You seek to bless, Fulfill Thy promise in Your Word. Eternal thanks I’ll offer You, Come Jesus, come, Your own to save. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 568",
    "verses": [
      "Come Holy Spirit, come to help, Thy gracious mercy, Lord I seek. I am Your own, by grace through faith, You have saved me from evil. ",
      "In You I trust my gracious Lord, I have You, nothing do I lack. You are my Lord, dear Jesus Christ, You are my Savior and my God. ",
      "In this I have such peace of life, On You, O Lord, I wait in life. Great confidence I have in You, Amen, I say, so let it be."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 569",
    "verses": [
      "If God the Lord is with me, No foe can stand my way. When I on Him depending, All foes shall flee away. With Christ as Head in battle, The Friend who loves me well! Assailed by evil forces, Victorious, I shall be. ",
      "I do believe, and know now, And boast with confidence, That God, the Lord in Heaven, His servant He’ll honor. In all my life on this earth, In all things God is near, All storms of life and dangers, He’ll calm and make them still. ",
      "Jesus my sure foundation, Whose precious Blood alone, Has power to overcome foes, To save me and protect! My strength and flesh and power, Shall fail to stand the foe, The power of Jesus only, I need to stand secure. ",
      "Jesus my strength my honor, The glory of my life, My life is vain without you, Worthless and poor I am. In sin I cannot see God, And see His glorious Throne, Be gracious Lord, have mercy, Grant me, Your Glory, see. ",
      "Jesus has won the victory, Has conquered death for us, His stripes and wounds are blessings, In them we all are healed. In Jesus I have great joy, And confidence so great, The judgment I shall fear not, For Christ the Judge is mine. ",
      "My treasures and all blessings, Are stored in Heav’n above, When earthly life in death ends, I shall have life in Heav’n. This life of tears and sorrows, With toil, tribulations, Shall end when Christ my Savior, With joy I’ll shout, Abba! ",
      "These treasures now are hidden, They soon shall be all mine; I’ll have no fears or worries, For Jesus keeps them all. The One who keeps my life here, Has my soul and spirit, The One whose Life I have now, He I must trust and keep. ",
      "No foe can rent asunder, This bond I have in Christ, No angels, powers, depth nor height, This bond can server now. No creatures in the heavens, No creatures on this earth, None can destroy this union, I have with Christ my Lord. ",
      "When I shall see my Savior, On that great Day in Heav’n, My heart in all its fullness, Shall praise and worship Him. And glorify the Father, With Christ the Lord Savior, Praise, glorify and worship, Father, Son, Holy Ghost."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 570",
    "verses": [
      "Jesus is mine, and I’m His, I’ll serve the Lord alone. He leads me by the waters, He’ll guide me through this life. His blessed sheep He seeks, He neither sleeps nor slumbers, He watches o’er all His sheep, He sees and helps His own. ",
      "The glory of this life fades, I shall not seek this life. The Lord has come with power, Salvation brings to us. He saves us from this world, From glory vain, sinful life, From bondage, pain and evil, From death eternal saves. ",
      "All good things we now have here, The best God gave for us. He loved this world, though sinful, He gave His Only Son. What then shall God withhold? From those He gave His own Son? He’ll give us all things through Him, He’ll give His all for us. ",
      "Our very souls saved in Him, Secure our faith in Christ. New bodies too we all have, Imperishable be. Glorious is His nature, In Heav’n this body shall be, A body filled with God’s life, We shall be like the Lord. ",
      "Come pain, come suffering, evil, I know, I have a Home. I’ll bear all suffering and hate, This world is full of sin. But soon shall come new life, A life eternal of joy, The life of Christ shall be mine, He’ll grant me come to Him. ",
      "This pleases God the Father, For He created all. His only Son has saved us, He sits at God’s right Hand. And God the Holy Ghost, The gift of faith He gives us, That we may share God’s Kingdom, Praise Triune God, give praise. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 571",
    "verses": [
      "One thing needful, we are lacking, Teach us Lord to know that well. Great yoke we all bear in this life, Burdens great we cannot bear. ",
      "Anxious we are troubled, With so much work in vain, No true rest we have with burdens we all bear here. But when we cast burdens, Cast them on Jesus, He gives us so much joy, He gives us His rest! ",
      "My soul if you seek this rest here, Seek it not in things you see. Cast the world and all its pleasures, Put all vain treasures aside. ",
      "Seek things that are above, things that are in Jesus, The One in whom we have the priceless treasures now. We shall find all we seek, Jesus Christ, Savior, Our treasure in Heaven, Is Jesus the Lord! ",
      "See how Mary was with Jesus, See how much she sought the best. At His feet she laid to listen, Listen for the precious Word. She came seeking Jesus and ",
      "sought for the real Food, See how much she hanged on Word from the Lord Jesus. Jesus Christ her Savior, on Him she relied. We also must give to, Him all we have here. ",
      "Lord I dearly yearn for You here, For You Lord my heart desires. Let me hold You closely, dear Lord, Give your whole Life to me Lord. If others shall leave Christ and follow not the Lord. ",
      "Grant me to seek You, O my Lord Jesus Christ here. Jesus your Word precious, Word of life for soul; To whom shall we go, then beside You, O Lord? ",
      "Wisdom of life is in You Lord, You are Lord of Wisdom, Christ. All desires and treasures I have, All are in Your Name O Lord. ",
      "Holy life with meekness, I shall live for Jesus. Christ Jesus my Lord shall grant me heavn’ly wisdom, If I know Jesus well, know Him as I ought. Great wisdom shall have and no wisdom compares. ",
      "Nothing I have to show in life, I have nothing than the Lord. I have right in You, my Jesus, Right in holy Blood You shed. Righteousness God desires and this You have given. ",
      "By death on the Cross, Lord You have saved my life now. Salvation clothes I have, this I shall put on, I am all so clean, by faith in my dear Lord! ",
      "Wake up then my soul from slumber, Wake up to the Lord your God. You O Lord my soul desires now, Righteousness I have from you. A life that pleases God, a life of righteousness, This is life I have, Lord you have ",
      "saved and loved me. Draw me from world’s pleasures, from all vain things here, Your life, O my Lord Jesus, be in me now. ",
      "What else I desire in this life, I am satisfied by grace. Holy of the holies entered, Through the Blood You shed for me. Eternal salvation, we have by this action. ",
      "By this You have saved, you delivered from Satan; By this You have blessed me, with faith in You Lord; Your Spirit helps me to shout, “Abba”, Father. ",
      "Jesus Christ be mine forever, Be my all in all in life. Search me Lord and know all my thoughts, Cleanse me from all evil thoughts. Save me from evil paths, keep ",
      "me aright Lord Jesus, And lead me in paths, O Lord that is all righteous. Help me regard things here, as refuse only. And claim You O Lord, for You only I need. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 572",
    "verses": [
      "Let me seek the best of pleasures, Peace within my soul. There is none on earth I treasure, Treasures have in Heav’n. Everlasting joy is there, Everlasting life I have. Blessed place my Home in Heaven, There I seek to be. ",
      "Jesus calls us, seeking for us, Come to Jesus now. Hear His Word, believe in Jesus, Do not tarry long. Seek the Lord while He is near, Do not doubt but now believe. Persevere in faith in Jesus, Forward you must go. ",
      "Jesus, help me seek the blessings, Glorious things I’ll seek. When distressed and much discouraged, Jesus, strengthen me. When I suffer pain and all, Persecutions, hate, with strife. Grant me wisdom, vindicate me, I am Yours, dear Lord. ",
      "Jesus, help me, draw me closer, Save my soul from wrong. I am weak and frail flesh only, You Lord are my strength. I am justified in Thee, Through the Blood You shed for me. Grant me strength, Thou gracious Spirit: Worship God always. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 573",
    "verses": [
      "When God seeks you, in His kindness, Seeking blessings for your life, Yield your spirit in obedience, Submit to His gracious will. ",
      "Enter by the narrow gate now, Walk the narrow way to life. Shun all lust and sinful pleasures, Look above to things on High. ",
      "Cast your burdens upon Jesus, Always seek His face in prayer. Plead forgiveness for trespasses, Plead with Him all day and night. ",
      "Grow in love for all your neighbors, Let your love grow deep and strong. Love as Jesus Christ has loved you, Be like Jesus Christ in love. ",
      "Grow in Christ, as new born baby, There is much to learn of Christ. Hard the way that leads to glory, You must learn the cross to bear. ",
      "Firmly cling to Christ the Savior, Watch and pray at all times here, Evil men are seeking always, Planning faithful saints to hurt. ",
      "Keep this gift for Jesus safely, Let it not depart from you. Faithful servant of Christ Jesus, Always seek to please the Lord. ",
      "Forward ever, backward never, Be resolved to follow Christ. Flee from Satan’s wiles and cunning, Let not lust destroy the flesh. ",
      "Flesh is strong and always tempting, Yield not to its lustful crave. When you yield to flesh’s temptations, Mind and soul shall soon pollute. ",
      "Shun the pleasures of this vain life, Shun all pride and boastful life. Do the right and seek to please God, Be not lazy, work so hard. ",
      "Sinful, lustful pleasures men seek, These shall hurt their soul at last. Turn from these you faithful servant, Run away from all such life. ",
      "Fear the Lord be always watchful, Follow Jesus Christ alone. Then at last He’ll grant you harbor, Be with Him in Heav’n above. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 574",
    "verses": [
      "To those that hate the life of sin, Faithful they are in Christ. In bondage once to sin and death, Now free in Christ the Lord. ",
      "Thick darkness covers life of sin, They are so blind in sin. Christ is the only way to life, He is the Light we need. ",
      "The life of sin is full of greed, With envy, malice, hate! Men love such life for they are blind, But Jesus gives true life. ",
      "The wages of the life of sin, Eternal death in hell! Salvation is in Christ alone, His life He gives to us. ",
      "I love You Lord, so dearly love, I love You, Savior, Lord. There is no one I love but You, I am baptized in You. ",
      "Lord those You save are free indeed, Their sin, You have forgiv’n. We magnify and praise Your Name, We glorify You Lord. ",
      "I’ll worship You, O Lord my God, Christ Jesus, You are mine. I shall be with You where You are, You’ll comfort me, Your child. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 575",
    "verses": [
      "O my soul why low cast down, Anxious, worried much in this world. Fleeting is this life you see, All shall pass and soon be nothing. Seek your Savior, O my soul, None can save but Jesus Christ. ",
      "Spend time, meditate on life, Leave vain wealth, and look to Jesus, Seek the Lord Jehovah now, Seek abundant grace and mercy. Gracious, merciful the Lord, None can save but Jesus Christ. ",
      "You belong to God, my soul, Flesh belongs to earth is nothing. When you were so marred in sin, None could save you, but Christ Jesus. Therefore keep to Christ alone, None can save but Jesus Christ. ",
      "No peace in this world can find, No peace such as Jesus gives you. Peace that none can understand, Peace secured in Christ the Savior. Therefore stick to Christ alone, None can save but Jesus Christ. ",
      "See the glory of the Lord, See how much the Savior loves you. Let your mind dwell on this love, Precious blessings have in Jesus. Jesus waits to bless you more, None can save but Jesus Christ. ",
      "Let your mind dwell on the Lord, Let His Word dwell in you richly. Example of suffering find, Strength you’ll gain from His example. He will grant you grace to stand, None can save but Jesus Christ. ",
      "Follow only Jesus Christ, Never ceasing, seek Him always. Commit all your life to Him, Let your life be offering pleasing. Jesus Christ, your priceless wealth, None can save but Jesus Christ. ",
      "If you follow Jesus Christ, He will lead you Home to Heaven. There you’ll have eternal rest, Rest with God the Father always. Seek the Savior, O my soul, None can save but Jesus Christ. ",
      "Shun the pleasures of this vain life, Shun all pride and boastful life. Do the right and seek to please God, Be not lazy, work so hard. ",
      "Sinful, lustful pleasures men seek, These shall hurt their soul at last. Turn from these you faithful servant, Run away from all such life. ",
      "Fear the Lord be always watchful, Follow Jesus Christ alone. Then at last He’ll grant you harbor, Be with Him in Heav’n above. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 576",
    "verses": [
      "My life and light come from Christ Jesus, The Son of God, my Savior, King. I trust my life to You Lord Jesus, My soul and body give to You. The past life is behind me ever, ",
      "Guide me and lead me now and ever, Protect me Lord, provide for me. Bear with me gently as I follow, Be with me Lord now and forever, I cannot walk this life alone. ",
      "I shall not stray from You, dear Jesus, Your Word confirms Your promises. Assured Thy presence shall go with me, Your presence, lead me to Your rest. This I desire and long from You Lord, ",
      "Mercy and grace I always need, Lord, Thy gracious presence is with me. A dear request I have of You Lord, Grant me to see Thy face, Jehovah, Your glorious face, grant me to see. ",
      "Show me Thy ways, that I may know Thee, Remove impediments from me. Help me to walk the paths of safety, Save me from harm and troubles here. Protect me from the wiles of Satan, ",
      "And save me from a mind that wavers, Help me, to always watch and pray. I plead with You, keep thou my spirit, Strengthen my soul to trust You always, Thy favor Lord, extend to me. ",
      "Lord, keep me with Thy chosen children, And make me good and faithful child. Show me, that I may know Your pleasure, Grant me to know, what You desire. Help me to keep away from vain life, ",
      "From lust of flesh, delights and pleasures, Lord, help me flee from what You hate. I seek to know Your great Name, dear Lord, Show me Your glory and your goodness, And worship You, O Lord, my God. ",
      "The Counselor, the Holy Spirit, Guide me in wisdom, help me pray. Thy Word, O Lord, dwell in me richly, Grant that Thy Word my life shall be. Walk humbly before You with fear now, ",
      "Live such as pleasing in Thy sight, Lord, Help me to be with You always. Direct my mind to think Your thoughts now, That I might look to Thee to please You, And bear much fruit, for You, O Lord. ",
      "In this my soul shall rest forever, I shall have peace and rest in You. My life is full of blessings rich now, Nothing I lack, no fear I have. My heart desire and only longing, ",
      "To be with Jesus Christ in Heaven, To be with You, dear Lord, always. Into Your Hands I yield my spirit, Lord Jesus, grant me life eternal, In You, O Lord, I’m satisfied. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 577",
    "verses": [
      "There is nothing here to gain, All is vanity. Therefore seek the things above, There great wealth is stored True life is there, Transient is the life on earth, True Home is in Heav’n above, Seek to be there ",
      "Jesus You are Way to Heav’n, You are Way to God. Soul seek not life’s vanities, Dwell not on the dross. Seek wealth in Heav’n, Wealth unfading, none can steal, Now resolve to seek such wealth; You shall be filled. ",
      "When distressed and sorrowful, Help seek from above. Loving Father knows your life, He will help you through. Fear not this life, There is joy in Heaven above, Where no darkness, evil dwell, There is your Home. ",
      "Savior Jesus is in Heav’n, Here He suffered too. Suffered much to enter Heav’n, Follow Christ your Lord. With patience wait, Wait for Jesus Christ your Lord, Wait for Him, His time is best, Victorious be. ",
      "Portal to the life in Heav’n, Death is such portal. “You have passed from death to life”, Jesus said to us. Be still in life, Be assured this life shall pass, Dawn of morning new shall come; You shall rejoice. ",
      "Be assured, great comfort take, You shall enter Heav’n. Savior Jesus waits for you, He will welcome you. Welcome you, Home, Warmly He’ll say to you, “Come” He will honor, bless you much, Forever bless. ",
      "In all sufferings here on earth, Give thanks to the Lord. Murmur not when troubles come, Do not be fretful. Praise Christ always, Praise Him lift His Name on high, Glorify Him in the Heav’ns, Hallelujah! "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 578",
    "verses": [
      "Sin is punished by the Father, Death is wages for all sin. But for death of Jesus Savior, Condemnation waits us all. ",
      "Jesus bore our sin and wages, Died the death we all deserve. By the Blood He shed for sinners, We are reconciled to God. ",
      "By the death He died for sinners, Right demands of God He met. God has shown how much He loves us, Jesus died for sinful men. ",
      "Wondrous work we see in Jesus, Freedom brought to sinners here. Bringing peace to men and women, Everlasting life He gave. ",
      "Much provision Christ has made now, More than we shall need in life. He has fully met God’s justice, He has swallowed death for us. ",
      "We were slaves to sin our master, We were under curse of death. Now we have a righteous Master; Lead us into life in God. ",
      "Life of sin we now detest much, We shall not reject God’s Word. Jesus is our Lord and Master, He will turn our hearts to God. ",
      "If we seek the Blood of Jesus, As our justification; Must we seek to live as sinners, As believers of the Lord? ",
      "We have died to sin in Jesus, Have been raised to life in Christ, We are saved by death of Jesus, We live, because Jesus lives. ",
      "Life I live now is not my life, It is life of Jesus Christ; I now live for Christ my Savior, I am born anew in Christ. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 579",
    "verses": [
      "Blessed the poor ones in the spirit, Theirs is the Kingdom of Heaven. Blessed are those that mourn in this life, They shall be comforted by God. Blessed are those that live in meekness, They shall be those that inherit earth. ",
      "Blessed are those that thirst and hunger, For righteousness, they shall be filled. Blessed are those that show much mercy, They shall receive God’s mercy too. Blessed the pure in heart before God, They are those that shall see God in Heav’n. ",
      "Peacemakers are blessed by the Father, They are the children of the Lord. The righteous that face persecution, God’s Kingdom now belongs to them. And they shall serve as priests in Heaven, They shall be glorified with Jesus. ",
      "Blessed you are when men revile you, And suffer as Christ’s servants here. When you are falsely charged with evil, When persecuted for the right. Rejoice, be glad, for this is blessing, Reward you’ll have is great in Heaven. ",
      "Lord Jesus grant that I might seek You, You are my God and King and all. You are the Way, You are my treasure, In You I have all righteousness. You are my Savior and my honor, All who have You, lack nothing in life."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 580",
    "verses": [
      "Stay my soul, with Jesus always, Keep to Him and watchful be. For the flesh is weak and lustful, Sin is always lurking round. ",
      "Firmly hold to Jesus always, Let Him not depart from you. Seek the path that leads to Heaven, Turn not from the path of life. ",
      "Faithful be to death, dear brethren, Watchful be in all your life. Strengthen weak hands, do not waver, Steady knees, to stand secure. ",
      "Do not yield to sin dear brethren, Sin disturbs your faith and joy. Cast away all sinful pleasures, Run the race as child of God. ",
      "Seek God’s grace for every weakness, Seek to overcome the flesh. Fight the war against the flesh now, Fight this war till life shall end. ",
      "Courage, take now in your struggles, Like a soldier of the Lord. Faithful always be in service In the Kingdom’s work assigned. ",
      "When Christ Jesus comes in glory, You must not meet Him with shame. But be ready for rich blessings; Great reward awaits you then. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 581",
    "verses": [
      "Always seek to do the good, Weary be not in this great task. When we love all to the end, Peaceful rest we shall then all have. More than this we shall receive, We shall reap the harvest then. ",
      "Carefully sow in the field, Learn to sow spiritual seeds now. When you sow to please the flesh, You shall reap corruption from it. When you sow right seeds in life, Life eternal you shall reap. ",
      "Seed we sow, may be so small, But that seed shall flourish so soon. All we do shall have reward, Great reward we shall all receive. All we do here on this earth, All shall have the wages due. ",
      "Jesus, help me good to do, And be faithful in this life here. Every day that you assign, Blessings never cease in this life. Seek the good to do always, Pleasure in flesh must not seek. Psalm ",
      "In great hope I do the right, Harvest soon shall come with much joy. What I do is much too small, But great shall be my reward soon. Bountiful your grace shall be, Least, deserve such great reward."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 582",
    "verses": [
      "Blessed is he that walks not in, The counsel of the wicked ones, Nor stands in way of sinners still, That seats not with the scoffers here. ",
      "But his delight is in the Law, The Law of God is his delight. And on His Word, he meditates, He meditates by day and night. ",
      "His life is like a planted tree, A tree by streams of water found. He yields good fruits like such a tree, He bears much fruit in all seasons. ",
      "Green always then his leaves shall be, In all he does, he prospers here He prospers everywhere he goes, Blessed is he by God indeed. ",
      "The wicked have a dreadful life, They are like chaff, driven by wind. Like chaff, the wind drives such away, The wicked perish and are gone. ",
      "Therefore the wicked will not stand, The judgment of the Lord our God, Nor sinners found among the saints, They shall not dwell with righteous ones. ",
      "The Lord knows all His righteous ones, The way of righteous ones He knows. The way of wicked ones perish, Their wicked ways, God shall destroy. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 583",
    "verses": [
      "A refuge safe is not the flesh, Trust in Jehovah, Lord and God. Sure foundation we have in God, No other refuge we can find. ",
      "Be careful, seek to live aright, More precious is your name than gold. Treasure, respect you have in life, Seek honor in your name always. ",
      "Careful be always and be still, Carefully listen for your God. Be careful with the tongue you have, In wisdom utter little here. ",
      "Do what is right, show much respect, Seek meekness and humility. The good you seek to have from men, Seek first to do for others here. ",
      "Eschew all evil, seek the right, Pride forsake, and all arrogance. God’s blessing and His gifts to you, Use faithfully, account you’ll give. ",
      "For righteousness, strive for in life, Seek righteousness and please the Lord. You may lose all things here on earth, God’s righteousness is best to have. ",
      "Give freely, show love to all men, Be generous, seek the poor to help. Be not a ‘rich fool’ here on earth, Like they that Christ referred us to. ",
      "Hold dear the favors in your life, Forget not blessings from the Lord. Give freely to those who have need, Each others burdens bear always. ",
      "In all things look to Jesus Christ, From childhood follow Christ the Lord. The Father, Jesus sought to please, You also seek to please the Lord. ",
      "1Justice must seek in all you do, Gift of discernment seek to have. Wisdom to judge all things aright, Be careful, there is much deceit. ",
      "Know your life truly, pray for grace, Seek grace to do right in all things. Hate, envy, suffering in this life, God knows all and will judge aright. ",
      "Leave anger, vengeance, rage and wrath, Slow to be angry, slow to speak. Anger works not God’s righteousness, Leave all to God, for vengeance, His. ",
      "Much time must spend to learn of God, On God’s Word meditate all night. Knowledge and wisdom you shall gain, Life precious you shall have in God. ",
      "Not with the wisdom of man judge, God’s wisdom is so rich and full. This you shall need to judge all things, In all disputes, judge righteously. ",
      "Observe the way of Christ your Lord; Arrogant life and pride seek not. Foolish pride shall bring you to ruin, Pride is the ruin of many men, ",
      "Pain from all suffering bear gently, Trust in the Lord when cross you bear. Multitude be the foes you have, Remember God is on your side. ",
      "Quit not when you are much distressed, Thinking God has forsaken you. Be still and know that He is God, God’s recompense you shall soon have. ",
      "Ruth loved the God of Israel, In Jacob’s God she trusted much. Like her, have faith in God the Lord, You shall be blessed eternally. ",
      "Search heart and soul and mind and all, In sin we live and have our being. This world is full of sin and death, Disgrace and shame we suffer here. ",
      "Teach us to seek Your righteousness, Seek not the praise of men on earth. The Lord Himself shall praise at last, The praise of men is empty praise. ",
      "Unite with Saints to seek the Lord, Seek things above, eternal things. The wise store treasures in the Lord, In Whom such treasures are all safe. ",
      "Vain life is life we live on earth, Great possessions had Abraham. But his faith was in God, the Lord, God counted this as righteousness. ",
      "We must refrain from worldly life, Partake not in the works of flesh. Blessed are those that live in peace, Blessed they are that bear much fruit. ",
      "Xylophones, trumpets, cymbals, drums, Employ to worship God the Lord. Praise, honor, laud and magnify, And glorify God with your life. ",
      "You Saints of God, seek grace to live, Seek grace to walk as pilgrims here. God shall reward for fruit you bear, We shall each reap what we have sown. ",
      "Zion, the City of our God: Pray that you shall be there with God. If you shall be with God in Heav’n, Joy everlasting shall be yours "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 584",
    "verses": [
      "Create in me a clean heart, Lord, My heart is sinful, rotten. In sin my mother conceived me, And my transgressions, they grieve. I know my sin and trespasses, My heart is full of sin, O Lord, Restore to me a clean heart. ",
      "New spirit put within me, Lord, Put righteous spirit in me. Uphold me with such spirit, Lord, A willing spirit, give me. Blood guiltiness, deliver from, Deep faith in You, I now desire, Hope, Love and peace, I have, Lord. ",
      "Cast me not from Thy presence Lord, Though sinful being I am. Dear Father, turn Your eyes from me, Look to Your Son, Christ Jesus. He reconciled us to You, Lord, Deliver me from sin, O Lord, Blot out my sins completely. ",
      "Thy Holy Spirit grant to me, Uphold me with Your Spirit. Take fear away from me, dear Lord, Let death not frighten me now. Open my lips that I may sing, The praises of Your Name, O Lord, Eternal praises, I’ll give You. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 585",
    "verses": [
      "A stranger, pilgrim I am, Distressed, I am in life, Sojourner, I am on earth, I have a Home in Heav’n. ",
      "I long for Home with Jesus, Home do I seek all life. I long for this Home always, There I shall live in peace. ",
      "For there remains a Sabbath Rest for God’s chosen ones. A Sabbath Rest in Heaven; Seek to enter that Rest. ",
      "Guide me Home safely, Jesus, Bring me to the Father. Dwell with me Jesus always, Be with me, after death. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 586",
    "verses": [
      "Bring to Jesus all your troubles, Transient is the pain you bear. Be not troubled, be not anxious, What can separate you from Christ? Jesus is beside you still, And He seeks to help you through, Do not close your heart to Jesus, Do not grieve the Lord your God here. ",
      "Keep your faith in Jesus always, Cling to Jesus in all things. Let not doubts in life distract you, Trust in Jehovah your God. Great your blessings in the Lord, Blessings by baptism have. Give your life and all to Jesus, Let Him make you fit for service. ",
      "Hold fast to your love for Jesus, Love the Lord with all your heart. Love your neighbor as commanded, Love your neighbor as yourself. Love your neighbor what may be, Jesus loves you as you are. Forgive those that seek to hurt you, Then God shall forgive all your sin. ",
      "Run the race with perseverance, And fight the good fight always. Though you suffer much here on earth, Though the fire, be much to bear. All this pain cannot compare, With the blessings stored for you, Blessings Jesus Christ shall give you, Blessings everlasting you’ll have. ",
      "Come whatever be my lot here, By faith I shall stand for Christ. What my God has willed for me here, This I shall seek to fulfill. Christ the Lord shall be with me, I shall love Him, take my cross; If I am His now and ever, He shall be mine now and ever. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 587",
    "verses": [
      "Jesus our Great King, be with me, grant victory, Forces of darkness come seeking to harm. Agents of Satan come tempting to lure me, Seek to destroy, my soul with vain things here. Many the tricks of the devil against me, Deceitful wiles to attract me and destroy. ",
      "Jesus grant victory, You Lord art our Savior, Satan, the world and the flesh us pursue. He comes with hate and with anger against us, He comes with craft, in deceit, wiles and lies. Help me, O Lord, when he comes in his madness, Deliver me from his hands and save my soul. ",
      "Lord grant me victory, I need You to save me, My sinful life is before me always. The sinful life in the youthful days also, My life of sin, come confronting, accuse. Speak to assure me, my Savior, Lord Jesus, Humble me Lord and take pride away from me. ",
      "Jesus grant victory, come cover my sins now, Cover the sin of self-love, pride and hate. Cover my sin in my searching for power, Cover my lust of the flesh and vain things. I’ve suffered shame and disgrace in my sins, Lord, Jesus Your death has now blessed me with new life. ",
      "Jesus grant victory, my life now I give You, Take from me Lord, flesh of lust and vain life. Change this mind set on vain glory and pleasures, Grant me a mind, set on things high above. Change my life Jesus and make me be like You, Make body, soul and the spirit, just like Yours."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 588",
    "verses": [
      "Jesus you are with us always, Break all cords that bind our lives. In your shame and condescension, We have blessings from above. In your judgments we have freedom, From the mind of flesh and sin, You have freed us from all bondage, Life eternal granted us. ",
      "Lord consider all our sufferings, Great bondage we all are in. All creation groans in pain here, Freedom from the bondage seeks. We seek great redemption from You, Freedom, seek from futile life. Spirit of the Lord bears witness, As we groan and long for God ",
      "Help us in our weakness, dear Lord, Strengthen us and bear with us. Help us to set this flesh aside, Grant us freedom from the flesh. Save us from the fear of people, Save us from all doubts and fears. Set us free from shame and worries, Set us free from lustful flesh. ",
      "Break my mind, destroy its nature, Lord, destroy my evil mind. In our death we cannot praise You, Lord, have mercy on my soul. Save my sinful soul from death, Lord, Cast away all demons here. Grant me freedom, in You, Jesus, Wedding feast I shall partake. ",
      "Grant me victory in this life Lord, Christ You are my King and all. Fight the battle for Your servant, Set me free from sin as slave. By the Covenant in Your Blood, You have saved us from the pit, We shall fear no condemnation, You have loved us, we should know. ",
      "Jesus we now seek to love You, Die with You, bearing our cross. None can overcome Your children, Eden shall be Home for us. Soon we shall be with You, Jesus, Come Thou quickly, come dear Lord, We shall be like people dreaming, Freedom we shall have at last."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 589",
    "verses": [
      "True life of the Christian different, It’s a life that grows always. You must not think you are perfect, You must strive for perfection. Press towards the goal above, Always take a stock in life, Let the Scriptures guide you always, Guide you into great perfection. ",
      "Always pray and seek to worship, Seek to do good, generous be. Labor hard, serving the Master, Faithful be in all things here. Let God’s Truth guide you in life, Justice seek in all things here, In all things seek what is pleasing, Seeking to please Jesus always! ",
      "Life of God a precious life is, Life of Spirit, power that life. In the flesh you are so different, You have life opposed to God. You need new birth from above, New life you have from within. Child of God, you are a newborn, You are now part of God’s own life. ",
      "In this life you are so different, You love God and think His thoughts. You have new mind of Christ Jesus, You will love Him, bear His fruit. By faith you will live in Him, This is new life with your Lord, Changed from glory into glory, Righteousness, you must seek ever. ",
      "Help us Lord to please you always, Do the things that please you Lord. Strengthen faith help us to serve you, Faithful, good servants make us. Search us, prune us, Lord Jesus, Draw us to Thyself, O Lord. Help us see our nature sinful, That we may seek Your own nature! ",
      "Fill our hearts with power of God’s Word, Holy Spirit, fill our hearts. That we may see clearly always, What is right and what is wrong. Try us Lord that we may keep, Close to you and stray not, Lord. Grant at last to hear you calling, “Come, you blessed one of the Lord”."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 590",
    "verses": [
      "See how hard it is to follow the Lord, The Spirit gives life to us now by faith here. God’s Spirit gives us new life in this flesh, For we daily die for Jesus Christ our Lord, Each victory helps us other battles fight, The war is on. ",
      "When you shall trample serpents as Christ said, Their poison seeks to penetrate, it harms not; We must be watchful and be prayerful, That evil shall not poison us, destroy us. To seek to follow in the path of Christ, The cross, must bear. ",
      "Fight the good fight with the strength you have now, With perseverance as your Lord, a crown awaits. The things eternal the soul must seek now, Dwell on what you’ll receive from God, this shall last. Sorrow and pain shall face you in this life, Look to the Lord. ",
      "The Lord God sees all that happens in life, He shall supply abundantly, all you need. Rich treasures reserved in Heaven for you, In this life you have but a taste, what you’ll have. Nothing can take away reward for you. It is with God. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 591",
    "verses": [
      "With fear and trembling walk, Be watchful, Christian pilgrim. Watch carefully in prayer, Be careful, there is danger. With fear and trembling walk, As those who are in Christ, If righteous suffer thus, What shall the sinful face? ",
      "The devil prowls around, Steal and to kill, destroy us. His traps are many here, He sets them in the darkness. This world is mad in sin, Deceived and trapped, confused. The greatest foe we face, The flesh, our foe, so strong! ",
      "We are so full of sin, Such life we have no insight. Our thoughts are full of sin, Guilty we are, before God. The sin one man commits, Spreads fast, affecting more. The one who thinks he stands, Must careful be or fall. ",
      "The trespass of Adam, Caused ruin for all humankind. But Jesus Christ suffered, God’s wrath for sin committed. Forget not this great love, In Baptism received, Soon life shall end for you, Death shall come quickly soon. ",
      "God’s wrath is so fearful, Great flood He sent, men perished. He saved eight righteous ones, Noah He saved with these ones. In Sodom, Gomorrah, He saved Lot and his own, In Jericho city, Rahab, He saved by grace. ",
      "When I remember these, And ponder them in spirit. I tremble much within, Fearful become with much dread. I have faith in You, Lord, In You only I trust, I plead for mercy, Lord, Intercede for the world. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 592",
    "verses": [
      "Lord, my heart’s desire is, Heav’n to be with You. Where no evil can be, Where no pain shall be! O that you may also, Seek such place so glorious; Be with God in Heaven, Home, eternally. ",
      "Jesus Christ the Savior, Way to Heav’n our Home, Come to Jesus and find, Heaven place to go. Trust Him only always, Seek Him with your heart, That He may be yours now, And you’ll be His child."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 593",
    "verses": [
      "God Almighty, Glorious Father, To You Lord I cry with pleading, With you I plead, though worm. Hear thy struggling child come praying, One who struggles, faced with death here, Sinful orphan child I am. ",
      "Lord I linger, struggle much here, I am standing between great gulfs, And I am not safe here. In a twinkle of eye I’ll be, Either with you in Home above, Or be with Satan in hell. ",
      "O Jehovah, grant me new heart, Pour into my life O Lord God, Gracious blessings I need. Grant me behold Your precious gifts. That I may not faint in death, Lord, That I may not perish here. ",
      "4. Help me know that there is great Day, Frightening Day when you shall [come back, Come with pomp and glory. Day for judgment, judgment for men, Let me hear your voice Lord, saying, “You are not condemned, my child”. ",
      "Fix my mind on this thought always, With all strength and might I must seek, Seek eternal life here. All Your plans Lord, shall ripen soon, Grant that righteous fruit shall bear now, Bear much fruit for You my God. ",
      "Savior Lord, have mercy on me, Save my soul deliver me, Lord. Make me one with You, Lord. Faith shall matter, Life eternal, The night watch has ended here now, Love eternal we do have. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 594",
    "verses": [
      "Children of peace, listen to the Lord’s Word, “Love your neighbor as yourself”. By this you shall have great peace, where you dwell, And you shall be greatly blessed. Truly, we have grace abundant from God, By this we must lay our lives for others. We shall be each other’s friends, This is what we all must seek. ",
      "Great respect you must have for all God’s saints, Humble you must also be. If you are filled with the love of Jesus, You shall love each other well. If you have a friend that loves you so well, You should love this person as yourself same, And you all shall peaceful live, Joyful life you all shall have. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 595",
    "verses": [
      "If you profess to love the Father, But love not people in your life. You are not truthful, but a liar, You are in death and not in life. Love is of God, for God is Love, We must be one with God in love. ",
      "We have one Lord, we have one Father, And we all share one common flesh. I must show love to those around me, Love neighbor as I love myself. Almighty God made all for all, He did not make for only one. ",
      "Jesus You are the Savior for all, You gave Yourself for all mankind. Jesus, Your Blood, is all sufficient, The price You paid for all our sin. I cannot spite those You have saved, For those You shed Your Holy Blood. ",
      "Great sin in me God has forgiven, He loved me and forgave my sin. If any friend trespass and wrong me, Should hurt me, hate me in this life. I must not seek revenge for this, But seek forgiveness for my friends. ",
      "If I should love the Saints of God here, And love the least of all brethren. And even give cold water needed, To quench the thirst of one in need. The Lord regards such precious gifts, He sees such offering as for Him. ",
      "If you do not show love to others, Compassion may not come your way. If you hate others, you seek judgment, Death judgment you seek for yourself. So plead with God, His grace to grant, Give you a heart to love all men. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 596",
    "verses": [
      "Lord Jesus, help me love my neighbor truly, Seek not to judge him; seek not to condemn him, Seek not to harm him, by unhelpful comments, Seek not to undermine. ",
      "Grant me to bear with, weaknesses of others, Grant me compassion, with a heart that feels. Help me to grieve for those that hate and hurt me, Help me to bear them up. ",
      "Help me to seek their welfare, and support them, Help me to see the precious soul they have too. Jesus You died for all these souls so precious, You died for all mankind. ",
      "Help me to love the strengths of those that hate me, For all such good gifts come, from Lord the Father. Help me that I may not covet his treasures, But rejoice in his gifts. ",
      "Lord, make me humble, meek and lowly servant, To serve all men as pleasing in Your sight, Lord. Help me to seek not hatred for anyone, Selfless help me to be."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 597",
    "verses": [
      "See how pleasant and how good, Joyful life we all shall have. When believers in the Lord, Live as friends in unity, Live in, peace and unity. ",
      "Such life is like fragrant oil, On the head of Aaron poured. Oil that flows down from his head, Down to beard and to his robe, Love must be so fragrant too. ",
      "It is like the dew of Heav’n, That flows to refresh the earth. Vegetation green it gives, Much fruit from the earth it brings, Love must be so fruitful too. ",
      "Where God’s people live in love, There His promises shall dwell. Blessings full He pours on them, Life in all its fullness gives, Jesus, we desire such love. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 598",
    "verses": [
      "Behold how good it is, Pleasant, it is also. When brothers dwell in unity, Such life we must desire. ",
      "It is like precious oil, Upon the head is poured. Such precious oil that flows from head, Into the beard it flows. ",
      "It is like precious oil, Poured upon Aaron’s head, Runs down into his beard below, Into the robe he wore. ",
      "It is like Hermon’s dew, That falls from high above, Upon the mounts of Zion fall, Such dew, come from above. ",
      "For there, Jehovah spoke, Spoke blessings from above. A covenant of life He blessed, Life forever, He gives. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PEH 599",
    "verses": [
      "Eternal Ruler of the ceaseless round, Of circling planets singing on their way, Guide of the nations from the night profound, Into the glory of the perfect day; Rule in our hearts, that we may ever be, Guided and strengthened and upheld by Thee. ",
      "We are of Thee, the children of Thy love, The brothers of Thy well-beloved Son! Descend, O Holy Spirit, like a dove, Into our hearts, that we may be as one; As one with Thee, to whom we ever tend; As one with Him, our Brother and our Friend! ",
      "We would be one in hatred of all wrong, One in our love of all things sweet and fair, One with joy that breaketh into song, One with the grief that trembleth into prayer, One in power that makes the children free, To follow truth, and thus to follow Thee! ",
      "O clothe us with Thy heavenly armour, Lord, Thy trusty shield, Thy Sword of Love Divine; Our inspiration be Thy constant word; We ask no victories that are not Thine: Give or withhold, let pain or pleasure be; Enough to know that we are serving Thee! "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  }
