
  {
    "name":"PHB 400",
    "verses":[
      "My life is but a worm on earth,It wriggles, struggles here.My sins have weighed me down, O Lord,Distressed, I am in life",
      "There is great evil in my heart, Unyielding heart I have. Break Lord this heart of stone in me, And come and dwell within",
      "Drive out this evil life of sin, Cleanse Lord, my heart and mind. Cast out all doubt and fear in me,In You, O Lord, I trust",
      "Come Holy Spirit, quickly come,Shine God’s Light in our lives.The darkness drive away from us,Make us light of the world."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 401",
    "verses":[
      "Repent and turn away from sin, Jesus the Lord has said. The Kingdom of the Lord, is here, God’s Kingdom is so near. ",
      "Sin is forgiven by the Lord, The sin we committed. The Lamb of God is with us now, He takes away our sin. ",
      "God gave His only Son for us, He gave Him for mankind. To save us all from sin and death, New life we have in Him. ",
      "Eternal life we have in Christ, Freely He gives this life. The love of God is manifest, God loved the world so much. ",
      "Let us return now to our God, Let us come back to Him. Come to the Lord and Father God, Come to the Son of God. ",
      "Create in me a new heart now, Lord, hear my humble cry. Restore me as your child again, Clothe me with honor now. ",
      "Jesus, You are the Lamb of God, You took away my sin. Grant me to stay by You, O Lord, And give me lasting peace. ",
      ""
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 402",
    "verses":[
      "Dear Father glorify Thy child, Help me to honor You Lord. With great compassion, come to me, Cleanse me from every sin, Lord. Wash me O Lord, take sin away, And all transgressions take away, Purge me, then I shall be clean ",
      "My sin is ever before me, I know all my transgressions. I cannot rid myself of sin, They are before me always. Against You Lord, You only Lord, I’ve sinned and done what is so wrong, Lord, You are righteous always. ",
      "You seek for inward truth from us, Grant wisdom for discernment. I come to You, cleanse me, O Lord, With hyssop purge me from sin. Wash me and make me pure within, Let all my inward life be pure, Fill me with joy and gladness ",
      "Cast me not from Thy presence Lord, Take not from me Thy Spirit. Restore to me Thy joy, dear Lord, Grant me afresh salvation. Uphold me with a willing mind, Then I shall teach all that transgress, And sinners shall return ‘Home’. ",
      "Open my lips, I pray Thee Lord, And I shall sing Your praises. Mere sacrifice You do not need, You do not need burnt offerings. A broken, contrite heart You seek, Such life is pleasing in Your sight, Help me to come repentant. ",
      "The sacrifice acceptable, Is broken, contrite spirit. A contrite heart, O Lord my God, You shall despise not, reject. Do good to Zion with pleasure, Jerusalem’s broken walls build, Then sacrifices, bring to me. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 403",
    "verses":[
      "precious act of God to bless me, Revived my spirit, gave new life. Desire I have for life eternal, Desire so sweet I have from God. Nothing could meet the soul’s desires, What can secure eternal peace? ",
      "Righteous the Lord, but I so sinful, My sin has led me far from God. There is no hope for me a sinner, There is no peace of life for me. Hope is in You the Lord Jehovah, Grant me to come to You, O Lord. ",
      "Lord, You have brought me to the Savior, The Son of God has rescued me. My faith is rooted in Him only, I am now one with Jesus Christ. In this, I am a child of God, And God is Father for us all. ",
      "I have no pleasure in earth’s treasures, The treasures that, are transient here. If I have all, this world can offer, What shall this be for me in death? You are my treasure and desire, You are my blessing and my joy. ",
      "Then I shall dwell with Jesus always, In Christ, the Priceless Treasure, dwell. Strengthen, O Lord, Your servant always, Strengthen, O Lord, when death shall come. Grant me to hear You say to me, Enter the joy of life of God. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 404",
    "verses":[
      "My hope is in Jesus my Lord, In Him alone I trust now. You are my Savior Jesus Christ, I have none but You, O Lord. No man has saved himself from sin, No angel can redeem from death. You are my Lord and God and King, In You alone, In You alone, I trust always, ",
      "My sin is weighty and so large, This grieves my soul indeed Lord. I plead forgiveness from You Lord, Take all my sin away now. Accept me as I am, dear Lord, You bore my sin and died for me. You paid the wages for my sin, And now I’m free, Your promise holds, I’m free from sin. ",
      "Increase in me the gift of faith, Deepen my faith in You, O Lord. That I might claim Your blessings, Lord, Always be blessed in You Lord. Help me to love You dearly Lord, And love and care for others here. Lord be with me when death shall come, Be with me Lord, Be with me as I go through death. ",
      "Lift High the God of Glory now, Lift up high the God of grace. Lift high our Savior Jesus Christ, Lift Him who stands for us all. Lift high the Holy Spirit Lord, The One who helps us in this life, To please You Lord in all we do. In present life, And to eternity, we pray. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 405",
    "verses":[
      "Yes, God is love, Eternal Love He is, He loves to bless us all. He loves His own, The ones who are His own, That seek to please Him here. Come then, all people, to Christ Jesus, All you that sinned against the Father, Repent of sin. ",
      "Creator God, The One who made us all, He loves us all so much. We must all seek, To share Christ’s nature here, And be like Him in heart. Lord grant Your love to move our hearts now, That we may love as righteous children, Love You, O Lord. ",
      "High is the Lord, Almighty God is He, Myriads of angels have. He loves us much, We creatures here on earth, His glory shines in us. What glorious thanks we all must offer, Give to the Lord our hearts in worship, Thanks to His Name. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 406",
    "verses":[
      "In baptism, I am blessed, Greater blessings have than first birth. In this I have life in full, Life of God I have in new birth. What is birth by mortal flesh? If Christ is not one with me. ",
      "Life God gave me in the flesh, Life for this life only gave me. Now I have new life from God, In baptism I have God’s life. Life of flesh shall soon end here, Life in God is evermore. ",
      "I was baptized into Christ, I am one with Jesus Christ now. I am now a child of God, God has bought me with His own Blood. Spirit of the Lord, I have, I am called by God’s own Name. ",
      "When I suffer in this life, With much praying, I shall prevail. When the time of death has come, I shall trust Christ Jesus only. Blood of Jesus is the sign, I am safe for evermore. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 407",
    "verses":[
      "The past life lived, I see as empty, Unfruitful life and nothing gained. A life of flesh and lustful pleasures, I craved the flesh and vanities. Such life, I now, desire no longer, My Savior has delivered me from such. ",
      "And now I thank the Lord, Christ Jesus, Eternal ruin He saved me from. He saved me from the power of Satan, He bought me back, as child of God. In this I have great peace and gladness, Great freedom have and joy eternally. ",
      "The flesh is strong, I struggle with it, I wrestle still with forces dark. I must put on the ‘armor’ always, And put my trust in Jesus Christ. What He began, He soon shall complete, All things shall work for good for me in Christ. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 408",
    "verses":[
      "In holy baptism in Jesus, We are baptized into His death. That we may live no longer to sin, No longer live to please Satan. In this baptism we are blessed, Glorious we are as God’s children. ",
      "Baptized into the death of Jesus, We’ve died with Jesus Christ the Lord. And just as Jesus Christ is risen, He’s risen with a glorious life. So with Him we shall all be raised, We shall receive eternal life. ",
      "Come all baptized in Christ the Savior, Live with the new life of the Lord. Lust of the flesh no longer pursue, No longer seek to live in sin. We must resolve to please the Lord, Live as ambassadors of Christ. ",
      "If we have died to sin with Jesus, Then follow Christ in faithfulness. Our baptism shall be a blessing, Among God’s children we shall be. We shall rejoice in Christ the Lord, Have life eternal, peace in Christ. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 409",
    "verses":[
      "All you that seek blessings, In baptism with tears, Come to the Savior Jesus Christ, That He might wash you clean. ",
      "Repentant ones, come now, Joyful come to the Lord, The Blood of Jesus makes you clean, Righteous you shall become. ",
      "When you are now baptized, In Jesus’ Name, baptized, The Lord the Father shall forgive, All sin committed here. ",
      "If in Christ you believe, Trust Him, rely on Him, You’ll be His children always then, He’ll favor you ever. ",
      "Then come and follow Christ, Seek things above, as well, Your dwelling place shall be with God, Forever, dwell with Him. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 410",
    "verses":[
      "You followers of Christ, Put on God’s armor now. Be strong and bold, courageous be, Be strong in Christ the Lord. ",
      "The Lord in battle, strong, Jehovah, God is He. Strength He will grant His children now, Stand firm to fight the foe. ",
      "Then put the armor on, Whole armor put on now. That you may stand against the foe, Fight to the end of life. ",
      "Stand strong, God’s people now, With courage fight the foe. Jesus is with you to the end, Eternal peace He’ll give. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 411",
    "verses":[
      "Jesus Lord, we’ve come to You, Come to listen to Your voice Lord. Children we bring to You, Lord, You bid us to bring them to You. In obedience, we bring children, They are here for blessings from You. ",
      "We have heard Your Word, O Lord, Thy Word calls us, “come to Jesus”. Baptism by water and By Thy Spirit we have new life. By this we become your children, We belong to God’s own Kingdom. ",
      "Therefore we have come to You, Bringing children for Your blessings! Let Thy face shine on them, Lord, Merciful be to our children. Make them as Your children, Jesus, Make them as Your lambs, dear Shepherd. ",
      "Jesus, cleanse these children now, By Thy precious Blood, cleanse all sin. Channels only we are Lord, Blessing of Baptism You give. Dead in sin, is what we are, Lord, In You, we have life eternal. ",
      "Grant these children new birth, Lord, Take away from them all curses. Free them from the evil one, Free them from the power of Satan. Cleanse them from the filth of sin, Lord, Make them clean in You, Lord Jesus. ",
      "Shepherd Lord, Your sheep receive, Take them, guide them, feed them always. Lead them in the Way to Heav’n, Let Thy Kingdom come, Lord Jesus. True Vine grant that these Your branches, Flourish and bear much fruit for You. ",
      "We entrust them to You Lord, High Priest, we bring these our children. In Your arms hold gently Lord, Hold these children safe forever. Write the names we give to them now, In the “Book of Life”, write these names. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 412",
    "verses":[
      "Christ Jesus, while here on earth, children you loved, You called them and blessed them, placed on them, Your hands. We pray for our children, love all of them Lord, And call them and bless them as you did of old. ",
      "Good Shepherd, these children are part of Your sheep, Keep them as Your children as those You have saved. Put Your Law in their minds, write them on their hearts, Grant them to be faithful and follow the truth. ",
      "These children before You we now here present, They all are Your children, we give them to You. Gracious Spirit, fill them, dwell in their hearts now, Be with them here on earth, and in Heav’n above. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 413",
    "verses":[
      "Baptism in Christ, is most precious, In this we are made one with God. One with the Father, Son and Spirit, Inheritance I have so great. Now rooted in the Lord Jehovah, Where I shall grow and blossom, bear much fruit. ",
      "I’m now a child of God the Father, New Covenant, I have with Him. Lord, help me be a child so faithful, Be loving child, with heart for Christ. My body, soul and spirit give You, Surrender all to You, dear Jesus Christ. ",
      "If anyone believes in Jesus, And is baptized in Jesus Christ, That person is a new creation, Has life eternal in Jesus. Believe in Jesus with your whole heart, He’ll be your Lord; you too shall be His child. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 414",
    "verses":[
      "I thank You, O my God, For baptism You gave me. Grant grace to me, dear Lord, Grace for my growth and well being. In this new life I have, The Word of God as guide, Fill me with Thine own grace, Sanctify me, dear Lord. ",
      "Forsake all in this world, Satan and flesh forsake them! What I desire to do, Lord, please You in righteousness. In baptism bless me, Bless me with food I need, And strengthen me, O Lord, That I may stand for You. ",
      "I yield my life to you, For you I live, till death comes. In sorrow or in joy, As you ordained for me, Lord. Help me to please you Lord, In all things please my Lord. Please You in all my life, I’ll, be with You in heaven. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 415",
    "verses":[
      "My soul, rise up, See what the Savior Jesus has done for you. ",
      "Jesus, see me, You are my Savior, I am Yours always now. ",
      "The Lord, I know, There is no Savior I know beside You Lord. ",
      "Jesus, keep me, You are my Savior, I am yours always now. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 416",
    "verses":[
      "We are before You, O Lord, We are Yours always Lord. We pray Lord, confirm our faith, Come Lord bless these vows made Now give us Holy Spirit; We stand now before You we pray, We all are Your children, Lord. ",
      "You are our Father God, In You we all are saved. Holy Spirit, God who has sealed us. We shall not forget, These vows that we now make, Help us to keep these vows now. Be merciful, Lord. ",
      "True, we make these vows today, We now pledge to follow. We know we are flesh and blood To temptations yielding, Come Lord strengthen us always. We commit our life to You Lord, Lord, be with us we pray You. ",
      "You are our Father God, In you we all are saved. Holy Spirit, God who has sealed us. We shall not forget, These vows that we now make, Help us to keep these vows now. Be merciful, Lord. ",
      "When we are tempted, deceived, We are all led astray. Come shield us and protect us, Snatch us from the devil, Help us fight the evil one. When lustful things of this earth tempt, Provide escape for us all. ",
      "You are our Father God, In you we all are saved. Holy Spirit, God who has sealed us. We shall not forget, These vows that we now make, Help us to keep these vows now. Be merciful, Lord. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 417",
    "verses":[
      "Lord Jesus You laid down your life, You died that we might live. Keep us like babies in You Lord, Make us Your children, Lord. ",
      "These vows we make before You, Come listen to them all. Our lives we now commit to You, Lord, give us strength to live. ",
      "Our gracious Lord, we thank You, You sought us and You called. We have eternal life in You, Our soul is satisfied "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 418",
    "verses":[
      "Just as I am, without one plea, But that Thy blood was shed for me, And that Thou bidst me come to Thee, O Lamb of God, I come. ",
      "Just as I am, and waiting not, To rid my soul of one dark blot, To Thee whose Blood can cleanse each spot, O Lamb of God, I come. ",
      "Just as I am, though tossed about, With many a conflict, many a doubt, Fightings and fears within, without, O Lamb of God, I come. ",
      "Just as I am, poor, wretched, blind; Sight, riches, healing of the mind, Yea, all I need in Thee to find, O Lamb of God, I come. ",
      "Just as I am, Thou wilt receive, Wilt welcome, pardon, cleanse, relieve; Because Thy promise I believe, O Lamb of God, I come. ",
      "Just as I am, Thy love unknown, Hath broken every barrier down; Now, to be Thine, yea, Thine alone, O Lamb of God, I come. ",
      "Just as I am, Thy love unknown, Hath broken every barrier down; Now, to be Thine, yea, Thine alone, O Lamb of God, I come. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 419",
    "verses":[
      "Now O Lord we come to You, Stand before You, as Your children. Deepen Lord, our faith in You, Lord, accept the praise we offer. We commit ourselves to You, Lord, Take us as Your loving children. ",
      "Keep us safe in this wild world, Bless us and defend Your children. Lord You know we are so frail, Wicked, hateful foes surround us. Jesus in your love receive us, Take us to Your Home in Heaven. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 420",
    "verses":[
      "You are the Church’s Head, Lord Jesus, We are Your own, come save us now. We need You Jesus Christ, our Shepherd, We are Your sheep, we wait for You. Our grievous sins make us unworthy, Make us unworthy of Your love. Your mercies, Lord, are everlasting, Come then, in mercy, save us Lord. ",
      "Our gracious Lord, have mercy on us, Confirm in us Your gracious love. We covenant and promise You Lord, To worship You, Your glory, seek. Give us Your freedom, love and knowledge, All that we need to please You here. Grant us the grace to love You dearly, And walk in righteous paths to Heav’n. ",
      "Grant us Your peace, we pray You Jesus, The peace You give to those You love. We soon shall be with You in glory, At Your right Hand, may we be found! The Church’s Head, You are Lord Jesus, We are Your own, come save us, Lord. We need You Jesus Christ, our Shepherd, We are Your sheep, we wait for You. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 421",
    "verses":[
      "Today that my Savior, has made me His friend, know that, I belong to Christ. I rejoice to With new love I’ll love Him, Always worship Jesus; I shall have His peace in life always. ",
      "In Jesus I shall have, everlasting joy, Pleasures this world offers, shall soon pass away. I seek nothing to know, In this fleeting life here, All I seek here is You Lord Jesus. ",
      "The Good Shepherd cares for all of His own sheep, His lost sheep He seeks now, seeks to bring them home. He is full of mercy, Loving God our Savior, Jesus seeks His own sheep to save them. ",
      "A lamb I am also, I shall be with Christ, Jesus calls me by name, gives me what I need. Who can separate me from, Jesus Christ my Shepherd, Jesus Christ my friend and my Savior. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 422",
    "verses":[
      "We come before you gracious Shepherd, We come before your Mercy seat. In joy receive your chosen children, To you we bring our worship now. ",
      "Our hearts are full of sin and evil, Unworthy, we approach Thy Throne, We pray Thee cleanse our hearts from evil, And save us from Thy wrath, O Lord. ",
      "Thy covenant of grace we cherish, We seek to be Your children true, We long to grow in grace and favor, Help us, O Lord, to please You now. ",
      "By faith we seek to love and serve Thee, Thy glory Lord we may reveal, Give all our hearts and minds as servants, Obedient servants, help we seek. ",
      "Grant us to share in joy, our Father, Grant this for us Your chosen race Sit on Your right, O Lord, in Heaven. Say Amen; Lord, so let it be. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 423",
    "verses":[
      "In You the Father, Son and Spirit, Baptized I am, and sanctified, To be a part of the redeemed, Lord, Part of the blessed born of God, Born in the Lord, Redeemer, Christ, Filled with Your Holy Spirit, Lord! ",
      "Make me a precious child of Thee Lord, In this Thy sacred baptism, Grant Lord that I might have all blessings, Full blessings from Your death for sin; And in this life of pain and grief, Comfort me in Thy Spirit, Lord. ",
      "Obey You Lord, and live to love You, With fear and trembling, as Your child, You seek that I might serve You only, And so dear Lord, I give You all; Forsaking all that Satan gives, Forsaking all for You, till death! ",
      "Lord Jesus You are Truth and the Way, In you God’s covenant is sealed. Troubled with danger and temptations, Your servant may yield and may fall, Your Word assures me of Your love, Cast not Your servant from Your sight. ",
      "When I remember O Lord my sin, See all the filthiness of heart. Accused by Satan as unworthy, Then I remember You, O Lord. You are my righteousness Jesus, You are, O Lord, my worthiness. ",
      "Committed only to You, dear Lord, Committed to the Triune God, Help me Your covenant to treasure, Through all my life and unto death, And in this life or in dying, Thy Glory, Lord, I may reveal. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 424",
    "verses":[
      "We worship You and honor You. Look upon us, Your saints, We bow before You Lord, Christ our Savior: We pray to You, receive us Lord, We bring our children now to You. ",
      "We worship You and honor You. Look upon us, Your saints, We bow before You Lord, Christ our Savior: We pray to You, receive us Lord, We bring our children now to You. ",
      "Lord of Peace, You have received me, In baptism You owned me, Jesus, You loved me and You welcomed me. You have blessed me with all blessings, ",
      "Sorrowful I am Lord, without You, In You I have such great honor. My Savior, Jesus Christ, I come to You with joy, Lord I thank You: For all the precious gifts from You, Your mercy is so full and free. ",
      "I shall cling to You Lord Jesus, I long to be with You forever, Lord, be with me forever more. In this world of sin and evil, Be with me, make me faithful servant, And glorify Your servant here. ",
      "Grant me, O Lord, I pray, Peace and great joy in life, Always grant me: Your love is full, O Lord my God. Your covenant with me is great. ",
      "Jesus Christ You are our Shepherd, Give us the Holy Spirit, Jesus, That I might always stay so close. In this I have all I need here, Love, patience peace and joy and kindness, ",
      "To serve You Lord as servant here, Come quickly Jesus Christ, The battle soon shall end, Save Your people: Grant us to be with You in Heav’n, We all shall sing; Hallelujah. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 425",
    "verses":[
      "Lord be with us as we pray, Deepen faith and trust and hope Lord, What we seek to do this day, Grant that we may do in pure hearts. Truthful children always be Lord, Always seek to be true servants. ",
      "Dear Lord, help us in this life, Help us in this life pilgrimage, Feeble, frail and weak we are, Against mighty foes in this life. Be Thou Lord a Mighty fortress, Strong Deliver, Christ our Savior. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 426",
    "verses":[
      "Jesus Christ, Good Shepherd is, There is none like Him in all life. He gives all His life to us, Nothing He withholds from loved ones. We are sheep of Jesus Christ, He has bought us with His Blood. ",
      "For salvation Jesus came. He became flesh for this reason. He was substitute for us, All our sin was placed upon Him. When we give ourselves to Him, Glorious blessings we shall have. ",
      "Those that hunger for the Lord, And call upon Jesus Christ now. They shall see in Jesus Christ, Wonderful love He has for them. Satisfied they all shall be, Here and in eternity. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 427",
    "verses":[
      "Hungry soul, come now to Jesus, Feed on blessings from His Passion, Come thou thirsty soul, come quickly, Drink deep from the Living Waters. Jesus Christ, your loving Savior In whose Blood is life eternal, With His righteousness He clothes you, This must be your joy eternal. ",
      "I shall cling to Jesus always, Always seek His blood as covering. For in Him I have all blessings All my spirit needs forever. For I have a blessed Savior, Jesus Christ my joy and pleasure, There is none, my soul to satisfy, Be with me always, dear Jesus. ",
      "I desire to dine with Jesus, Seek the bread and wine He offers. Fill my soul and dwell within me, Fill my life with all Your life Lord. Now I have a blessed Savior, Christ who suffered pain and sorrow, Suffered death and humiliation; Christ my Lord and blessed Savior. ",
      "Bread of God in Christ, now broken, Take and eat with much thanksgiving. Flesh of Christ, the Lord the Savior, By faith eat for life eternal. This the food for my redemption, On the Cross His body broken, Broken, in the grave was buried, Now in glory, Christ, has risen. ",
      "Now my Jesus is in Heaven, But with us He dwells in Spirit. He is with us now and always, Nothing can withhold His blessings. Christ has sent the Holy Spirit, To be always with God’s children, Nothing can restrain His actions, He is present in this Bread now. ",
      "Blessed is the Wine before us, Blood of Jesus we receive now. Covenant of Blood in Jesus, Blood so freely shed for sinners. Blessed Savior, is my Jesus, I rejoice in Him my Savior, True joy in my soul I have now Drink my soul, this Life of Jesus. ",
      "Gracious Lord, I plead for mercy, You are full of mercy, Savior. You have cleansed and made me righteous, All my sin is now forgiven. Therefore come Lord dwell within me, Make my heart a dwelling place Lord, Let Thy Spirit, Lord, with me abide, Live in me now and forever "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 428",
    "verses":[
      "Prepare our hearts, as we gather, To celebrate Your Supper with You, Prepare us Lord to come aright. Deepen faith in you dear Jesus, We give to You our hearts and whole being, Life in all fullness, You gave us. ",
      "We are Your children, Lord, Close hold us by You Lord, We cling to You. We praise You Lord, we give you thanks. We soon shall Dine with You in Heav’n. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 429",
    "verses":[
      "Dear Savior Jesus, You alone do I have, My only plea Lord, is the precious Blood, Unworthy sinner, poor such wretched sinner, Lost and condemned one. ",
      "No hope I have in life here or in Heaven, None is so gracious, loving as my Savior, None is a refuge, sure and safe for sinners, None other but You! ",
      "Your great compassion, grace and mercy, kindness, Long-suffering Lord, You bear with me Your servant, Pardon my sin Lord, shameful sinner like me, Always, bless my soul. ",
      "Blind, lost and wandering, groping in this darkness, No hope I had for life and life eternal. But you O Lord God, found me and redeemed me, To you now I yield. ",
      "Thanksgiving, praises, from the heart I render, To my dear Lord God, and to Christ my Savior, For great salvation, for a wretched sinner, His Kingdom, belong. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 430",
    "verses":[
      "Draw near to Christ’s Table now, God Himself, inviting. Draw near with repentant hearts, Gracious gift, receive now. Come in prayer, seek the Lord, Come to Christ the Savior, With His Blood, He saves you. ",
      "Come receive the Bread of Life, Blood of Jesus Christ, have. Christ’s own life you have in you, Life eternal you have. Jesus died for our sin, Jesus died for sinners, And He rose victorious. ",
      "Come with pure hearts to the Lord, With pure hearts, to praise Him; Come and follow Jesus Christ, And be faithful to Him. Risen Lord, glorious Christ, He shall bless His dear ones, And shall make you like Him, ",
      "Priceless treasure, Jesus Christ, He’s our only Savior. Widely open all our hearts, And receive Christ Jesus. He is love, perfect love, No one is like Jesus, Son of God, our Savior. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 431",
    "verses":[
      "Jesus Christ, our Savior Friend, Has removed the curse from us. By His suffering on the Cross, From sin and death has saved us. ",
      "In the Bread we all partake, Body of Christ we all share. In the Wine that is His Blood; We remember God loves us. ",
      "All that share this blessed Food, Come sincere with pure hearts, true. That in God you may be blessed, Judgment, bring not to yourselves. ",
      "O give thanks to Christ the Lord, For this Food He gives you now. Food that takes away your sin, By the death He died for you. ",
      "By faith in this Food for you, You have healing for the soul. Healing every sinful soul, Souls that seek help from the Lord. ",
      "Come, repentant, sinner come, Seek His grace in earnest now. All who seek Him falsely shall, Suffer greatly for their sin. ",
      "All who labor, Jesus calls, Come to Him and take His rest. Jesus came not for the strong, For the righteous, He came not. ",
      "If you have all that you need, Savior, you will not need then. If holy and strong you are, Then you need not come to Christ. ",
      "If in heart you trust the Lord, And profess Jesus as Lord. True witness of Christ shall be, In the Lord have peace in heart. ",
      "Fruitful you shall be for Christ, Love your neighbor as yourself. Lay your life for others now, Jesus laid His life for you. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 432",
    "verses":[
      "We leave the Table of the Lord, We have been fed in mind and soul. In Jesus’ death, new life we have, We have been healed by God’s great Love. ",
      "Diligent we are, by His grace, Faithfully we proclaim the Word. We duly follow Jesus Christ, In dangers here, we follow Him. ",
      "The Love of Christ has filled our hearts, This is the food that satisfies. We work the works of Christ whilst here, In patience we must serve the Lord. ",
      "Be with us strengthen us, O Lord, Help us to follow you to Heav’n. Bless us with joy as we all wait, For you, O Lord, on that great Day. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 433",
    "verses":[
      "Jesus the lover of my soul, Your great love is so dear to me. The love that sent You to the Cross, In such great love, You saved from sin. ",
      "My life is corrupted by sin, My sin has brought great shame to me. But You have laid a Table now, A Table laid for me a wretch. ",
      "Great Physician, You are for me, Your light shines brightly in my life. You clothe me with what I need most, Your righteousness shall cover me. ",
      "Come heal me Lord, I plead with You, Come heal the soul and make me whole. Come cleanse me from unrighteousness, Lord, cleanse me with the Blood You shed. ",
      "Take from me Lord, the lust of flesh, Fill me, Lord Jesus, with Your love. Come live in me, Lord Jesus Christ, Communion have with You always. ",
      "Drive from me Lord, all evil foes, And be the King of all my life. Your Word I treasure in my heart, Your Spirit, strengthens me always. ",
      "Now I desire to please You, Lord, Help me to live aright, for You. Grant wisdom, knowledge, all I need, The right to do to please You, Lord! ",
      "When life is over for me, Lord, Come Jesus take me from this world. That I might be with You in Heav’n, Be satisfied in You always. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 434",
    "verses":[
      "Here, O my Lord, I see Thee face to face; Here would I touch and handle things unseen; Here grasp with firmer hand the eternal grace, And all my weariness upon Thee lean. ",
      "This is the hour of banquet and of song; This is the heavenly table spread for me; Here let me feast, and feasting, still prolong The hallowed hour of fellowship with Thee. ",
      "Here would I feed upon the bread of God, Here drink with Thee the royal wine of Heaven; Here would I lay aside each earthly load, Here taste afresh the calm of sin forgiven. ",
      "I have no help but Thine; nor do I need Another arm save Thine to lean upon; It is enough, my Lord, enough indeed; My strength is in Thy might, Thy might alone. ",
      "I have no wisdom save in Him Who is My Wisdom and my Teacher both in One; No wisdom can I lack while Thou art wise; No teaching do I crave save Thine alone. ",
      "Mine is the sin, but Thine the righteousness: Mine is the guilt, but Thine the cleansing Blood; Here is my robe, my refuge, and my peace; Thy Blood, Thy righteousness, O Lord my God! ",
      "Too soon we rise; the symbols disappear; The feast, though not the love, is past and gone. The bread and wine remove; but Thou art here, Nearer than ever, still my Shield and Sun. ",
      "Feast after feast thus comes and passes by; Yet, passing, points to the glad feast above, Giving sweet foretaste of the festal joy, The Lamb’s great bridal feast of bliss and love. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 435",
    "verses":[
      "Deck thyself, my soul, with gladness, Leave the gloomy haunts of sadness; Come into the daylight’s splendor, There with joy Thy praises render Unto Christ Whose grace unbounded Hath this wondrous banquet founded. Higher o’er all heav’ns He reigneth, Yet to dwell with Thee He deigneth. ",
      "Hasten as a bride to meet Him And with loving reverence greet Him; For with words of life immortal Now He knocketh at thy portal. Haste to open gates before Him, Saying, while thou dost adore Him, Suffer, Lord, that I receive Thee, And I nevermore will leave Thee. ",
      "He who craves a precious treasure Neither cost nor pain will measure; But the priceless gifts of Heaven God to us hath freely given. Though the wealth of earth were offered, Naught would buy the gifts here offered: Christ’s true body, for thee riven, And His Blood, for thee once given. ",
      "Ah, how hungers all my spirit For the love I do not merit! Oft have I, with sighs fast thronging, Thought upon this food with longing, In the battle well nigh worsted, For this cup of life have thirsted, For the Friend Who here invites us And to God Himself unites us. ",
      "In my heart I find ascending Holy awe, with rapture blending, As this mystery I ponder, Filling all my soul with wonder, Bearing witness at this hour Of the greatness of God’s power; Far beyond all human telling Is the power within Him dwelling. ",
      "Human reason, though it ponder, Cannot fathom this great wonder That Christ’s body e’er remaineth Though it countless souls sustaineth And that He His Blood is giving With the wine we are receiving. These great mysteries unsounded Are by God alone expounded. ",
      "Sun, who all my life dost brighten, Light, who dost my soul enlighten; Joy the best that any knoweth; Fount, whence all my being floweth; At Thy feet I cry, my Maker, Let me be a fit partaker Of this blessèd food from Heaven, For our good, Thy glory, given. ",
      "Lord, by love and mercy driven, Thou hast left Thy throne in Heaven. On the cross for me to languish, And to die in bitter anguish. To forego all joy and gladness, And to shed Thy blood in sadness. By this Blood redeemed and living, Lord, I praise Thee with thanksgiving. ",
      "Jesus, Bread of Life, I pray Thee, Let me gladly here obey Thee. By Thy love I am invited, Be Thy love with love requited; From this supper let me measure, Lord, how vast and deep love’s treasure. Through the gifts Thou here dost give me As Thy guest in Heav’n receive me. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 436",
    "verses":[
      "O Thou, who at Thy Eucharist didst pray That all Thy Church might be forever one, Grant us at every Eucharist to say With longing heart and soul, “Thy will be done.” O may we all one Bread, one Body be, Through this blest Sacrament of unity. ",
      "For all thy Church, O Lord, we intercede; Make Thou our sad divisions soon to cease; Draw us the nearer each to each, we plead, By drawing all to Thee, O Prince of Peace; Thus may we all one Bread, one Body be, Through this blest Sacrament of unity. ",
      "We pray thee too for wanderers from Thy fold; O bring them back, Good Shepherd of the sheep, Back to the faith which Saints believed of old, Back to the Church which still that faith doth keep; Soon may we all one Bread, one Body be, Through this blest Sacrament of unity. ",
      "So, Lord, at length when Sacraments shall cease, May we be one with all Thy Church above, One with Thy Saints in one unbroken peace, One with Thy Saints in one unbounded love; More blessèd still, in peace and love to be One with the TRINITY in Unity. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 437",
    "verses":[
      "I’ll never forget Jesus, The One who thinks of me. He loves me so much He gave, He gave His all for me. When I was lost and dying, From hell He rescued me. Christ loves me so much, He gave, He gave His life for me. ",
      "What must I do to thank Him? For wondrous love He’s shown. My heart and all I’ll give Him, With great joy I shall give. For Jesus died to save me, He suffered on the Cross. He took away my sin, shame, I’ll follow Jesus Christ. ",
      "For sin we have committed, Christ suffered so much here. From this I have eternal life, The life I deserved not. When death shall come at last here, He’ll stretch His Hand for me, He’ll take my soul, bring me Home, By faith, He’ll bring me Home. ",
      "His Blood and Body gave us, He yielded all for us. The shame of sin Christ suffered, And now I have great joy. Jesus desires to bless us, And give us light in Him. Draw near to Him be in Him, His peace you shall all have. ",
      "Shine brightly in me Jesus, In joy and sorrow shine. Help me remember that Blood, You poured for me and all. Help me to love you dearly, And trust you only, Lord. Bring me at last to Heaven, Where always I’ll have joy. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 438",
    "verses":[
      "Jesus Christ, the friend of mankind, Savior came to save all sinners. On the Cross You suffered for us, Suffered, paid for all the wages. I shall praise You gracious Jesus, Merciful You are to poor ones. Poor sinners like me and all mankind, We now bow before You, praise You. ",
      "You have blessed me with salvation, From Your riches I have life now. With great love You did redeem me, From my sin and evil saved me. Lord You paid the debt I owed you, You freed me from dreadful, great fear. Peace, eternal life You gave me, Precious blessings fill my heart Lord. ",
      "Lord we come to this Thy Table, Bless this Food for us your servants. True Vine You are dear, Lord Jesus, We have life from You, as branches. Help me strengthen me Your servant, Lust of flesh, take from my mind Lord. Help me to abide in You the Vine, Bear much fruit by this for You, Lord. ",
      "Covenant with You renew now, Lord we give You all our hearts now. Good example You have left us, Jesus You, we seek to follow. A new heart, create within us, Help us walk in righteous paths, Lord. Whether living or in dying, Seek to glorify You, Jesus. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 439",
    "verses":[
      "Father, who on man dost shower Gifts of plenty from Thy dower, To Thy people give the power All Thy gifts to use aright. ",
      "Give pure happiness in leisure, Temperance in every pleasure, Holy use of earthly treasure, Bodies clear and spirits bright. ",
      "Lift from this and every nation, All that brings us degradation; Quell the forces of temptation; Put Thine enemies to flight ",
      "Be with us, Thy strength supplying, That with energy undying, Every foe of man defying, We may rally to the fight. ",
      "Thou Who art our Captain ever, Lead us on to great endeavor; May Thy Church the world deliver: Give us wisdom, courage, might. ",
      "Father, who has sought and loved us, Son of God, whose love has bound us, Holy Ghost, within us, round us, Hear us, Godhead infinite. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 440",
    "verses":[
      "Christ Jesus, was among His own, Much grief and sorrow, He had. Great trouble with much anguish here, He bore our sinful burdens. Distressed was He, but full of love, He faced the cross, turned not back, Victorious was He, in this. ",
      "Desire He had to celebrate, That feast of Passover meal. The Feast that signified His life, His Body was the True Lamb. In this last meal, we celebrate, The Lord’s death, until He comes. Communion we have with Him. ",
      "On that dark night after the meal, Christ Jesus was betrayed then. Death faced Him, such a dreadful death, A frightful ordeal He faced. But see how brightly shone His face, And even restored, cut ear, Forgiving, peaceful, was He. ",
      "The bread He broke, the wine He gave, Stood for His life He gave us. This Holy food, He gives to us, That we may share in His life. We now partake in this great meal, We all are blessed by this Food. Eternal life, we all have. ",
      "I bless You dear Lord Jesus Christ, From You I’m blessed with much grace. Your invitation now I have, To join You Lord, at Table. I shall be Yours, for You are mine, Nothing shall come between us, Nothing on earth shall separate. ",
      "On that Day when I see my Lord, In peace and joy in Heaven. Jesus my Savior, I shall praise, The Lamb of God shall worship. I’ll praise my Lord, extol His love, With loud voice I shall praise Him, Sing joyful songs in worship. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 441",
    "verses":[
      "On that great night, before Your passion, Before You suffered and you died. Jesus Your Body and Blood offered, The blessings from these You gave us. All those who trust You and believe You, Give thanks to You for gracious gifts had. ",
      "As often as this Supper partake, Your death we do remember now. Your love and passion for us sinners, We see in this Your Sacrament. The Blood, the suffering and Your, dying, We see afresh in this Food offered. ",
      "The bond of love we have with Jesus, Is firm and strong, such solid bond. The friendship we all have with Jesus, Is also strong, we treasure this. As we partake this meal before you, We are united with you Jesus. ",
      "The Bread we eat, is food that feeds us, The wine we take, the Blood of life. We have in this, life in all fullness, Our soul is satisfied by this. We have new life and strength from Jesus, We need such strength to fight and prevail. ",
      "When we partake of You, dear Jesus, Renew our fellowship with You. Unite our hearts and minds and soul, Lord, For we are Yours, redeemed by You. We eat, one Bread, we drink from One cup, Our souls are fed by You O Jesus. ",
      "The Lamb of God is full with blessings, Eternal store of blessings has. When we partake of You, Lord Jesus, We have this store of blessings then. Such blessings give; give peace eternal, No suffering here we cannot bear now. ",
      "Praise, glory, thanks and blessings give You, Give to our God for all His Love. Angels join in this heavenly worship, Sing songs of praises to our God. When we appear before You Jesus, We shall sing everlasting praises. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 442",
    "verses":[
      "O my Master Jesus, To Your Table come. Table You laid for me, Mercifully, laid. Make me fit to eat with You, This heart is not right. Lord I seek Your blessings, As I sup with You. ",
      "Thy grief and Thy sorrows, All You suffered here. Your great pain and Your death, Is what I deserve. But with great love You did bear, All my sin and death. Mercy You have shown me; You have saved my life. ",
      "Dear Lord Jesus, help me, Your grace, I desire. Come and bless me truly, May Your love abide. Take away my sin and filth, Lord, forgive my sin. Forgive my trespasses, Give me peace, O Lord. ",
      "4Grant me new life Jesus, From this blessed Meal. Give me life in this Food, Death to overcome. Victory I have from You, In the battles here. I have hope in You Lord, Hope of Heav’n above. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 443",
    "verses":[
      "Loving Savior Jesus, To You Lord I come. You have called and chosen, Table You have laid. In Your love you have done this, Merciful, You are. Prepare me now Jesus, To dine with You Lord. ",
      "Jesus You have suffered, Agony and shame. You have suffered death here, For me, You have died. What great love You showed by this, Son of God, You died. Me the guilty one, Lord, But You loved me still. ",
      "Mercy, have on me, Lord, Forgive all my sin. For my sin You died here, And You rose from death. Great salvation You have wrought, May it not be vain. Look upon me sinner, Grant eternal life. ",
      "Life abundant You have, In this Supper set. Blessings You have for us, Body, Blood, Your Life. Renewed strength I gain through this, As I walk this life. Until all is over, Then, I’ll be with You. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 444",
    "verses":[
      "Wake my soul from your deep slumber, Leave behind the works of darkness. Light of God is shining brightly, Come and share the light of glory. Christ the Savior now invites you, Come to dine with Him at Table, Those that eat the Bread from Heaven, They shall be Your guests forever. ",
      "Come the Groom is ready, waiting, Come as Bride prepared for Jesus. Christ the Savior knocks at Your door, Open to Him heart, soul and mind. Come to Him in faith, be with Him, Let Him know you are all ready, Hear Him call you to the Table, He invites you to dine with Him. ",
      "Jesus Christ, lover of mankind, In my heart I thirst for You, Lord. See the tears of longing for You, I desire this Food so blessed. My heart thirsts to drink from You, Lord, I am anxious to be with You, My soul longs for You, my Savior, Be my friend forever, Jesus. ",
      "You are Sun of Life for us all, Deep joy you give to your people. Christ the Alpha and Omega, I shall bow before you, Jesus. Give me Lord the Food I need now, Wine and Bread from You, Lord Jesus, And the Blood that You shed for me, Give me life and all Your blessings. ",
      "Lord Jesus You left your Glory, You didst come from God the Father. For our sake You came joyfully, For our sake You died to save us. You shed precious Blood for us all, With love for us you did suffer. As we all partake in Jesus’ Blood, We must grow in love for others. ",
      "Jesus Christ, the Living Manna, Come and help me and Your people. Bless us Lord, come truly bless us, As we sup with You, at Table. This is food that feeds the soul here, The food that reveals Your full love, Grant us to partake of this Food, When we you eat it new in Heaven. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 445",
    "verses":[
      "Glorious Food to partake, Son of God prepared. I come to God’s Table, Thanks I give to Him. Take the whole of my heart Lord, Take my mind and all. This I offer You, Lord, Pleasing let it be. ",
      "Grant thy Body Jesus, Grant the Blood You shed, Make me strong in You, Lord, Keep me safe in You. Grant my life here on this earth, Be as Yours, O Lord. Here on earth and Heaven, Till eternity. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""},
  {
    "name":"PHB 446",
    "verses":[
      "Jesus my joy and pleasure, You are my only treasure. You are my dearest friend, Lord, I’ll sing praises to You, Lord. ",
      "Your goodness, I acknowledge, The bounteous gifts You give me. What You provide so freely, We appreciate and give thanks. ",
      "With heart and mind we praise You, Jesus You suffered for us. You bore our pain and wages, You suffered shame for sinners. ",
      "How can I forget Jesus? You gave Your whole life for me. Your Body and Blood You gave, I’ll praise and glorify You. ",
      "Cleanse me from sin that lingers, Pure heart, give me to serve You. Come stay in my heart, Jesus, Come dwell with me forever. ",
      "None can destroy my life here, Death even shall be blessing, For Jesus You shall raise me, I shall be with You ever. ",
      "My soul cling to the Lord God, Be near to Jesus always. As you dwell in this body, Be close to Jesus, ever. ",
      "Corruption, then, I’ll see not; In peace I shall depart here! For Christ shall raise me from death; He’ll grant me see His face soon. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 447",
    "verses":[
      "These glorious Sacraments, Son of God You gave. For these we offer thanks, In adoration. For You gave Your Blood for us, And your Body gave. New strength You have given, Help me journey on. ",
      "Lord receive my spirit, To You all I give. I give You my whole being, Thanks offering I bring. My whole life I give to You, Dear Lord, take it all. When on that day You call, May I come with joy. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 448",
    "verses":[
      "Creator of the earth and Heaven, All things we need You have supplied. The earth is full of varied treasures, From these You give us what we need. Your blessings are so full and free, There is none like You, O, our God. ",
      "Multitudes You have called to serve You, Multitudes that surround You Lord. You feed all such with food they need here, All people have the food they need. You Lord supply us all our needs, Jehovah, You are awesome God. ",
      "You gave us seed to sow in much joy, In season sow the seed for food. Sunshine and rain You give for growth too, From the beginning You gave these. You made all things so well, indeed, You are so mindful of all things. ",
      "The food we need grows in our farm lands, Our farms supply the food we need. The seed is small when it is planted, But it grows soon to yield much fruit. The harvest shall be plentiful, With yield so much for food for all. ",
      "Remember God and all His blessings, Forget not God who meets your needs. For all we have and eat in this life, Reveal the love of God for us. Let all on earth with heart and soul, Praise God for He is always good. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 449",
    "verses":[
      "Lord, speak to me that I may speak In living echoes of Thy tone; As Thou has sought, so let me seek Thine erring children lost and lone. ",
      "O, lead me, Lord, that I may lead The wand’ring and the wav’ring feet; Oh, feed me, Lord, that I may feed Thy hung’ring ones with manna sweet. ",
      "O, strengthen me, that while I stand Firm on the rock, and strong in Thee, I may stretch out a loving hand To wrestlers with the troubled sea. ",
      "O, teach me, Lord, that I may teach The precious things Thou dost impart; And wing my words, that they may reach The hidden depths of many a heart. ",
      "O, give Thine own sweet rest to me, That I may speak with soothing pow’r A word in season, as from Thee, To weary ones in needful hour. ",
      "O, fill me with Thy fullness, Lord, Until my very heart o’erflow In kindling thought and glowing word, Thy love to tell, Thy praise to show. ",
      "O, use me, Lord, use even me, Just as Thou wilt, and when, and where, Until Thy blessed face I see, Thy rest, Thy joy, Thy glory share. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 450",
    "verses":[
      "Time has come now bless and commit, Send us to the Lord’s own vineyard.Work as laborers of the Lord.We seek blessings for God’s mission, And the peace of God, upon you; Christ the Lord before, behind,Christ the Lord before, behind.",
      "Strong must be, courageous always, Fear not foes against you, servant; Depend not on flesh and blood, Jesus shall be with you; provide. He shall not make mission fail you. Christ Himself shall be with you, Christ Himself shall be with you. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 450",
    "verses":[
      "Time has come now bless and commit, Send us to the Lord’s own vineyard. Work as laborers of the Lord. We seek blessings for God’s mission, And the peace of God, upon you; Christ the Lord before, behind, Christ the Lord before, behind. ",
      "Strong must be, courageous always, Fear not foes against you, servant; Depend not on flesh and blood, Jesus shall be with you; provide. He shall not make mission fail you. Christ Himself shall be with you, Christ Himself shall be with you. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 451",
    "verses":[
      "A charge to keep I have, A God to glorify, A never-dying soul to save, And fit it for the sky. ",
      "To serve the present age, My calling to fulfill: O may it all my powers engage To do my Master’s will! ",
      "Arm me with jealous care, As in Thy sight to live; And O Thy servant, Lord, prepare A strict account to give! ",
      "Help me to watch and pray, And on Thyself rely, Assured, if I my trust betray, I shall for ever die. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 452",
    "verses":[
      "Jesus Christ our Lord we worship, You died as substitute for us all. You purchased us by Your, own Blood. Jesus is our all and in all. All we have, come from You Lord Jesus, ",
      "We rest in Love of God from You. Make us your servants now, And sanctify us Lord, Let Your glory, Remain, with fullness of Your grace; Be with Your chosen; leave us not. ",
      "We did not choose You, You chose us, By grace through faith we are Your children. Before creation, You chose us. Our strength is so weak and feeble, ",
      "We are not worthy, we are sinful, But You are gracious, merciful. Lord, take away our pride, Poor servants we are Lord, We seek Heaven. Strengthen, O Lord, Your servants pray; In You alone we have great strength. ",
      "Glorious King our God Jehovah, The fields are white the harvest ready, The laborers in the fields are few. Call and send more faithful servants, Send us by grace to serve You Jesus, ",
      "Draw people to Your Kingdom, Lord. Blessed are those that come, We welcome them to Christ, Come to Jesus! God shall bless all His people now; They shall be with Him, where He is. ",
      "Multitudes are lost and dying, In valley of death many dwelling, They are not in God’s Kingdom now. They have been in darkness waiting, The morning has not dawned for all such, ",
      "They must now hear the Gospel news. Sun of righteousness come, Shine for the time has come, Christ, Lord Jesus. Lead us to preach Your Word to all; And open doors to welcome them. ",
      "Your love, Jesus in Your sufferings, In this we have so great salvation, You plead for us as our High Priest. We shall preach You only Jesus, The Cross we shall present before them, ",
      "Until they come to You Jesus. Your Word is living Word, It pierces heart and soul, God’s Word cleanses. Your yoke is easy, burden light; The Holy Spirit strengthens us. ",
      "You have sown the Seed already, Like mustard seed, your work is growing, We are mere vessels of Your Word. The great battle is for Jesus, Channels we are, dear Lord sustain us, ",
      "We trust You only, Jesus Christ. The mustard seed You sowed, Indeed it is so small, Now has grown large. This tree is growing bigger still. For You we wait, sustain us Lord"
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 453",
    "verses":[
      "Angels of, the Lord Almighty, Sow God’s seeds, in God’s own time, Faithfully, they share the Gospel, Bearing Jesus’ Name in all, Serving us, protecting us from evil, That we shall be fruitful in the work of God. ",
      "Labor on, you Saints of Jesus, Heavy burdens, you may bear. Tears of sorrow, pains encounter, Such the lot of Saints of God, Joyful times, awaits God’s suffering servants, Joy eternal soon shall come, in place of pain. ",
      "Peace eternal, God has promised, Peace, that none can understand. We must trust, the Words of Jesus, Words of truth that shall not fail, That we soon shall have eternal blessings, Living waters we shall have from God in Heav’n. ",
      "Bless O Lord, the Gospel servants, That You sent from lands afar. Through these servants You have blessed us, With Christ’s Gospel everywhere, Grant that they may have eternal blessings, Grant them everlasting joy before Your Throne. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 454",
    "verses":[
      "Lord Jesus calls us all His servants here, Send them to preach His Word to all. That they may preach with power from You, O God Lord teach, prepare Your servants now. Renew these that You have called now Lord, Lord, be with these ones in all they do, Protect them Lord and be with them, O, Dear Father; Lord, bless us all. ",
      "Lord Jesus, pour Your Holy Spirit now, Upon the seed they sow in life. Grant that the work they do may prosper, That Lord Your Church may grow in grace. Grant that their lives may be example, That, others may see and follow suit, That they may follow You in life And death here now: Grant us courage. ",
      "The sheep You Lord have now committed, Help them protect and keep for You. That none may go astray from the flock, May they be with them where they are. And when they plough the fields and sow seeds, Grant Your Word sown be the seed of life, Much fruit shall bear from the seed of The Word we sow: Much fruit harvest. ",
      "The Blood You shed to save us from sin, Grant us to benefit from this. We all have died in You, Christ Jesus, In baptism we are Yours Lord. The Father gave us all to you Lord, That we may all be among His Saints, With joy we look to you Jesus O Lord our God: We glorify. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 455",
    "verses":[
      "Ye servants of the Lord, Each in his office wait, Observant of His heavenly Word, And watchful at His gate. ",
      "Let all your lamps be bright, And trim the golden flame, Gird up your loins, as in His sight, For awful is His Name. ",
      "Watch: ’tis your Lord’s command, And while we speak He’s near; Mark the first signal of His hand, And ready all appear. ",
      "O happy servant he, In such a posture found! He shall His Lord with rapture see, And be with honor crowned. ",
      "Christ shall the banquet spread With His own royal hand, And raise that faithful servant’s head Amid the angelic band. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 456",
    "verses":[
      "Master, speak! Thy servant heareth, Waiting for Thy gracious word, Longing for Thy voice that cheereth; Master! let it now be heard. I am listening, Lord, for Thee: What hast Thou to say to me? ",
      "Speak to me by name, O Master, Let me know it is to me; Speak, that I may follow faster, With a step more firm and free, Where the Shepherd leads the flock, In the shadow of the rock. ",
      "Master, speak! Though least and lowest, Let me not unheard depart; Master, speak! For O, Thou knowest All the yearning of my heart, Knowest all its truest need: Speak! and make me blest indeed. ",
      "Master, speak! and make me ready, When Thy voice is truly heard, With obedience glad and steady Still to follow every word. I am listening, Lord, for Thee: Master, speak! O, speak to me! "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 457",
    "verses":[
      "Ye servants of the Lord, Each in his office wait, Observant of His heavenly Word, And watchful at His gate. ",
      "Let all your lamps be bright, And trim the golden flame, Gird up your loins, as in His sight, For awful is His Name. ",
      "Watch: ’tis your Lord’s command, And while we speak He’s near; Mark the first signal of His hand, And ready all appear. ",
      "O happy servant he, In such a posture found! He shall His Lord with rapture see, And be with honor crowned. ",
      "Christ shall the banquet spread With His own royal hand, And raise that faithful servant’s head Amid the angelic band. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 458",
    "verses":[
      "Christ is made the sure foundation, Christ the Head and Cornerstone, Chosen of the Lord, and precious, Binding all the Church in one; Holy Zion’s help for ever, Be our confidence, dear Lord. ",
      "To this temple where we call You Come, O Lord of hosts and stay; Come, with all Your loving kindness, Hear your people as they pray; And Your fullest benediction, Shed within these walls today. ",
      "GRANT, WE PRAY FOR ALL THE FAITHFUL ALL THE GIFTS THEY ASK TO GAIN; WHAT THEY GAIN FROM YOU FOREVER WITH THE BLESSED TO RETAIN; AND HEREAFTER IN YOUR GLORY, EVERMORE WITH YOU TO REIGN. ",
      "PRAISE AND HONOR TO THE FATHER, PRAISE AND HONOR TO THE SON, PRAISE AND HONOR TO THE SPIRIT, EVER THREE AND EVER ONE: ONE IN MIGHT AND ONE IN GLORY WHILE UNENDING AGES RUN! "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 459",
    "verses":[
      "The earth is the Lord’s, all is His, Fullness of earth is His. The earth and those that dwell therein, Belong to God the Lord. ",
      "Lord You established, founded earth, Upon the seas founded. You so established this earth well, On rivers established. ",
      "Who shall ascend the hill of God? And who shall also stand? Who shall stand in His Holy place? Who is worthy of Him? ",
      "He who has clean hands in the Lord, And all who have pure hearts. Those who that live not in falsehood, Deceitfully not swear. ",
      "He shall receive blessings from God, The Lord Himself shall bless. He shall be vindicated here, He shall be saved by God. ",
      "Generation that pleases God, It seeks the Lord its God. It seeks the face of God the Lord, The God of Jacob, seeks. ",
      "Lift up your heads, O you gates now, Be lifted up you gates. The ancient doors open for God, Open you doors for Him ",
      "The King of Glory now comes in, Open all doors for Him. Who is this King that comes to us? Who is He that enters? ",
      "He is the Lord strong and mighty, Strong is the Lord our God. The Lord so mighty in battle, The Lord our God is He. ",
      "He is the Lord of Hosts, our God, The King of Glory is. The Lord of Host our God He is, Open the door for Him. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 460",
    "verses":[
      "Lovely is Thy dwelling, Lovely is your place. Lord of Hosts, I love your dwelling, My soul longs and faints for you. For Thy courts, I long Lord, My heart had been waiting to be with you. ",
      "With my heart and with flesh, I sing praise to God. Even sparrows long to find place, In your courts to prepare nests, There they lay their young ones, Sparrows find a place at Thy altars Lord. ",
      "Blessed are the people, All that, trust the Lord. They have strength in Thee the Lord God, With hearts set on Zion’s way. As they go through valleys, They make them a spring of life with blessings. ",
      "Lord our God, Lord of Host, Hear our humble prayer, Give ear to the prayer we offer, God of Jacob, hear us pray. Our shield is Jehovah; Look upon the face of Your anointed. ",
      "For a day in Thy Courts, Better than thousands. I would rather be a keeper, Keep the gates at your House Lord. Save me from the wicked, Set me far from tents of wicked men here. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 461",
    "verses":[
      "Lord Jesus You came down, From Father’s bosom came here. You came to dwell with us, God’s way and love to show us. In all that You spoke here, And in the works You did, We magnify Your name, We worship You our God. ",
      "All those You called and chose, They are Your people, Jesus. Keep them all safe on earth, Keep them in Your Truth, Jesus. Spirit, come dwell with us, Come fill our hearts with love, That we may utter praise, Praise to the Lord our God. ",
      "Bless Lord the Word proclaimed, Bless all the work we do here. Feed us with food we need, In green pastures Lord lead us. Seek all those that are lost, Lord heal those that are sick, Those that sleep, Lord, awake. Help those that are burdened. ",
      "False teaching Lord prevent, Protect Your people from such. Bless us with sound doctrine, Teach us the truth that blesses. The dangers and all traps, All that seek to destroy, Protect us from them all, Keep us in Your grace Lord. ",
      "Bring home all scattered sheep, Lord rescue and restore them. Keep safe those that are home, Strengthen and be with them all. Fulfill Your Word, O Lord, Bring safely all sheep home, And grant them hear Your voice, Give them eternal life. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 462",
    "verses":[
      "Blessed, merciful, Jehovah, Lord, my sin, You have forgiv’n. Now I’m filled with joy eternal, Now I’m satisfied in faith. O my soul, give thanks with praises, Great is God’s blessings we have. Merciful, He loved, redeemed me, Evil dungeon saved me from. ",
      "I no longer dread the judgment, For the Lord suffered for me. Precious Blood Christ Jesus has shed, My sin He has washed away. Debt I owe my Lord is heavy, So much more I cannot bear. But for Jesus Christ who saved me, Hell shall be my home always. ",
      "Wages due for sin is dreadful, Distress this has caused me much. None can stand God’s wrath and judgment, Poor sinners shudder, tremble. Mediator for sinners has come, Jesus Christ who pleads for us. Christ is moved by all my pleadings, Gracious, merciful has been. ",
      "No condemnation I dread now, Christ has set me free, has saved. I am now reconciled with God, Jesus has atoned for sin. I am filled with joy eternal, I shall praise and magnify. Merciful Father has saved me, I shall glorify His Name. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 463",
    "verses":[
      "The grace of God eternal is, His truth shall always stand. The heav’n and earth shall pass away, Forever is God’s Love. ",
      "God is not man like us on earth, There is no lie in Him. He is not flesh and blood like us, That He’ll repent of wrong. ",
      "He promised grace to us on earth, In this grace we now stand. We shall not doubt, we shall not fear, God always keeps His Word. ",
      "As God keeps promises He makes, I do believe in Him. My sin He shall forget ever, But give eternal life. ",
      "The grace of God is Jesus Christ, Lord we believe in You. In that great sacrifice for us, Our sin is forgiven. ",
      "My Savior You will keep me safe, I trust in You, O Lord. Help me to follow You, dear Lord, And not to forsake You. ",
      "I seek from You humility, Grant me Your meekness, Lord. For You exalt the humble ones, And You will honor me. ",
      "Lord help me do the right always, I must not stray from You. Grant grace for me to live for You, To please You always here. ",
      "I wait for that Great Day, O Lord, The Day I shall see You. I shall be with You ever more, Your grace always abides. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 464",
    "verses":[
      "I come to You, with humble plea, Forgive me Lord, my sin, I pray. I cannot cleanse my soul from sin, I cannot take away my sins. ",
      "Freedom I seek from You, O Lord, This also is grace from You Lord. I have Your grace and mercy now, In this, my sin is washed away. ",
      "I come to claim Your promise Lord, Jesus Christ stands in my place now. I trust in grace of Christ alone; Lord, hear my humble cry to You. ",
      "I now rely on Christ alone, On His grace I depend in life. I have salvation in His love, I shall praise God and give Him thanks. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 465",
    "verses":[
      "Our sin is now forgiven, Rejoice you sorrowful ones, Rejoice you are now free. Jesus the Lord has done this, In His Name we are saved now, God’s promise is fulfilled in Christ. ",
      "This Good News gives me great joy, This shows how much God loves me, His love for me is full. I have much grace from Jesus, With all my sin forgiven, By faith in Jesus, I am saved. ",
      "What I have sought in this life, What I need most of all things, Is forgiveness for sin. For those that die in sin here, They suffer death eternal, No forgiveness remains for them. ",
      "In this life we have God’s grace, We must seek blessings from Him, Escape from sin and death. Freedom from condemnation, We must seek now in this life, Believe in Jesus Christ the Lord. ",
      "Lord Jesus I desire You, Fill me with joy in this life, Fullness of joy, grant me. When I come to You praying, Spirit of God assure me, That God loves me in Jesus Christ. ",
      "When I must die and leave here, Grant me Your joy, as I leave. Your grace is sufficient. I have great hope in Jesus, I shall be raised on that Day, Therefore I shall die here in peace. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 466",
    "verses":[
      "Burdened souls that thirst and hunger, Laboring, wearied, pressed, distressed. There is news, come now and listen, Come and drink from that deep Well, Lay your burdens, rest from all your labors, Lay your burdens, and be satisfied with rest. ",
      "Who is He that seeks to bless you? Jesus Christ of God, is He. Christ the source of Living Waters, Living Spirit find in Him, Come now friend, come drink deep from the Savior, And your heart shall flow with living waters. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 467",
    "verses":[
      "Have mercy on me, O Lord Jesus, My sin is great I cannot bear. I am like Paul, a chief of sinners, Have mercy on me, O my God. Lord I was blind in unbelief, But now I have received Your grace",
      "Once I deserved God’s wrath and judgment, But Christ came to me, gave me life. He saved me from my sin, forgave me, He cleansed me with His precious Blood. Amazing grace, that God should love, Such pure love from the Lord our God. ",
      "Now I proclaim this news to others, Before all people, I declare. This life I have is from His mercy, I shall declare with all my heart. Before the Lord I bow and serve, Merciful Lord, I’ll praise Your Name. ",
      "I shall continue in His mercy, No one can take this grace from me. My boast in life is Christ my Savior, In Him I have grace upon grace. For this I pray, beseeching Christ, Grant me grace to proclaim Your love. ",
      "You are so rich and full of mercy, Take not your mercy from me, Lord. When death is near, draw me to Heaven, In Jesus’ death I have new life. Soon, I shall see my Lord at last, I shall sing of His grace and love. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 468",
    "verses":[
      "My righteousness garment and glory, Come from the Blood that Jesus shed. This I shall present before God, With this I’ll come before the Throne. ",
      "In Blood of Jesus, I shall boast, In this I have unending joy, By this I shall rejoice in death; His Blood has spoken; all is well. ",
      "The Lamb of God that once was slain, Died on the Cross at Calvary, For all my sin, He suffered death, Behold my Lord and God of Love. ",
      "When tempted in this flesh to sin, When Jesus and His death I see, Fresh courage I have to live now, For all such sin, Christ came to die. ",
      "My faith is rooted in Jesus, His promises are true and sure. No condemnation, now I dread, Eternal life, secured in Him. ",
      "Sufficient is the Blood of Christ, To pay for sin for all mankind, Sufficient for eternity, Eternal price, God paid for us. ",
      "No debt I owe before the King, No restitution I must make. Justified in the Cross of Christ, The Blood of Jesus is the price. ",
      "What shall I render to my God? I’ll give Him praises and all thanks. Living for Him in holiness, Be faithful to my Lord till death. ",
      "9When Jesus I shall see in Heav’n, I’ll join the Saints before the Throne, To laud and praise and worship God, And glorify the Lord my God. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 469",
    "verses":[
      "Salvation from sin, we have now, God gave from His own glory. No work of man can take away, The sin we have committed. By faith alone we have God’s gift, The grace that came in Jesus Christ, Jesus atoned for sinners. ",
      "In the Commandments of the Lord, No one can gain salvation. The great Commandments point to sin, Condemn and curse us, bring death. There is no strength in this frail flesh, We cannot keep the Law of God, In this we all are guilty. ",
      "It was not for our righteousness, God gave these great Commandments. The Lord God knows, none can please Him, There is none who is righteous. Against the Law, we see our sin, We see how wretched we all are. The Law condemns and kills us. ",
      "We have no power to save ourselves, The flesh is strong and lustful. The more we try to keep the Law, The more sin is magnified. Condemnation of God we face, No flesh can meet God’s standards here, We were all born as sinners. ",
      "If salvation is from the Law, We are condemned already. God knew this, so He sent His Son, A Savior, Jesus, God sent. In Him is righteousness of God, For Christ fulfilled the Law of God, We are all reconciled now. ",
      "Because Christ Jesus satisfied, What God expects of sinners. All those that trust in Jesus Christ, By faith, are counted righteous. Through Jesus’ death, we have new life, We now have new life in Jesus, Our substitute is Jesus. ",
      "I have no doubt, You are Savior, Your Word is Truth, I believe. There is no fear for sinners here, For Christ has died to save us. Those that believe in Jesus Christ, And are baptized In Him as Lord, They shall have life eternal. ",
      "Lord I now praise You and adore, I worship and give You thanks. Praise be to Father and the Son, Praise be to God the Spirit. As it was in the beginning, Is now and ever shall be then, Your Holy Name we adore. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 470",
    "verses":[
      "True freedom is found in God’s love, Grace of God for all sinners. Trust in Christ, the Lord and Savior, Christ that died to save mankind. ",
      "Freedom is in grace of Jesus, Grace of Jesus, removed curse. When He shed His Blood at Calv’ry, Christ atoned for sin for us. ",
      "Freedom is through faith in Jesus, Christ, who God gave to mankind. Have faith and believe in Jesus, God shall save you in His love. ",
      "Freedom is found in the Good News, Word of God that Jesus spoke. Come believe in God’s Truth only, In His Word you shall be saved. ",
      "Freedom in the Blood that Christ shed, Blood of Jesus removes sin. In Jesus we have forgiveness; Blood of Christ makes us all clean. ",
      "Therefore have faith in Christ Jesus, Believe in God’s only Son. God has cancelled all your sins now, You are now a child of God. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 471",
    "verses":[
      "Many are they that know not Christ, Have not the Holy Ghost. But those that are God’s children now, Have grace and life in Christ. ",
      "They see Christ Jesus crucified, They see Him on the Cross. They see the Blood He shed for them, But have no peace in Him. ",
      "Our Jesus is the Son of God, Our Savior Jesus Christ. He saved us from sin and evil, He brought us back to God. ",
      "We are not wise, ignorant are, The Father we know not. In Christ alone, the truth we have, Wisdom abounds in Him. ",
      "We are all sinners, none is right, We face the wrath of God. But Jesus shed His precious Blood, He is our Righteousness. ",
      "Unrighteous, cruel beings, we are, There is no hope for us, Our righteousness, is Jesus Christ, In Him we all are clean. ",
      "The Lord Jesus shall come again, With pomp and glory come. Shall come back as the judge of men, He’ll be the judge of all. ",
      "Lord Jesus help me trust in You, Help me to follow You. That I may not enter God’s wrath, But share your joy above. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 471",
    "verses":[
      "Many are they that know not Christ, Have not the Holy Ghost. But those that are God’s children now, Have grace and life in Christ. ",
      "They see Christ Jesus crucified, They see Him on the Cross. They see the Blood He shed for them, But have no peace in Him. ",
      "Our Jesus is the Son of God, Our Savior Jesus Christ. He saved us from sin and evil, He brought us back to God. ",
      "We are not wise, ignorant are, The Father we know not. In Christ alone, the truth we have, Wisdom abounds in Him. ",
      "We are all sinners, none is right, We face the wrath of God. But Jesus shed His precious Blood, He is our Righteousness. ",
      "Unrighteous, cruel beings, we are, There is no hope for us, Our righteousness, is Jesus Christ, In Him we all are clean. ",
      "The Lord Jesus shall come again, With pomp and glory come. Shall come back as the judge of men, He’ll be the judge of all. ",
      "Lord Jesus help me trust in You, Help me to follow You. That I may not enter God’s wrath, But share your joy above. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 473",
    "verses":[
      "What blessed life we have in God, If Christ is ours and we are His, In truth, we are united. If Jesus is our Lord and God, You have His glorious life in you, ",
      "You have all blessings in Him. God shall, bless those, Who shall give their lives to Jesus, Have faith in Christ. They are blessed, that trust in Jesus. ",
      "The glamour of this world we see, Many are those that seek such life, Have pleasure in such vain life. They feed but are not satisfied, They drink but none can quench their thirst, ",
      "A vain life, all they have here. Troubles, distress, Disappointments, bondage to sin, All is wretched. Death eternal waits all such men. ",
      "In Jesus Christ, a different life, A life of fellowship so sweet, In Jesus, we have new life. He gives us peace and joy in life, In Christ’s Church we have family, ",
      "We have brothers and sisters. Love, joy, goodness, Faithfulness and peace and patience, Forgiveness, have. Light of God we have in this life. ",
      "Christ calls you all that are distressed, The poor and troubled souls, He calls, Come to the Savior Jesus. Christ came to save the poor and lost, All those depressed without a hope, ",
      "He bore their sins and burdens. Come now, Christ calls, Come to Him with gladness and hope, Come to Jesus. There is great peace in Christ Jesus. ",
      "From now I yield my life to Christ, I shall not trust in man’s wisdom, I shall not live for this world. The God I’ve sinned so much against, ",
      "Is God who loves and has saved me, I shall have peace in Jesus. Take my, life now, From this day I yield all to you, Make me yours now. Let me serve You only, Jesus. ",
      "Lord save me from my pride and all, And pour Your life into my life, That I may have divine strength. Fill all my life with Your Spirit, That I may stand against the foe, ",
      "Victorious to be in life. When that Day comes, May I stand before Your Throne Lord, Filled with all joy. I shall be with You forever. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 474",
    "verses":[
      "True faith is living faith in God, In God Jehovah, faith found. Faith is not what we say in words, Faith is in heart and soul, mind. Faith has its roots in God alone, Its foundation is Jesus Christ, None can debate faith in God. ",
      "Those that yield heart and soul to God, They have their trust in Jesus. They hold to Jesus Christ the Lord, He is their righteousness now. They have true faith, a living faith, Faith that is fixed above in Heav’n, Not even death can shake it. ",
      "Be not deceived, boasting in faith, When you have love for evil. You cannot claim faith in the Lord, When you dishonor Jesus. Such faith is fake, an empty faith, Such faith is dead, a useless faith, It is not faith in Jesus. ",
      "No one can have faith in the Lord, Unless the Lord Himself grants. Faith is a precious gift from God, Pray for this gift from Jesus. Pray that God shall increase your faith, And strengthen you to bear much fruit, Good works to show in all life. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 475",
    "verses":[
      "Thou art the Way; to Thee alone From sin and death we flee; And he who would the Father seek, Must seek Him, Lord, by Thee. ",
      "Thou art the Truth; Thy Word alone, True wisdom can impart. Thou only canst inform the mind, And purify the heart. ",
      "Thou art the Life; the rending tomb, Proclaims Thy conquering arm. And those who put their trust in Thee, Nor death nor hell shall harm. ",
      "Thou art the Way, the Truth, the Life, Grant us that Way to know. That Truth to keep that Life to win, Whose joys eternal flow. Amen. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 476",
    "verses":[
      "A glorious refuge now we have, In Christ who saved my soul. You healed me and restored my sight, And now Lord, I can see. ",
      "Your glory comforts me in life, Great joy I have in You. When I believed in Jesus Christ, Great glory now I see. ",
      "In You, I now have light to see, All fear is gone from me. Your glory brought me to this world. The same shall bring me Home. ",
      "Good promises I have in Christ, In this I hope and long, My heritage is Christ the Lord, I shall have Christ at last. ",
      "When flesh and strength all fade away, And death comes close to me. Eternal life, Christ gives to me, His glory I shall see. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 477",
    "verses":[
      "A glorious refuge now we have, In Christ who saved my soul. You healed me and restored my sight, And now Lord, I can see. ",
      "Your glory comforts me in life, Great joy I have in You. When I believed in Jesus Christ, Great glory now I see. ",
      "In You, I now have light to see, All fear is gone from me. Your glory brought me to this world. The same shall bring me Home. ",
      "Good promises I have in Christ, In this I hope and long, My heritage is Christ the Lord, I shall have Christ at last. ",
      "When flesh and strength all fade away, And death comes close to me. Eternal life, Christ gives to me, His glory I shall see. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 478",
    "verses":[
      "Faith is assurance of things hoped for. Belief in what is yet to come. It is conviction of things not seen, Believes all things and hopes in all. By faith in God, all saints have travelled, By faith the men of old did walk, By faith they looked to things in Heaven, By faith they looked for Home above. ",
      "By faith we understand creation, That God made all things by His Word. We see the Saints of old like Abel, Like Seth, Enoch, Noah, Abram. We see the life of faith of others, We see Isaac, Jacob and all. Great faith they had such men of courage, God counted this as righteousness. ",
      "See Moses, Gideon and king David, We see Elijah, the prophets. They were all men of great faith in God, Wonderful things they did by faith. They conquered great kings of the nations, They ruled with justice, righteousness, God’s promise they beheld, from distance, The things of earth, they treasured not. ",
      "By faith men, women bore great suffering, They were tortured, suffered and died. By faith they overcame temptations, They did not compromise their stand. They suffered mocking and affliction, Some others were sawn into death. This world was not worthy for all such, This is the measure of great faith. ",
      "All these believed the Promise given, But they saw not Christ, Messiah. They patiently waited for Jesus, They long expected Christ their Lord. Now Christ has come, we see His glory, He is the only Son of God. Great blessings we have, seeing Jesus, What all expected, now we see. ",
      "God grant us grace for faith in Jesus, Grant us to see our grievous sins. Grant justification in Jesus, Grant us eternal life and hope. Grant us the grace to see Christ’s glory, Deepen our faith for hope in Him. When we see Jesus and His glory, Faith shall come to an end for us. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":   "PHB 479",
    "verses":   [
      "Faith is great and conquers all things, It is founded in the Lord. Works of faith bear priceless treasures, Great treasures they are than gold. If you have great faith in Jesus, There is nothing you can’t do. Faith fears not the powers of darkness, It regards them nothing worth. ",
      "Long before Christ Jesus was born, And His works had not been seen. Long before the powerful angels, Saw the birth of Jesus Christ. Many men and women had hoped, For the promise God had made. They did great things, showing great faith, Greater faith expected now. ",
      "By the grace we have in Jesus, Let us fight the fight of faith. By faith, we overcome all things, Overcome Satan and foes. Saints of old that lived for Jesus, Demonstrated such great faith, Let us show same faith in Jesus, Let us live by faith always. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 480",
    "verses":[
      "My faith in Christ, now I declare to all men, My faith now rests in the Lord of Host. Firmly I trust in Jesus now and ever, Why should I turn to idols on earth. There is no savior for this world to find, Salvation is in the Lord Jesus Christ, Hallelujah, Hallelujah. ",
      "My faith in Christ, now I declare to all men, Let all men know my faith in Jesus. For Christ alone has dealt with sin and saved me, Fullness of Life in Him I now have. To Him alone I surrender my life, On Him I shall depend now and ever. Hallelujah, Hallelujah. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 481",
    "verses":[
      "Everlasting, Priest and Savior, You are Lamb of God for me. Living sacrifice I offer, I shall praise You with my life. ",
      "There is no love we can offer, Save the Love from You, our Lord. Only through You we can offer, Sacrifice pleasing to God. ",
      "Cleanse my sin Lord, purify me, Cleanse my heart and mind and all. Break my heart and tear all idols, These have now caused me great pain. ",
      "Break me, burn me, melt and mould me, Make me new, a child of Yours. Change completely this poor nature, Take the old being all away. ",
      "In this new life, I can offer, Sacrifice acceptable. Pleasing sacrifices offer, To You Lord in all my life. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 482",
    "verses":[
      "As the deer longs for streams, Flowing streams of water, Satisfy its thirst. So my soul longs for Thee, For the living God, longs, God’s face I must see. I behold You in Jesus, You have come to save the weary, I desire You, Father. ",
      "I have nothing in life, Nothing I desire here, Nothing have in Heav’n. Life eternal and peace, Everlasting joy too, I cannot obtain. Jesus You have loved mankind, You have saved us and have purchased, You we need in Heaven. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 483",
    "verses":[
      "Songs we must sing for Jesus, we must, Joyfully we must join to sing now. We are His children, He is our Lord, Christ is our Head and Christ Lord of all. ",
      "Savior that loves us we must praise His name, We all love Jesus we give Him thanks. From Satan He has rescued us all, Christ is our Head and Christ Lord of all. ",
      "We trust in Jesus we are safe in Him, His Word is Truth and shall be ever. If you believe in Christ, you will live, Christ is our Head and Christ Lord of all. ",
      "Let everyone now come to Christ the Lord, Come now receive from Him His blessings. Freely we have, freely He gives us. Christ is our Head and Christ Lord of all. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 484",
    "verses":[
      "Jesus our comforter and joy, You are the source of Life and Light. Nothing on earth shall satisfy, We hunger Lord, unless You feed. ",
      "Your Truth, O Lord, shall always stand, All those that come to You are saved. Lord You are good to those that seek, You welcome all who seek and trust. ",
      "The Bread of Life, on You we feed, We long to have this Food always. Thou Fount of Life, from You we drink, You satisfy our thirst in life. ",
      "We long for You, expectantly, We long for You to be with us. We long to see Your face, O Christ, When we are with You, blessings have. ",
      "Lord Jesus be so close to us, Grant us Your peace in life always. Cast out the darkness from our lives, Light Holy from you, fill our lives. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 485",
    "verses":[
      "Jesus I shall never leave, I shall cling to Him forever. Jesus I must always trust, He laid down His life to save me. Jesus source of all my life, I must trust and cling to Him. ",
      "My soul longs for nothing here, Nothing I desire in this life. Jesus only and His Blood, Saved me and had paid all wages. He has saved my soul from hell, Therefore I shall cling to Him. ",
      "Jesus I shall never leave, I shall always stand close to Him. Jesus guide me, all my life, Lead me to the living waters. Blessed is the one, who says, Jesus Christ, I shall not leave. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 486",
    "verses":[
      "One thing I desire to have in my life, It is the food for my soul. In the day or in the night or morning, One thing only satisfies. This is Jesus Christ, who suffered for me, How He labored hard, faced death with courage. In Gethsemane gardens, Where His sweat became like blood. ",
      "Jesus shall stand for me now and ever, Great witness is Cross He bore. On the cross my Savior died for sinners, For my sin He suffered here. Redeemed me, He saved my soul on this cross, Blood required: He gave His Blood to save me. He looked at me and He said, “It is finished”, all is done. ",
      "Help me, Lord not to forget this great love, The great price You paid for me. When I was lost in darkness in this world, You sought me in great patience. Good Shepherd, You sought this lost sheep always, Long before You heard the cry for mercy. Now I see the great price paid, Price You paid to save us all. ",
      "Jesus You are mine now and forever, All shall say Amen, be it. You are Star that shines for me in my life, I shall need no other light. I shall live and die in You my Jesus, Now I seek to live for You my Jesus. I shall live to please You Lord, I shall sing, Hallelujah. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 487",
    "verses":[
      "We soon shall see Your love and blessings, We shall behold how deep Your love. I know You are with me in troubles, The ones You love, You care so much for, You keep them humble first in life. ",
      "The night is past, Your love I see now, Your joy now comforts me, O God. Already Heaven is with me here, Your love is great, and full and lasting, Such love I see in Jesus the Christ. ",
      "This world shall be great enemy now, Its treasures I shall now forsake. The stores of earth shall bring provisions, Grant me not place hope in such things. ",
      "In You alone I have great pleasure, You are my heart’s desire, Lord always. I’ll trust in You, there is none else. This world cannot destroy me ever, Come, stormy seas and winds and anguish, Lord, You shall bear me through all these. ",
      "When Sinai’s thunder, fire alarms me, And curses of the Law frighten. When threats of death scare and alarm me. I shall remember Golgotha. I shall look at the Cross of Jesus, ",
      "There I shall know that Jesus saved me. No thunder, lightening, fire can harm. Let men rise up against Your servant, No condemnation they can bring me. Secure I’ll be in You, O my Lord. ",
      "When You are with me in my troubles, I can pass through the wilderness. The cloud shall guide me and shall comfort, The Rock shall be my source of strength. Your wondrous ways shall end in glory, ",
      "We soon shall see Your love and blessings, We shall behold how deep Your love. I know You are with me in troubles, The ones You love, You care so much for, You keep them humble first in life. ",
      "Death is so frightening, people fear it, But in You I have no such fear. My life is hid in Christ my Savior, My life is safe in Jesus Christ. Let others live in fear of judgment, ",
      "I shall not fear the path I travel. For all shall end well for the Saints. With joy I shall thread through the darkness, From darkness I shall soon see Morning, And I shall dwell in peace always. ",
      "Christ Jesus, You my friend and treasure, I have great joy in You always. The sufferings of this world are nothing, Not death can frighten me from You. The joy and peace I taste in this life, ",
      "Be taste of Manna You will give me, Great blessings wait for those in You. I have no pleasure in earth’s treasures, In Christ alone I have all pleasure, Jesus is sufficient for me. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 488",
    "verses":[
      "Thee will I love, my strength forever; Thee will I love, Thou art my grace! Thee will I love in all my endeavor, Thro’ all temptations which I face, Thee will I love, my light Thou art, Till breaks my yearning heart. ",
      "Ah, that so late I got to know Thee, Exalted, wondrous beauty, Thou! That I not sooner did confess Thee, And found Thy true rest only now, This is my deep regret and grief, So late I found relief. ",
      "I ran astray in deep confusion, I searched but no where could Thee sight, I turned from Thee in my delusion, And loved the garish worldly light! But now through Thee it’s been achieved, Thy love I have perceived. ",
      "I give Thee thanks, Thou true Sun given, That light to me Thy splendor brought. I give Thee thanks, Thou bliss from Heaven! Who for me joy and freedom wrought, I give Thee thanks, O word so pure, That Thou my ills doth cure. ",
      "Thee will I love, my crown O Thou art, Thee will I love, my Lord my God. Thee will I love with all my heart, In times of joy or painful lot, Thee will I love, my crown Thou art, Till breaks my yearning heart. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 489",
    "verses":[
      "The King of Love my Shepherd is, Whose goodness faileth never; I nothing lack if I am His, And He is mine forever. ",
      "Where streams of living water flow, My ransomed soul He leadeth; And where the verdant pastures grow, With food celestial feedeth. ",
      "Perverse and foolish oft I strayed; But yet in love He sought me, And on His shoulder gently laid, And Home rejoicing brought me ",
      "In death’s dark vale I fear no ill, With Thee, dear Lord beside me, Thy rod and staff my comfort still, Thy Cross before to guide me. ",
      "Thou spread’st a table in my sight, Thy unction grace bestoweth; And O what transport of delight, From Thy pure chalice floweth! ",
      "And so through all the length of days, Thy goodness faileth never; Good Shepherd may I sing Thy praise, Within Thy House forever! "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 490",
    "verses":[
      "Jesus only I have chosen, No other name that I know. He is all my Life and my Light, Jesus Christ my joy and praise. Therefore Jesus I seek now, Only trust. Jesus come for me, come now, Come for me. You alone I now desire. ",
      "Jesus only I have chosen, Wages of sin, He has paid. Light of Jesus too is my life, In this my death shall be sweet. Therefore Jesus I seek now, Only trust. Jesus come for me, come now, Come for me. You alone I now desire. ",
      "Jesus only I have chosen, He is beautiful, glorious. Jesus, one who loves so dearly, Jesus I shall always seek. Therefore Jesus I seek now, Only trust. Jesus come for me, come now, Come for me. You alone I now desire. ",
      "Jesus only I have chosen, Distress in life, come what may. To Him I shall turn for succor, Even in death, He’ll support. Therefore Jesus I seek now, Only trust. Jesus come for me, come now, Come for me. You alone I now desire. ",
      "Jesus only I have chosen, Jesus is my heart’s desire. To Him I shall yield all my life, To Him alone I belong. Therefore Jesus I seek now, Only trust. Jesus come for me, come now, Come for me. You alone I now desire. ",
      "Jesus only I have chosen, In death I shall come to Him. Make me one of Your saints, Jesus, Let me be among the saints. Therefore Jesus I seek now, Only trust. Jesus come for me, come now, Come for me. You alone I now desire. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 491",
    "verses":[
      "Love of God is priceless treasure, When shall this heart of mine seek You, Be filled with this love. I seek Lord now, to show Your love, Love so great that saved us all here, Jesus Christ my Savior’s Love. ",
      "O wondrous love that transcends death, No one can fathom such great love, Angels can never know. So deep such love, wondrous story. Love beyond the hosts of Heaven, Love beyond all depths and heights. ",
      "Love is found in God the Father, Freely God has poured upon us, Love we don’t deserve. I have wept much, I have sought this, Pleading always for God’s kind Love, Best gift from You Lord I seek. ",
      "How I seek to be with Jesus, Be with You my Jesus always, You only I need. All I seek now, all my joy here, Grant my soul to hear Your sweet voice, Bridegroom let me hear Your voice. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 492",
    "verses":[
      "Who is He, in yonder cot Bending to His toilsome lot? ",
      "Refrain: ‘Tis the Lord, O wondrous story! ‘Tis the Lord, the King of Glory; At His feet, we humbly fall, Crown Him, crown Him Lord of all! ",
      "Who is He, in yonder cot Bending to His toilsome lot? ",
      "Who is He, that John baptized, In the Jordan was baptized? ",
      "Who is He, in deep distress, Fasting in the wilderness? ",
      "Who is He, who calls men here, Fishermen He called to serve? ",
      "Who is He, to whom they bring Children and He blesses all? ",
      "Who is He, the people bless, For His words of gentleness? ",
      "Who is He to whom they bring, All the sick and sorrowing? ",
      "Who is He that stands and weeps At the grave where Lazarus sleeps? ",
      "Who is He who at the tomb Raised Lazarus from the dead? ",
      "Who is He the gathering throng, Greet with Loud triumphant song? ",
      "Who is He that drives away, Those that sell in God’s own House. ",
      "Who is He who eats with men, In the upper room He dined? ",
      "Who is He who washes feet, Feet of those that follow Him? ",
      "Lo, at midnight who is He, Praying in Gethsemane? ",
      "Who is He betrayed by friend, In the garden, is betrayed. ",
      "Who is He the leaders judged, Is condemned, accused of wrong. ",
      "Who is He in Calvary’s throes Asking blessings on His foes? ",
      "Who is He on yonder tree Dies in grief and agony? ",
      "Who is He that from the grave Comes to heal and help and save? ",
      "Who is He that from His throne Rules the world of light alone? ",
      "Who is He who comes again, Judge of angels and of men? "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 493",
    "verses":[
      "Jesus, You I love, Lord in You I trust. I commit to You my whole life, Give heart, soul and mind and body. Gracious, Savior, Lord, I am always yours. ",
      "Lord I give You thanks, Let me praise You, Lord. Let me walk before You always, Grant me grace to keep Your Word, Lord. From evil save me, Cleanse my heart from sin. ",
      "Lord, help me, I pray, Let me follow You. Grant me Lord Your peace and patience, Make me meek and humble servant. Anger put away, Remove pride from me. ",
      "When I’m tempted, Lord, Save me from all wrong. Let not vain things overtake me, Give me wisdom to pursue right. When I yield to sin, Help me to repent. ",
      "Strengthen me, O Lord, Keep me always still. Help me to plead for forgiveness, Plead for mercy from the Father. Like our children do, Lord I seek Your grace. ",
      "Holy Spirit come, Be in me always. Like a child, receive and help me, Jesus, help me follow closely, Come to You that Day, Give me joy of Heaven. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 494",
    "verses":[
      "Where is Jesus, my beloved? Where is my best friend who loves? My beloved, I long for You, I shall run and search for You. ",
      "My heart loves and seeks for Jesus, Come my Lord and cleanse my sin. Where is Jesus, whom I love much? Always I shall search for Him. ",
      "Here I cry much in my struggles, Where would I find Jesus Christ? I shall seek Him, till I find Him, I shall have joy in His sight. ",
      "O that I have wings to fly now, I need wings to fly to Christ. For I seek to be with Jesus, My heart longs for Him alone. ",
      "Jesus grant me to behold You, I am waiting anxiously. Let me dwell no longer in sin, Let me see Your Holy face. ",
      "You are fount of life for me, Lord, When I see You Jesus Christ, I shall give up filthy living, Give up what You hate, O Lord. ",
      "Let my life grieve You no longer, Let me no more give You pain. Let me love You, with my whole heart, Love You with all mind and strength. ",
      "Give me peace, Lord I desire this, I have peace when You are near. Gracious Jesus, come live in me, Always bless me with Your life. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 495",
    "verses":[
      "The Light for revelation shines, The Truth that shines for all Gentiles, That glorious Light is Jesus. The Root of Jacob and David, My God and King, the One I love, You seek my heart to dwell in. You are, gracious, You are lovely, rich in mercy, God Almighty. You are worthy of all glory. ",
      "Our heart’s desire, our soul’s treasure, Is Jesus Christ, Son of Mary, Our King You came from Heaven. Grant me to seek you with my heart, Seek to be blessed with Word from You, Your Word is Spirit, blessesFountain, of Life, Grant me to drink, feed with Manna, life so sweet give. Give me grace to taste Your life Lord. ",
      "Lord Jesus, give me love of God, Divine love, pour into my heart, Grant love from You flow through me. Lord comfort me with Your presence, Make me to dwell in You, Jesus, Come dwell in me Lord Jesus. You Lord, I seek, I desire You, Lord I seek You, long for Jesus. Fill me with Your Love, dear Jesus. ",
      "The glorious Light of God I’ll see, I long for this with all my heart, I long to see God’s glory. Christ Jesus You are my treasure, Your Word and Spirit and Your Food, Will satisfy me ever. I plead, with You, Look upon me, in Thy mercy, when I draw near, Seeking treasures in Your Word, Lord. ",
      "Jehovah, Father, Lord and God You loved me in the Lord Jesus, Before creation, loved me. Christ Jesus called me back to You, I am His Bride, He loves me much, A part of Jesus, I am. Blessings, of peace, Blessings of God, joy, life, honor, with His glory. I shall praise my Lord forever. ",
      "Sing to the Lord with shouts and claps, With hymns and psalms, praise God on High, Loud, sing to praise the Lord God. Come and rejoice in Christ our Lord, Our Bridegroom ready for us all, Come ready to be with Him. Rejoice, worship, Praise Christ Jesus, worship, adore and give glory. Lift Him High, praise Him forever. ",
      "My heart is glad and satisfied, Alpha, Omega blessings, have, I have eternal blessings. When Jesus Christ appears again, He shall bring me into Eden, With clapping, I shall praise Him. Amen! Amen, Come, Lord Jesus, come now quickly, come with blessings, I long for You, come, Lord Jesus. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 496",
    "verses":[
      "There is none in this life before Christ, There is none in this life after Him. His Name is wonderful. He is the mighty God. Today He is, He is the Lord. Thanksgiving and worship we give to You, We give thanks to your Name. ",
      "In Christ Jesus death is not painful, In you Lord we have fought sin and death. The Lord strong in battle, Our hope is in Jesus. We look to you, Come help us Lord. You are behind us Christ the conqueror. You are victorious Lord. ",
      "Jesus Christ is our Lord Father’s Son, Intercessor who we appreciate. Jesus speak for your child, Wretched I’m before you. Your love only, Grace only, Lord. I shall praise Thee and magnify Thy Name, Worship you ever more. ",
      "Jesus Christ, from the Father is King, King of the heavens and of the earth. You are the Mighty God, You have riches, honor. With majesty, We worship you. We shall praise you and glorify your Name. We glorify your Name. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 497",
    "verses":[
      "What is there Christ has done for me? From Heaven’s Canaan He came. Suffered for me and died for me, That I might have, life above. A crown of life, awaits for us For all those that believe Him. ",
      "A crown He’ll give, to all His Saints, He’ll give to all of His friends. Canaan, land, Canaan, Who would love to be in Canaan? Canaan Land of great delight, I seek now to be there above. ",
      "I’ve made my mind I’ll soon leave here, To Zion now, I must go. I shall be found among God’s Saints, I shall sing to praise my God. When this life ends and sufferings cease, In Zion’s City I’ll be. ",
      "I shall be, satisfied, And have great peace with my Lord. Zion, Home, Zion, Who would love to be in Zion? Zion Land of great delight, I seek now to be there above. ",
      "Who is seeking eternal life? Heaven he seeks to be there? Follow the Lord Jesus the Christ, He’ll take you all safely there. There we shall see Jesus the Christ, See Him as King in Heaven. ",
      "He’ll bless us all His Saints above, He will give us all, Rest above. Jesus, Lord Jesus, Who would seek the Lord Jesus Christ? Jesus the Savior Lord God, Come let us worship Jesus Christ. ",
      "You a sinner, seeking pardon, And You have come for new life. You are the one Christ calls today, Eternal life He will give. All that, believe in Christ the Lord, And trust Him as their Savior, ",
      "All those that seek the peace He gives, Christ blesses all that seek Him. Jesus, Lord Jesus, Who would seek the Lord Jesus Christ? Jesus the Savior Lord God, Come let us worship Jesus Christ. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 498",
    "verses":[
      "Precious is your Name Lord Jesus, It is music in my ears. Spread the praise of Jesus always, Spread on earth and in the heavens. ",
      "You are precious, priceless treasure, In You I have all good things. Riches of this world are nothing, Wealth is like the dust of earth. ",
      "In Your Name I have salvation, You saved me from all my sin. From all evil and all troubles, From Satan and hell You saved. ",
      "Bless me in Your Name Christ Jesus, Fragrant Lord, Your Name to me. Heal me in this Name so precious, Make me clean in Your Name, Lord. ",
      "Glorify Your Name O Jesus, I shall glorify You, Lord. And when life shall end for me here, I shall sing to praise Your Name. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name":"PHB 499",
    "verses":[
      "My loving Savior, He is Lord of all my life, Jesus the Son of Mary is. You only I’ll love, I’ll glorify You, You are my heart’s desire, dear Lord. ",
      "The sun has splendor, See how brightly shines its light, More brightly than stars we see. Jesus surpasses, His glory excels, Christ’s beauty, nothing can compare. ",
      "Angels are with God, Faces shine so bright as light, Christ’s beauty is more than all, Christ is Lord of all, Jesus, my Savior, I have no true love, but You Lord. "
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  }

