
  {
    "name": "PHB 600",
    "verses": [
      "If I may be so fluent, Or speak with angel’s tongue. But have no love for people, I am a noisy gong. I am a clanging cymbal, That has no life itself. My labor all in this life, Is vain and nothing much.",
      " If I can prophesy here, Have great prophetic powers. All mysteries understand here.  Knowledge from Heav’n I have If I have great faith on earth, And can move mountains here. But lack true love for others, I am nothing in life.",
      "If I give all I have here, Give to the poor my life. If I give up this body, And it is even burned.But have not love for others, I gain nothing in life. Love is the most important, Love is what I must give. ",
      "Love is shown by our patience Love shows in kindness too. It is not jealous, boastful, It is not rude in life. Love also not arrogant, It seeks not its own way. Irritable, love is not, Resentful, it is not.",
      "Love seeks no wrong for others, Nor would rejoice in wrong.Love would rejoice in right things, And bear all things in life. Love would believe all things here, Has hope in all things here. Love would endure all sufferings, Endure all things that come. ",
      "Love will last and would not end, All other things shall end. Prophecies, knowledge, great tongues, They all shall have an end. Our knowledge is imperfect, Imperfect, prophecies; Love is the life so perfect, The imperfect shall pass.",
      " Lord, fill my heart with love now, Fill me with all Your love. For I have none in my heart, Self-love is what I have. I need Your love, Lord Jesus, Fill all my heart with love. That I may live to please You, Please You here and above."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PHB 601",
    "verses": [
      " O God of mercy, God of might, In love and pity infinite, Teach us, as ever in Thy sight, To live our life to Thee.",
      " And Thou, who cam’st on earth to die That fallen man might live thereby, O hear us, for to Thee we cry, In hope, O Lord, to Thee.",
      "Teach us the lesson thou hast taught, To feel for those Thy blood hath bought, That every word and deed and thought May work a work for Thee.",
      "For all are brethren, far and wide, Since thou, O Lord, for all hast died: Then teach us, whatsoe’er betide, To love them all in Thee.",
      "In sickness, sorrow, want or care, Whate’er it be, ‘tis ours to share; May we, where help is needed, there Give help as unto thee.",
      "And may thy Holy Spirit move All those who live to live in love, Till thou shalt greet in Heav’n above All those who give to Thee."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 602",
    "verses": [
      "“Love one another”, said the Lord, “Love others, as I have loved you”, Love one another, with pure love, O Jesus, give me this pure love.",
      "That I might love my brethren here, Love all those that Your Name proclaim. That we may all Thy children be, You are our Head, we are Your own.",
      "Just as You loved all humankind, You saved the world by Your great love. Grant me to have such love for all, Lord, fill my heart with love for all.",
      "Lord Jesus, give Your love to me, That I might love as You would like. That I might suffer not great shame, When on that Day You seek account."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 603",
    "verses": [
      " What I seek to say in this life, And whatever I shall do. I should ask what pleases Jesus, And do what shall please the Lord.",
      "I should always ask the question, Will Christ say what I would say? Would He sanction such a statement? Would He do such things I do?",
      "Do I truly follow Jesus? Do I seek the things He seeks? Do I seek the pleasures of life? All that panders to the flesh.",
      " Jesus show me your ways clearly,  how the state too of my heart. Try me now and know my thoughts, Lord, Lead me in Thy righteousness."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 604",
    "verses": [
      "O God, You are my loving Father, You give me what I need in life. For all my life is with You, dear Lord, From You I came to be on earth. You love me and You care for me, You are my God, You are my Lord.",
      "Protect me from the fleeting pleasures, Vain things that seek to please the flesh.These very things deceived, tempted me, They brought me guilt and sin and woe. Thy Good News always I must seek, Obey Thy Word that brings me life.",
      "Lord, help me overcome strong passions, Free me from all adulterous life. Protect my mind from sinful thinking, Protect me from all filthy talk, Help me to yield not to the traps, The cunning traps that Satan sets.",
      "Take from my heart the love of sinning, Lord, make my heart a worship place. Dear Father, grant that all my being, My heart and tongue and ear, be Yours. My body and all that in me, Be only Yours forever more."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 605",
    "verses": [
      "I’m not ashamed to own my Lord, Or to defend His cause, Maintain the honor of His Word, The glory of His cross.",
      "Jesus, my God! I know His Name, His Name is all my trust; Nor will He put my soul to shame, Nor let my hope be lost.",
      "Firm as His throne His promise stands, And He can well secure What I’ve committed to His hands Till the decisive hour.",
      "Then will He own my worthless name Before His Father’s face, And in the new Jerusalem Appoint my soul a place."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 606",
    "verses": [
      "Every time I feel the spirit Movin’ in my heart I will pray. Yes, every time I feel the spirit Movin’ in my heart I will pray.",
      "Up on the mountains, my Lord spoke; Out of His mouth came fire and smoke. Looked all around me, it looked so fine; I asked the Lord could it be mine.",
      "There ain’t but one train, running on this track It runs to heaven and it runs right back If I behave they will let me ride, I’ll have a home there when I get inside.",
      "Oh, I have sorrows and I have woe And I have heartache here below. But while God leads me I’ll never fear; For I am sheltered by His care."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 607",
    "verses": [
      "Soul, be ready, be prepared, Watchful be, and pray now.That you may not fall a prey, In this flesh so sinful. Be prepared, Satan comes, Tempting all the righteous, Many yield to his wiles.",
      "You must wake up from deep sleep, From the sleep that sin brings. For the thief comes well prepared, Ready comes to strike you. When you slumber and sleep, When you are dead in sin, He will come destroy you.",
      "Wake up friend, alert must be, Miss not blessings of God. When the light of God bright shines, May it not come blinding. Glory of God so bright, Shines upon His people, We shall see His glory.",
      "Watch, deceitful if the foe, Watch that you may not fall. Satan comes when you do sleep, Acts before you wake up. God gives up, those that sleep, To devices evil, Though He loves and cares much.",
      "Watchful be that you may stand, Overcome this wild world. For the world seeks to entrap, Pleasures sweet it offers. Watchful be, always then, That you may not yield now, Fall and yield to Satan.",
      "Watchful be, look to the flesh, That it may not harm you. In this flesh you own in life, Corrupt things dwell richly. It is filled with great lust, Seeks not glory of God, But it seeks its pleasures.",
      "Pray always, cease not in prayer, As you watch, so pray too. For the Lord knows all your needs, He will justify you. Grace abundant will give, Strength He will provide you, Help you stand victorious.",
      "Heart repentant, Jesus seeks, He will hear, forgive you. When you cry to Him in prayer, He will come and save you. He will come, and will fight, He will drive out your foes, All your foes shall perish.",
      "When you pray in Jesus’ Name, God will hear and answer. Promises that God has made, All these He will fulfill. All those with, faith in God, And shall seek His mercy, God shall glorify them.",
      "All must then wait for the Lord, Watching, praying, always. Come what may, come pain or stress, Come death, come destruction! We shall see that great Day, Day that God shall judge all, Nothing shall remain here."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 608",
    "verses": [
      "All who suffer pain and sorrow, Bear the pain you suffer gently. Those who are free from all ills, Must be careful and humble.",
      "Humility is so precious, For those that will suffer greatly. It is precious too for those That will have a life of ease.",
      "All those with this great quality, They shall overcome all troubles. For they shall be filled with peace, And shall all victorious be.",
      "When you face great tragedies here, Great depression you experience, Patiently endure the pain, God shall help you to endure.",
      "Careful be, when you prosper here, Temptation of pride awaits you; Be careful and humble be, Careful be to not stumble.",
      "When all things go so wrong for you, Worried, troubled much with problems, Patiently wait for your God, He will order all your life.",
      "When all things go so well for you, When men love you and all praise you, Be not proud but humble be, For such life may change for you.",
      "When you are despised, forsaken, When men hate you and reject you, When you have done nothing wrong, Patiently bear all this pain.",
      "When men seek to glorify you, Praise and honor you, adore you, Careful be, and watchful be, That you may not yield to pride.",
      "Patient be, when you are tempted, Patient, be in generous giving. In patience, weep with much joy, For great joy shall fill your heart.",
      "I shall always keep this treasure, It shall guide all conduct in life. In great patience, is great peace, Humble life goes with great joy."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 609",
    "verses": [
      "All you that follow Jesus, Great patience you need now. When you face trouble in life, Patiently bear it all. In trouble and in pain, When treated cruelly with hate, Stand firmly in all things here. Bear all things patiently.",
      "Seek to please Jesus your Lord, Do all to please the Lord. When you leave things in His Hands, He’ll act so perfectly. The suffering soon shall pass, Though it be pain in God’s love, Though it be pain from evil, All shall soon pass away.",
      "This gift of patience from God, From Holy Spirit, comes. The Lord shall give me great gift, This gift I shall now seek. Spirit of God, come now, Come dwell in me, dwell richly. Take all worries from my heart, Come bear the load I have.",
      "By faith, I have great patience, Persevere in this faith. I shall stand on His promise, Great confidence I’ll have. Patience from God of love, The love of Christ is with me, He’ll not forsake nor cast out, So I shall patient be.",
      "My God, my Savior and Lord, Grant me patience, I pray. Peace dwells with You Christ Jesus, I trust You Lord, my God. This transient pain shall pass, All suffering shall fade away. Peace I shall have from my God, Eternal joy, shall have."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 610",
    "verses": [
      "Wait, my soul, and tarry, Tarry with God! He will help you carry, Carry every load. Why fret and fear? When the morn is near?",
      "With the passing winter, Spring shall soon appear. When fierce storms distress, In every ill, God will surely bless you, Be still my soul.",
      "Wait, my soul, and tarry, Tarry with God! He will help you carry, Carry every load. When all things fail, God will still prevail.",
      "He can safely lead you, Through dark vale you trod. Lord, God eternal, Leads to the goal. Christ, forever Faithful, Saves you, my soul.",
      "Wait, my soul, and tarry, Tarry with God! He will help you carry, Carry every load. When life shall cease, God will grant release.",
      "Out of sorrow, lead me, Into blessed peace; When through afflictions, Thy way, I’ve trod. Joy eternal follows, Faithful is God."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 611",
    "verses": [
      "When in pride, the self exalt, God shall humble you, my soul. Therefore humble be in life, God Himself shall lift you high.",
      "Christ’s example you must see, Glory above, all He left. Everlasting God, took flesh, Servant came, though He is Lord.",
      "Humble, meek was Jesus Christ, Obedient He was in life. Obedient was He to death, On the Cross of shame, He died.",
      "Jesus, God, exalted High, He has Name above all names. That all in the earth and Heav’n, Bow before Him and worship.",
      "Into Kingdom of our Lord, We must come in humbleness. By this we shall come to God, And be part of His Kingdom.",
      "If you have a haughty life, And you seek the world to please. And you walk proudly in life, God shall bring you low at last.",
      "Therefore, wear humility, Bind it on yourself always. Grace of God and favor have, Glory of the Lord you’ll see."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 612",
    "verses": [
      "When God has blessed you with a wife, Who loves you and you also love.Then you have priceless gift from Him, Be happy and rejoice always.",
      "The good wife loves her husband much, She loves him and she cares for him, In joy and trouble and suffering, She sticks to him and him alone.",
      "She also gives him good counsel, When in distress she comforts him. She longs for him and waits for him, Companionship, she seeks with him.",
      "Husband provide well for your wife, The wife also must seek to bless. God now has made you one in Him, Let nothing separate you in life.",
      "Christ Jesus watches over you, His blessings you have now received. Grace, mercy from Him, all are yours, God has provided all your needs.",
      "Seek always to please God in life, Be faithful to Him in all things. Live peacefully in this marriage, That you may end in God’s own Rest.",
      "Lord Jesus Christ, the Blood you shed, Has cleansed from sin and purchased us. Eternal life we have in You, Your righteousness, we all now have.",
      "Bless Lord, Thy Church, with bliss from You, Bless this man and woman and all, That we may follow truth in You, Walk in Your paths to Home above."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 613",
    "verses": [
      "Our glorious Lord, by grace from You, We humbly come to You. We thank You Lord, we praise Your Name, Such great love You have shown. You laid Your life for all mankind, For sinners, gave Your life. That they may all become Your Bride, Become a part of You.",
      "A mystery profound, we know now, How special marriage is. You are the Husband of the Church, As husband to the wife! You loved the Church, gave her Your life, So husband love your wife. That you may be one with her now, Like Jesus and His Church.",
      "Grant Lord, deep love between these two, We now present to You. That they may always patient be, Faithful be in their lives. Grant them to follow faithfully, Obey You, always please, Grant them that when this life shall end, They shall rest with You Lord."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 614",
    "verses": [
      "Those that seek to enter marriage, They must ready be for that. If you seek a happy marriage, Marriage sweet you seek to have. Then spend much time with the Lord, Fervently seek Him in prayer, God shall help prepare and shape you, Peaceful, happy life shall have then.",
      "Pray much and good counsel seek now, As you pray, God’s counsel seek. This is how you start a marriage, Happy marriage starts this way. This is how you both shall know, That God truly made you one. When He pours great blessings on you, Precious blessings you have from Him.",
      "Honor, joy and other blessings, Come from God for you to live. Those that trust Christ Jesus always, Life eternal they all have. If this marriage is of God, It shall be a happy one. Husband and wife are together, Peace and joy they shall have always."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 615",
    "verses": [
      "Source of all life, eternal God, You made us in Your own image, You made us for Yourself Lord. You blessed us with all that we need,",
      "That we may have fullness of life, And You established marriage. We now, present, these two people, Here before You, for Your blessings. Grant them to live in Your presence.",
      "Head of the Church, You are our God, We are a part of You Jesus, You care for us with great love. You have redeemed us by Your Blood,",
      "You have redeemed us from our sin, You made us friends of Your’s Lord, We pray, dear Lord, bless this couple, Grant them Your love, and be with them; Give them love to please You always.",
      "The Father, Son and Holy Ghost, We are so blessed to have You all, Together love us sinners. Come sanctify Your people now, And make us holy in Your sight,",
      "You are our Lord, we love You. Receive these two; make them Your own, Live in their hearts, throughout their lives, Grant them to be blessed with life, Lord.",
      "Come Father, Son and Holy Ghost, Dwell in our hearts and stay with us. Come save us and protect us. Come purify our hearts, O Lord,",
      "That we may live in purity, Be with us that we may keep. When this, life is, over in death, Come and take us, to Your Home Lord, We shall praise You there forever."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 616",
    "verses": [
      "Eternal God, our loving God, You blessed us with parents on earth. From birth you guided, provided, Our needs you met in good homes here, Bless Lord our homes, we pray You now, Pour every blessing on our home.",
      "Help children and adults, we pray, Help them to live in unity. That they may grow in Christ always, Be one at work, in play and all. Bless Lord our homes, we pray You, now, Pour every blessing on our home.",
      "Our trespasses at home, forgive, Forgive our selfishness and pride. Parents and children must unite, Submit to You in everything. Bless Lord our homes, we pray you, now, Pour every blessing on our home.",
      "Our heavenly Father, come to bless, Help us to know our role at home. Our footsteps guide and lead us, Lord, Grant wisdom in our troubles here, Bless Lord our homes, we pray you, now, Pour every blessing on our home."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 617",
    "verses": [
      "God our Father, eternal, You are love; Your love is full, Help us love as you loved us, That we may love everyone, Love all, as You loved us Lord.",
      "Gracious Father, loving God, Fill our lives with love from You. Help us lay our lives for friends, Peace and unity to bring, Bless homes of Your children, now."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 618",
    "verses": [
      "Marriage, Lord You instituted, Marriage foundation You are. You found helper fit for Adam, You knew Adam needed such. Companion did Adam need here, His own flesh and bone he sought, You made woman out of Adam, Now the two are one in flesh.",
      "Man and woman God did create, Out of grace He made them both. That the two may be united, Live in holy love from You. You did promise blessings for us, You, O Lord, our God we trust. These two are before You now, Lord, We seek blessings for their lives.",
      "Lord, Your promises we seek now, Bless these two before You now. They have come to You for blessings, Marriage blessings they both seek. Grant that they may honor You, Lord, Make You Lord in heart and home. Help these two, O Lord, we pray You, Help them in joy or in pain."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 619",
    "verses": [
      "If Jesus is your Lord and God, Lord in your life and Lord at home. Blessed you are and all your home, Full life and peace you have in Christ.",
      "Bless Lord this couple and their lives, All those that trust You Lord are blessed. Those that believe and trust You Lord, They shall be blessed with love from You.",
      "Blessed the home that seeks the Lord, That home shall bear much fruit in You. That home shall witness You always, By grace from You, that home shall thrive.",
      "Blessed the home where couples pray, And pray without ceasing to you. A home that treasures God’s own Word, To follow Christ and do His will.",
      "Blessed the family that lives, In God’s Spirit they live as one, A family that works so hard, Where each excels in gifts received.",
      "Blessed are parents in the Lord, Parents that help grandchildren grow. Parents that teach the fear of God, A healthy home they make for all.",
      "Now “as for me and for my house”, The Lord we shall serve with our lives. Should all forsake the Lord our God, This family shall serve the Lord."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 620",
    "verses": [
      "For me and for my house, we’ll serve Jehovah, We’ll praise Him for He saves and cares for us. Jehovah is our Rock and sure foundation, In Him our faith is rooted, steadfast, deep! This world may seek salvation in vain treasures, In worldly things and lustful pleasures all, But we have found full life in God our Savior, In Jesus Christ and in His Blood is life.",
      "Christ is the Head, in Him we all are members, By His own Blood, He purchased us for God. With love eternal, Christ has saved His children, We have in Him eternal blessings now. Such blessings rest upon the homes of Christians, All those who seek to follow Christ the Lord, But curses rest on those that follow Satan, Blessings abound for those that have the Lord.",
      "Let men deride, the Name of Christ our Savior, His Kingdom they disparage with disdain. For me and mine, our trust is in Christ Jesus, By faith in Him, we love and follow Him. He will not leave us, nor forsake His children, He shall be near, in danger and distress, He shall be with us to the end of this life, He’ll bring us Home at last to be with God.",
      "For me and mine we’ll love the Lord our Savior, Fountain of Life is Jesus Christ for us. We have His Word as rule for every conduct, We seek to follow God’s Word in this life. Before our Father we bring all our children, Grandchildren too, and all descendants bring, That they may seek to follow Christ the Savior, Eternal joy we all shall have in Christ."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 621",
    "verses": [
      "O perfect Love, all human thought transcending, Lowly we kneel in prayer before Thy throne, That theirs may be the love which knows no ending, Whom Thou forever more dost join in one.",
      "O perfect Life, be Thou their full assurance, Of tender charity and steadfast faith, Of patient hope and quiet, brave endurance, With childlike trust that fears nor pain nor death.",
      "Grant them the joy which brightens earthly sorrow; Grant them the peace which calms all earthly strife, And to life’s day the glorious unknown morrow That dawns upon eternal love and life.",
      "Hear us, O Father, gracious and forgiving, Through Jesus Christ, Thy co-eternal Word, Who, with the Holy Ghost, by all things living, Now and to endless ages art adored."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 622",
    "verses": [
      "The Lord God made all things in beauty, In wisdom and in power made them. He brought the things created for man, That man may name the things so made. That he may have dominion o’er, Rule all things that God has made.",
      "After these things, God chose to bless man, To make for him a helper fit. For none was found in all creation, That suited man for life on earth. Companion God made for Adam, Helper fit for him to serve.",
      "God made this helper wonderfully, From man’s own side He made woman. Deep sleep He brought upon the man first, He then took out one of his ribs. Out of this rib, God made woman, And brought her to man as his bride! ",
      "Adam declared in joyful singing, “This at last, is bone of my bones”. He also saw in Eve his own flesh, From his own flesh, God made woman, Then man shall leave his father’s home, And be united with his wife.",
      "Now they are one in flesh and body, No longer two they are, but one. For God Himself, has made this union, And only death can part them now. So man must not break this union, This couple is now united."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 623",
    "verses": [
      "What is precious in this life, What we need most in our lives. Life in gentleness and joy, Wisdom, peace and faithfulness; With humility, kindness, This life is pure life of love.",
      "People that have lived apart, Now they seek great fellowship. They had not each other sought, Nor had they expressed great love. God shall join in mystery, Make them one in heart and mind.",
      "Man is raised in home apart, From the home the woman dwells. They have different lives and minds, Also different in nature, But when God’s own time has come, They are made one in His Name.",
      "What the Father has decreed, That shall come to pass for them. What He has reserved for them, They shall soon find in this life, When that gift they see at last, Their lives shall be so complete.",
      "New love these two people have, Love refined, love beautiful. Love at table and at work, Love in all things, love so sweet. Love so full in all their life, Love in trouble and in joy.",
      "Take God’s counsel and be blessed, Have joy, peace and gentleness. Have all faithfulness and peace, Have great patience with kind hearts. Wondrous life you shall have then, Pure life that is full of love."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 624",
    "verses": [
      "As we celebrate this marriage, We invite You Jesus Christ. How You went to Cana’s marriage, And You blessed the couple there. Be with us and bless us now, Bless this couple we present.",
      "Bless us with Your peace, dear Jesus, Give Your peace to us this day. As we bring this couple to You, Make them one throughout their lives Only death shall separate them, Make them one in You, O Lord.",
      "Grant them grace to make their vows now, Help them to make holy vows. Help them to be truthful to You, Help them keep to all their vows. Jesus bless this couple now, Bless them Lord for evermore."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 625",
    "verses": [
      "Lord, You established marriage, Bless this man and his wife. Bless body mind and spirit, Bless them with all good things. Give to this man and his wife, What they are seeking now, In prayer they come to You.",
      "Grant grace to these Thy children, So they may one remain. Help them always to know that, You made them one in you.  You gave her over to man, You gave the man to her. In love you made them one.",
      "Grant them to love each other, Help them to live in truth. Fill them with love and truth now, Renew their lives always. That they may grow in great love, Grow to be one in life, In spirit one to be.",
      "Let your Word richly dwell now, Dwell in their hearts, O Lord. Make them to be Your children, Bless them with peace in life. In mind in words and action, And all that they will do, Reveal you Lord Jesus.",
      "Give them great joy in marriage, As you have planned for them; Give them the gifts they both need, In all their lives bless them. Their troubles and their burdens, Help them to bear in joy, Until they end this life."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 626",
    "verses": [
      "You love us Lord, so purely, You are the fount of life. You instituted marriage, In love You made this life. To Cana’s marriage, You went, You blessed the couple there. Send Lord, Your heavenly blessings, To bless this couple now.",
      "This couple is before You, Make them one in You Lord. Bless them now in their marriage, Bless them throughout their lives. What You performed in Cana, The blessings they received. Do same for these before You, Bless, Lord, their families.",
      "Plant in their hearts the Scriptures, The Word must dwell in them. Make them to prosper much here, Gracious, Lord, be to them. Grant fruit to bear abundant, To glorify You Lord. Help them to live before You, Live in Your holiness.",
      "Jesus the joy of all life, The Prince of Peace You are. Grant them great courage always, Help them in troubles, here. Be with them as they start life, Be with them to the end. And when this life is over, Grant them to see You Lord."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 627",
    "verses": [
      "Blessed you are that fear the Lord Jehovah, Blessed are they that walk in His ways. You shall eat fruit from labor of your own hands, You shall be happy, and be so blessed. Your wife shall be like a fruitful vine tree. A fruitful vine within your own house here, Fruitful shall be; fruitful shall be.",
      "Your children shall be like shoots of the olive, Surrounding You at the table laid. Lo, shall the man be blessed who fears the Lord God, The Lord Himself shall bless this man now. The Lord shall come bless this man from Zion, The Lord shall also bless you very much, You shall be blessed; you shall be blessed.",
      "God shall prosper you much in this life on earth, You shall be blessed by the most High God. You shall live long with more abundant blessings. And see blessings of Jerusalem. May you live long to see all your children, See all your great grand children in this life, Hallelujah; Hallelujah."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 628",
    "verses": [
      "Blessed is he that fears Jehovah, Blessed who walks in ways of God. Fruitful shall be the work of your hands, You shall be blessed with fruit in life. Blessed you shall be in all your life, You shall be blessed forever more.",
      "Your wife shall be a fruitful vine here, Like fruitful vine within your house. Your children like shoots of the olive, Surround the table in your home. God shall bless husband and bless wife, Your children’s children you shall see.",
      "God shall be pleased to bless this man now, To bless the man that fears the Lord. From Zion, God shall pour His blessings In all his life God’s peace shall have, See blessings of Jerusalem, The peace of God shall rest on him."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 629",
    "verses": [
      "The marriage life is full of joy, Is full of happiness and peace, When blessed by God Jehovah. From You, O Lord, we have all things, All good things from You Lord on High,",
      "We have your blessings always. If You, bless this, couple you will Bless all present, bless families. Make this couple one in You Lord.",
      "When man and woman live as one, Are faithful and live in God’s love, Live in the covenant made. There shall be much prosperity,",
      "The angels also shall rejoice, They shall be happy in love. None can separate, none can destroy Such a union, God established. What God joined no one can sever.",
      "The man shall be like fruitful tree, With branches spreading all around, The wife be like fruitful vine, A fruitful vine that bears much fruit,",
      "Supplying needs of many folk, Delightful fruits she shall bear. Blessed is her husband’s radiance, Man of substance, man of glory. God Himself shall glorify them.",
      "The storms of life they shall go through, Problems in marriage they shall have, They shall experience weeping. But those that put their trust in God, All those that wait upon the Lord,",
      "From Him they shall have freedom. Be still, wait now, bear with patience, Wait upon God, He shall keep you Joy He’ll bring you from the struggles.",
      "Come now our great King come to us, Instruct us and bless us in life, In joy or sorrow bless us. That we may render thanks to you, And sing to praise Thy Holy Name,",
      "To magnify and laud Thee. Midnight, noontime, all the days of Life till heaven, till we see You. We shall praise and glorify You.",
      "Then come our King we wait for You, Come bless and teach us, Lord our God; In pain and joy be with us. We’ll give You thanks and worship You,",
      "Then come our King we wait for You, Come bless and teach us, Lord our God; In pain and joy be with us. We’ll give You thanks and worship You,"
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 630",
    "verses": [
      "Parents you heard what Jesus said, “Let all the children come to me. And do not hinder any one, But let them come to me right now”.",
      "For to such little ones like these, The Kingdom of God now belongs. Can any treasure here on earth, Compare with treasures found in Heav’n.",
      "We must believe what Jesus said, God’s Kingdom shall not pass away. If you have right to enter in, You are so blessed for evermore.",
      "Parents you must obey the Lord, Bring all the newborns to the Lord. That they may all be raised in Christ, Be raised, prepared for life in Heav’n.",
      "If you sincerely love your child, Then seek to raise him in the Lord. If you will not obey the Lord, You have no true love for the child.",
      "What worth is treasure here on earth? If life of children is so ruined? In Christ they all are richly blessed, They have a rich life in the Lord."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 631",
    "verses": [
      "Lord, have mercy on our children, Look upon them graciously. Conceived and born in sin they were. But they come under Your grace. By this baptism they come, They are Yours dear, Jesus Christ. We commit them to Your care now, Guide them in their life on this earth.",
      "You have blessed them now as children, You preserved their lives from ills. Lord we pray You, bless them always, Be with them throughout their lives. Be with them when troubles come, Protect them from all evil. Help them to seek You in trouble, Help them and deliver them now.",
      "When these children face deception, When they face the evil one; Help them to stand firm for You Lord, Help them to stick to Your way. Help them deal with inward sin, Help them overcome all lust. Give them strength in mind and spirit, Overcome corruption in life.",
      "Hear our prayer for these Thy children, Make them truthful, honest ones. Grant that none of these Thy children, Shall deny You and be lost. Give to them Thy Spirit, Lord, Guide them by Your Spirit, Lord. That they may remain Your children, That they may Thy glory seek now.",
      "Give me heavenly joy, Father, Give me joy on that great Day. That I may declare with boldness, Blessings I have in this life. I shall come present to You, All the children You gave me. Have all ended well with blessings, None has perished, all are safe Lord.",
      "What worth is treasure here on earth? If life of children is so ruined? In Christ they all are richly blessed, They have a rich life in the Lord."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 632",
    "verses": [
      "Unless the Lord builds the house, none can do it, Those who build it shall labor all in vain. Unless the Lord watches over the city, The watchman stays awake in vain in it. In vain you rise up early in the morning, And go to rest so late after your toil, Eating the bread of anxious toil in labor, The Lord gives sleep to His beloved ones.",
      "Lo, sons are heritage from God Jehovah, The fruit of womb is such a great reward. Like arrows in the hand of warriors they are, They are the ones born in one’s youth on earth. Happy the man, who has his quiver so full, Of such reward, none can put him to shame. When in the gates, he speaks with enemies all, He shall be honored by the Lord always."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 633",
    "verses": [
      "Jesus, Lord of Heaven, Now to You we come. Place Your Hand on us and, Bless us now, O Lord.",
      "When You came down to earth, When in flesh You came. You did dwell among us And Judea, You blessed.",
      "With our children we come, We come to You Lord. We respond to You and, Come to You, O Lord.",
      "Savior who has blessed us, Bless our children now. Bless us all that we may, Now be cleansed, O Lord.",
      "Give Thy Holy Spirit, Lord come dwell in us. That we may be Yours; be Heavenly children.",
      "We shall praise You always, We shall sing Your praise. When we see You as You are We shall praise You."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 634",
    "verses": [
      "Gentle Jesus, meek and mild, Look upon a little child; Pity my simplicity, Suffer me to come to Thee.",
      "Fain I would to Thee be brought, Dearest God, forbid it not; Give me, dearest God, a place In the kingdom of Thy grace",
      "Lamb of God, I look to Thee; Thou shalt my example be; Thou art gentle, meek, and mild; Thou wast once a little child.",
      "Fain I would be as Thou art; Give me Thine obedient heart; Thou art pitiful and kind, Let me have Thy loving mind.",
      "Let me, above all, fulfill God my heav’nly Father’s will; Never His good Spirit grieve; Only to His glory live.",
      "Thou didst live to God alone; Thou didst never seek Thine own; Thou Thyself didst never please: God was all Thy happiness.",
      "Loving Jesus, gentle Lamb, In Thy gracious hands I am; Make me, Savior, what Thou art, Live Thyself within my heart.",
      "I shall then show forth Thy praise, Serve Thee all my happy days; Then the world shall always see Christ, the Holy Child, in me."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 635",
    "verses": [
      "Gracious Lord and gentle Jesus, Look upon Your humble child! Merciful be to Your servant, Grant me Lord to come to You.",
      "Bless me Lord with heavenly blessing, That I might grow well in You! When this life on earth is over, I shall dwell with You above.",
      "You became a child here on earth, Help us be like You, O Lord! In our life and all we do here, May we share Your nature, Lord.",
      "May we follow You Lord Jesus, Listen to You and be still; Take the heart of evil from us, Give us new hearts full of love.",
      "Give us grace to die to sin here, Give us new life of Your life; Help us live for You forever, Amen, Lord, so let it be."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 636",
    "verses": [
      "Wisdom of Jehovah, Loudly seeks us all. Calling us to come now, And be blessed with life.",
      "In fear of Lord God, Life of wisdom starts. Knowledge, insight deep, and Wisdom comes from God.",
      "Listen to your father, Receive discipline.Treasure mother’s guide, spurn Not her wise words too.",
      "Honor great you shall have, Crown of life you’ll have. Ornament so great, You Shall wear in wisdom.",
      "If men evil tempt you, Seek to change your mind. Dear, beloved child, do Not give in to lies.",
      "Do not follow such men, Paths of death they trod. When they beckon you, run From them to safety.",
      "In fear of Lord God, Life of wisdom starts. Life of honor, glory, Follow wisdom’s life."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PHB 637",
    "verses": [
      "Dear Jesus, listen to Your child, I know not what to ask. In this life on earth, You alone, Has what it takes to lead.",
      "As children we come to You Lord, Take refuge in Your grace. Embrace us with Your love O Lord, Grant me to be among."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 638",
    "verses": [
      "Do you know who loves you so much? One who loves you dearly too? One who always meets your needs here? In this troubled life on earth? Do you know from whom your life comes? One who gives you parents too? Do you know who gives you all things? One who watches over you?",
      "Do you know who died to save you? One who died at Golgotha? One who has secured salvation? One who died for sin for all? Yes, I know this precious, dear Friend, Jesus Christ my Shepherd is. Truly I belong to Jesus, I am one of His true sheep.",
      "Jesus loves me and I love Him, I shall always praise His Name. Hallelujah, joyful singing, Joy has filled my heart in Him. Hallelujah, joyful singing, I shall enter Heav’n with Christ. Angels of the Lord shall meet me, I shall always be with Christ."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 639",
    "verses": [
      "Why should I not rejoice? That I’m born and live? Can I now rejoice, And boast about my life?",
      "Here on earth I weep much, Weep for sin and woe. Fearful is such life here Life threatened with death.",
      "If we had no Savior, We shall face misery. Now that He has come, We have much to rejoice.",
      "All those who declare thus, “Lord You are my God”. Must no longer fear, But now rejoice in life.",
      "I must weep for such love, Love in Christ’s sufferings. Love that found me out, And now has sought for me.",
      "You did stir my heart Lord, And I yielded all. You provide my needs, In life, I now give all.",
      "You forgave my sin, Lord, Awful sin I had. I am further blessed,  By grace from You my Lord.",
      "Then again I must ask, Should there be regret. For my birth and life, Here with all God’s blessings.",
      "If all truly know Christ, Know the Savior well. All shall come to Him, And yield to Him their lives",
      "If you are a Christian, You will suffer much. Joy and sorrow mixed, But you must seek God’s strength.",
      "From God’s Throne in Heaven, He sees all your life. In mercy, God will, Supply all needs in life.",
      "At the end of this life, He shall come for you. He shall bring you to His Home above in Heav’n!",
      "All our sufferings shall end, We shall soon depart. Then we shall all sing, And sing Hallelujah."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 640",
    "verses": [
      "Bless the Lord your God, O my soul, bless Him. All that is within me bless Him, Bless His Holy Name and praise Him, Bless the Lord your God, O my soul, bless Him.",
      "Forget not His gifts, All you have from Him. All His benefits to you here, All your sin forgiven by Him, All your diseases, He heals them as well.",
      "He redeems your life, From the pit, He saves. God who crowns your life with blessings, Steadfast love and mercy gives you. Satisfies with good, Long as you shall live.",
      "Merciful is God, Slow in anger is. Steadfast love of God abounding, God refrains from chiding always, Merciful is He, Gracious is our God.",
      "Our sin God removes, Far like east from west. Far God has removed transgressions, He sees not the sin forgiven. Pitiful is He, God so loves us much.",
      "Our frame God knows well, Our frail life He knows. Like the dust we are before Him, Like a flower, we all are nothing, Our days like the grass, Soon shall end on earth.",
      "Mighty ones of God, You that do His will.  You that listen and obey Him, All His hosts and all His servants, All His works on earth, Bless the Lord my soul.",
      "Bless the Lord my soul, All His hosts bless Him, Bless Him, all His ministers here. All His works bless Him and praise Him, His dominion all, Bless His Holy Name."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 641",
    "verses": [
      "O Lord, the Lord our God, Your Name is mighty, great. Your Name is great on earth, Your great honor hid in glory. In Heaven and highest Heaven, You are Lord of hosts, God, Jehovah, God, Your Name is great on earth.",
      "When I look at the Heav’ns, I see Your wondrous works. The moon and all the stars, Such wondrous things You created. What is the son of man in life? That You care much for him? So mindful of? Who is man that You care?",
      "You made man special being, You made him less than God. With glory, honor crowned, You set him over all the earth, Dominion You gave to all men, Over all things You have made. You blessed him, Lord, You honored human beings.",
      "All sheep and all oxen, All beasts in all the earth; The birds in air and sky, And all fish in the deep waters. You gave all these to humankind, O Lord, You are so great, Majestic One, In all the earth You reign."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 642",
    "verses": [
      "As I celebrate my birth, On the day I entered this world. When I review all my life, Years that God Himself has granted. What there is for me to give? Lord to You.",
      "Lord, You blessed me with this life, You provided me with all things. Clothing, food and drink I need, Till today You have provided. Bountifully You have blessed, What from me?",
      "O my Lord forgive me now, Like a tree and stone I have been. For those that forget You Lord, Those that fail to thank and praise You. You have given me all things. So I live.",
      "Help me Lord to praise You now, Praise You as one who is grateful. Truly, You have saved my life, Praise and thanks I render to You. For my life and all I have. Praise You now.",
      "Lord, protect me, keep my life, For this life belongs to You Lord. This I give to You dear Lord, Give to You Lord all You gave me. To You Lord I yield my life. All is Yours."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 643",
    "verses": [
      "Jesus is my Savior, He walks with me always, In the paths I tread in this life. Love drove You to come down, Sent You into suffering, Caused You pain from cruel suffering. For me Lord, You did come, You did come in great power, I am weak and lowly.",
      "Lord You love all sinners, You seek to restore them, You are moved by suffering sinners. For our sake You came down, Seeking us Your children, And You never give up searching. To redeem, You did come, Sinners You came to save, Bear their curses for them.",
      "You did walk among us, Walked the towns in Judea, All Your travels brought us blessings. Everywhere You went Lord, Blessings followed Your works, Preached the Word and healed and gave life. Suffered hunger and thirst, Sleepless nights You suffered, But You pleased the Father.",
      "As I travel this life, Let me learn from You Lord, Let me follow You so closely. Let me love the brethren, As You loved me, dear Lord, Let me seek their welfare in life. In the day and at night, Be with me in all things, As I sojourn on earth.",
      "Love of my dear Father, Grace of Savior Jesus, Holy Spirit’s peace I need now. This is pleasing to me, And the joy of my life, In this I have hope eternal. Loving Father, keep me, Guide me in Thy ways Lord, Guide me to your Home Lord."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 644",
    "verses": [
      "My great Redeemer and my guide, Omnipotent is He. None can compare with Christ my Lord, In power and strength and might, The great I AM, Omniscient God, His goodness is complete, In stormy winds and dangers then, I’ll dwell secure in Him.",
      "When doubts and fears assail me Lord, I’ll trust in You my God, You are the Rock, no storm can move, My sure defense is Christ. Be still my soul, for all is well, For God is in control, His presence overcomes the dark, He’ll save my soul from harm",
      "In death’s dark vale, I’ll fear no ill, For You are with me still, God Omnipresent, You are Lord, Of life and storms and winds, The Sovereign Lord ordains my life So perfectly He plans, He’ll lead me in His perfect peace, He’ll bring me Home in Heav’n."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 645",
    "verses": [
      "We travel in the Name of God, Dear Lord, go before us we pray. Our heavenly Father, loving God, Protect our lives and bodies now.",
      "Dear Savior Jesus, follow us, You travelled on this earth before You promised those that follow You, You shall be with them to the end.",
      "Holy Spirit, give us Your strength, Take over now and be with us. Come comfort us in everything, Send us and bring us back we pray."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 646",
    "verses": [
      "Lord, bless my work as I begin, Bless all my labors as I start. From the beginning to the end, You Lord I look to for success, Let all be well.",
      "All that I seek to do in life, I must seek blessing for them all. I shall submit all to Your will, I shall come to You Lord in prayer, Let all be well.",
      "Not in my strength and skill and will, Or in the knowledge I have here. I shall have great success in life, But in You Lord, I’ll prosper here, Let all be well.",
      "Without You Lord I live in vain, And nothing is of worth in life. You grant success and fruitful life, Therefore I shall depend on You, Let all be well.",
      "In love You show me favor here, Therefore I thank You for such love. I shall feed on Your Word, O Lord, I shall obey what You teach me; Let all be well.",
      "I commit all things to You Lord, All that I have I give to You. You only know the best for me, What You allow is very best, Let all be well.",
      "When I face suffering in this life, Protect Your servant from all fear. Help me, grant me, strength for all things, Give me Your peace in my suffering, Let all be well.",
      "You only Lord I trust in life, Your love shall provide all my needs. You shall protect me from all ills, Deliver me from evil, Lord. Let all be well",
      "Lord bless me in this life always, Be with me till the end shall come. Help me, O Lord in all my life, And when this life is o’er in death, Let all be well."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 647",
    "verses": [
      "Jesus is close by me, as I travel, With much joy I travel with Him now. By Him only I shall walk life’s journey, He alone, gives peace in all dwellings. :/:",
      "On the mountains and in all the valleys, In the seas and deserts and perils, Jesus shall be with me and shall lead me, Without Him I shall be lost in life. :/:",
      "When I sleep at night Jesus protects me, When I rise, my Friend is still beside, He alone shall guide me in God’s ways, In my travels, Jesus my comfort. :/:",
      "I desire no one in life but Jesus, He is all in all for me in life, I have always gracious blessings from Him, He provides for body, spirit, soul, . :/:",
      "When my life shall end in death here on earth, Jesus brings me Home eternally, I shall enter everlasting peace then, I shall dine with Jesus in glory. :/:"
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },
  {
    "name": "PHB 648",
    "verses": [
      "God be with you till we meet again; By his counsels guide, uphold you; With his sheep securely fold you. God be with you till we meet again.",
      "Till we meet, till we meet, Till we meet at Jesus’ feet, Till we meet, till we meet, God be with you till we meet again.",
      "God be with you till we meet again; ‘Neath His wings protecting hide you, Daily manna still provide you: God be with you till we meet again.",
      "God be with you till we meet again; When life’s perils thick confound you, Put His arms unfailing round you. God be with you till we meet again.",
      "God be with you till we meet again; Keep love’s banner floating o’er you; Smite death’s threat’ning wave before you. God be with you till we meet again."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 649",
    "verses": [
      "Fill thou my life, O Lord my God In every part with praise That my whole being may proclaim Thy being and Thy ways",
      "Not for the lip of praise alone Nor e’en the praising heart I ask, but for a life made up Of praise in every part",
      "Praise in the common things of life Its goings out and in Praise in each duty and each deed However small and mean",
      "Fill every part of me with praise Let all my being speak Of Thee and of Thy love, O Lord Poor though I be and weak",
      "So shalt Thou, Lord, from me e’en me, Receive this glory due; And so shall I begin on earth The song for ever new",
      "So shall no part of day or night From sacredness be free; But all my life in every step, Be fellowship with Thee"
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 650",
    "verses": [
      "Forth in Thy Name, O Lord, I go, My daily labor to pursue; Thee, only Thee, resolved to know In all I think or speak or do.",
      "The task Thy wisdom hath assigned, O let me cheerfully fulfill; In all my works, Thy presence find, And prove Thy good and perfect will.",
      "Preserve me from my calling’s snare, And hide my simple heart above, Above the thorns of choking care, The gilded baits of worldly love.",
      "Thee may I set at my right hand, Whose eyes mine inmost substance see, And labor on at Thy command, And offer all my works to Thee.",
      "Give me to bear Thy easy yoke, And every moment watch and pray, And still to things eternal look, And hasten to Thy glorious day.",
      "For Thee delightfully employ Whate’er Thy bounteous grace hath giv’n; And run my course with even joy, And closely walk with Thee to Heav’n"
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 651",
    "verses": [
      "My soul wake up from your slumber, Bring to God the praises due. Come declare His praises to all, Praise Him always day and night. At all times He is with you, He protects you day and night, From the devil and his minions, He will protect you from all harm.",
      "Be with us Your loving children, Comfort all Your children now. Care for us, provide our needs Lord, In thy gracious mercies bless. What we seek from You most now, Fill us with the Holy Ghost, That we may not lose our way Home, Or be overcome by evil.",
      "Help me Lord be always careful, As I live with evil men. Grant my life to witness always, And rebuke all evil men. Make me blessing to such men, Grant that they may not harm me, Grant that all things shall proclaim You, And publish Your Name all abroad.",
      "Help me to complete my life here, Do all things to please You Lord. I desire to live like You Lord, Be like You when You lived here. Faithful be to You dear Lord, To the end, till I shall die, Leave this earth to be with You Lord, And I shall praise You Lord always."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 652",
    "verses": [
      "God’s food is now ready, the table is laid, Come feast at the table God now has prepared. Come now and declare then, God’s love for us all, For God seeks to satisfy young and the old.",
      "He feeds all the birds and the beasts of the earth, He gives them the food that they need for their lives. The tiny, small creatures, He cares for them too, We must all give thanks and give praise to the Lord."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 653",
    "verses": [
      "We now thank the Lord Jehovah, Who gives all things so good we need. We pray the Lord, God merciful, Remember always, us poor souls.",
      "Feed us with Thy Holy Word Lord, Grant that Thy word may fill our lives. Our gracious Lord grant us to have, Eternal life, we seek from You.",
      "Jesus Christ we give You all thanks, For You became a stranger here. You Faithful, True and Living Bread, Be with us that we nothing lack."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 654",
    "verses": [
      "Now we give thanks to our God, By whose grace He blessed us all. We have life in all fullness, We are filled with food from Him.",
      "He that gives food for the flesh, Our soul’s needs, He’ll not forget. For our needs He came from Heav’n, Down He came to save the soul.",
      "What our soul needs, God supplies, Life eternal He has giv’n. We must not reject such gift, We should take the life He gives."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 655",
    "verses": [
      "Praise God, from whom all blessings flow, Praise Him all creatures here below, Praise Him above ye heavenly hosts, Praise Father, Son and Holy Ghost!"
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 656",
    "verses": [
      "Join us at Table, Jesus Christ, Your glorious presence we do seek. Bless this food and partake with us, With you partake in Paradise.",
      "You care for us as father does, All that we need in life You give. You provide what the body needs, Supply the soul’s spiritual needs."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 657",
    "verses": [
      "O give thanks to our God, Give thanks my soul to the Lord God. For He provides all that, You need in body and spirit. Praise God my soul, Love Him with all your being, Always sing praises and give thanks.",
      "Lord, You are merciful, All needs You generously give us. You guide our lives on earth, Wondrously help us to bear fruit. All of our lives, Our body, soul and spirit, All must give thanks and all praise You.",
      "Jesus You are the Word, Come feed our soul with Thy Word Lord. Provide our needs in life, Provide our daily bread, Jesus. May we all thirst, Thirst for You Jesus always, Our food and life You are, Jesus.",
      "Thy gracious Spirit, Lord, Come now with cleansing and healing. Make us to be like God, Make us, like Him, to be holy. Until we are, One with You Lord in all things, Christ in us now and forever.",
      "Great Shepherd of the sheep, Visit and strengthen Your people. Prepare Your people now, For feast eternal in Heaven. Be with us Lord, Be with us now and ever, Grant us the joy to see Jesus."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 658",
    "verses": [
      "Father, whose will is life and good For all of mortal breath, Bind strong the bond of brotherhood Of those who fight with death.",
      "Empower the hands and hearts and wills Of friends both near and far, Who battle with the body’s ills And wage Your holy war.",
      "Where’er they heal the maimed and blind, Let love of Christ attend: Proclaim the good Physician’s mind, And prove the Savior friend.",
      "For still His love works wondrous charms, And, as in days of old, He takes the wounded to His arms, And bears them to the fold.",
      "O Father, look from Heav’n and bless Whate’er Your servants do, Their works of pure unselfishness, Made consecrate to You."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 659",
    "verses": [
      "From Thee all skill and science do flow, All pity, care and love, All calm and courage, faith and hope; O pour them from above.",
      "And part them, Lord, to each and all, As each and all shall need, To rise, like incense, each to Thee, In noble thought and deed.",
      "And hasten, Lord, that perfect day When pain and death shall cease; And Thy just rule shall fill the earth With health, and light, and peace.",
      "When ever blue the sky shall gleam, And ever green the sod; And man’s rude work deface no more  The paradise of God."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 660",
    "verses": [
      "If I have sufficient strength, I shall use to praise God. I shall sing praise melodious, Glorify my Savior. Midnight, morning, afternoon, Praise God, glorify Him. Praises are due Jehovah, For in Him we are blessed.",
      "My life and my strength and all, All that I treasure here, They belong to Christ my Lord, Glorious is my Maker. I am clothed with power from Christ, He gives me all that strength, Above is His glorious gift, What He’ll give in Heaven.",
      "If men shall praise, glorify, Make me king over all. And I have riches and power, All I need in this life. I shall not profit from these, When I’m sick and confined, Sorrowful and in distress, What shall be my profit?",
      "By the grace of God our Lord, I have strength to live here; I can see the moon and stars, Sunshine and all beauty. I can see so well all things; I can hear so well too. I enjoy the food I eat, Sleep, refreshing I have.",
      "Jehovah, I shall give thanks, Praise Your Name for favors. I shall sing praises always, Magnify, glorify. Lord I pray, grant me Your grace, Till the day You call me. Then You’ll give eternal life, I’ll have peace in Heaven."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 661",
    "verses": [
      "Thou to whom the sick and dying Ever came, nor came in vain, Still with healing word replying To the wearied cry of pain, Hear us, Jesus, as we meet Suppliants at Thy mercy-seat.",
      "Still the weary, sick and dying Need a brother’s, sister’s care, On Thy higher help relying May we now their burden share, Bringing all our offerings meet Suppliants at Thy mercy-seat.",
      "May each child of Thine be willing, Willing both in hand and heart, All the law of love fulfilling, Ever comfort to impart; Ever bringing offerings meet Suppliant to Thy mercy-seat.",
      "So may sickness, sin and sadness To Thy healing virtue yield, Till the sick and sad, in gladness, Rescued, ransomed, cleansed and healed, One in Thee together meet, Pardoned at Thy judgment-seat."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 662",
    "verses": [
      "Thine arm, O Lord, in days of old Was strong to heal and save; It triumphed o’er disease and death, O’er darkness and the grave. To thee they went, the blind, the dumb, The palsied, and the lame, The leper with his tainted life, The sick with fevered frame.",
      "And lo! thy touch brought life and health, Gave hearing, strength, and sight; And youth renewed and frenzy calmed Owned Thee, the Lord of light: And now, O Lord, be near to bless, Almighty as of yore, In crowded street, by restless couch, As by Gennesaret’s shore.",
      "Be Thou our great deliverer still, Thou Lord of life and death; Restore and quicken, soothe and bless, With Thine Almighty breath: To hands that work and eyes that see, Give wisdom’s heavenly lore, That whole and sick, and weak and strong, May praise Thee evermore."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 663",
    "verses": [
      "O Christ Jesus, dear Lord, Right way Lord You show; You provide our needs and What we always seek.",
      "All the sick we commit To You Lord for care. Comfort them and heal them, Bring them Lord to You.",
      "Great Physician, come now, God our healer come. Draw near to these friends; be Gracious to the sick.",
      "The disease of the soul, Life of sin we bring. Take away our sin, and Deepen faith in You.",
      "Those that are in distress, We bring them to You. Comfort them, O Lord; grant Them relief from pain.",
      "Lord You know our sorrows, Grant relief from them. Make us satisfied with What we have from You!",
      "Those that live in evil, Grant them change of heart. Grant them new life now; we Long to see the change."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 664",
    "verses": [
      "I said, I shall guard all my ways here, That I may not sin with my tongue; My mouth, I’ll bridle to keep quiet So long as evil men are near; In vain I tried to keep silent, The distress in me grew much worse.",
      "Lord let me know how short this life is, The measure of my days is small. This life is fleeting and is nothing, A few hand-breaths we have in it. We are but mere breath in this life, Our life is like shadow on earth.",
      "This you allowed, Lord God creator, My peace I’ll hold, and now be mute. We toil and labor seeking pleasure, And heap up treasures in this life. We soon are gone and leave our wealth, We know not who will gather them.",
      "And now O Lord, what do I seek here, My hope is in You Lord my God. Deliver me from all transgressions, Make me be not the scorn of fools. Dumb I shall be before You Lord, Lord, hear my cry and save me now.",
      "I am a stranger and sojourner, I am Thy passing guest on earth. When You chaste us, rebuking sinners, Remove the stroke from me, O Lord. Look from me, grant me gladness, God, Before I die and be no more."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 665",
    "verses": [
      "I shall extol You Jehovah, You Lord have lifted me. You did not let foes rejoice, You saved me from all such. I cried to You my Lord God, You Lord have healed me now, Therefore I’ll sing, Your praises, I’ll praise You Lord my God.",
      "My soul You have redeemed, Lord, You saved my soul from hell. My soul restored to life now, From death’s pit lifted me. Sing praises to Jehovah, O, sing to Him all Saints. Sing to the Name so Holy, Eternal is His love.",
      "God’s anger but a moment, God’s anger is so short. His favor is for lifetime, God pities all His Saints. The night may come with weeping, In pain we spend the night. But morning comes with great joy, The morning soon shall come.",
      "My helper is Jehovah, Mourning shall turn to joy. The mourning sack-clothes remove, With gladness take away; My soul shall praise my Maker, I shall not silent be. O Lord, my God, I’ll praise You, And always give You thanks."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 666",
    "verses": [
      "Lord I come infirmed to You, Distressed, Lord I come. Great Physician, make me whole, To You Lord I come Thou Son of God, Comforter You are to me, Holy love You’ve shown to all, Come Lord to me",
      "Those You love, You chastise, Lord, I thank You for this. When You discipline me Lord, I’ll be purified. Come quickly Lord, Come and heal me Lord I pray, Let not sin in me remain, Come quickly Lord.",
      "Lord Thy will be done in me, Do what pleases You. If You grant a thorn till death, Amen, let it be. In love You act, Let me always ready be, Ready to depart this life, Receive me Lord."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 667",
    "verses": [
      "When shall I die and come to You, Come to You Lord, who died for me. When shall I hear You say to me? Leave now and come into my Rest.",
      "God loves me, I love Him also, I have regard for nothing else. Lord Jesus, my only treasure, Nothing else I seek in this life.",
      "My body is part of this earth, Ashes and dust, the flesh it is. All suffering shall soon cease for me, I wait for upward call from Him.",
      "Send Lord, Your angels come for me, Come quickly take my soul away. Grant holy angels bring me now, Safely bring me to You in Heav’n.",
      "Farewell, I’ll say to all my friends, My family and all loved ones. The time has come for me to leave, And be with Jesus Christ above."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 668",
    "verses": [
      "Leave me not, dear Lord Jesus, In old age leave me not. Cast me not from Thy presence, Help me, O Lord, I pray.",
      "I testify Lord Jesus, Your grace has seen me through. Now I am old and frail being, Be with me to the end.",
      "My strength is weak and feeble, Little I now can do. Help me the race to finish, Grant grace to complete well.",
      "I do not lose heart ever, The outer nature wastes. The inner nature grows strong, Daily it is renewed.",
      "Bless mind to understand this, Things above understand. Help me think of the new Home, With Christ as my delight.",
      "The ears are dull of hearing, The eyesight is now dim. Your Word is still so precious, The Word is hid in heart.",
      "My tongue may be so heavy, Little it shall say now. My Lord shall speak His message, He shall speak to my soul.",
      "When I have pain and anguish, Come Lord to comfort me. Help me remember nail wounds, The pain, You suffered Lord.",
      "When I begin to tremble, Fitful, and see death near; The life eternal promised, You shall give me in Heaven."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 669",
    "verses": [

      "God shall be with you through old age, God shall be with you through life. When you age and are frail, so weak, You shall be so strong in God. He shall strengthen, He shall strengthen, The Lord God shall be your strength.",
      "When the hair grows grey in old age, Put your trust in God the Lord. In God’s bosom, lie you aged, He shall sustain and keep you. God shall keep you, God shall keep you, With His Heart and Hands sustain.",
      "Old men, women, all you aged, Look to Salem for a Home. You shall soon be with Christ Jesus, You shall see God face to face. You’ll be welcome, you’ll be welcome, You shall enter Life in God."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 670",
    "verses": [
      "I seek You God my Father, I come to You, Lord, pleading, Be with me, help me Lord. For I am now a widow, My trust is in You Jesus, My hope is in You Jesus Christ.",
      "My sufferings overwhelm me, I deeply grieve in anguish, I am so confused Lord. My maker I look to You, My Savior and my helper, Grant me joy in this life I pray.",
      "Lord, comfort me Your servant, Help me be still before Thee, You hear my cry, O Lord, To You I look at morning, At evening You are with me, Be with me Lord always I pray.",
      "Have mercy O my Savior, Your great love I desire for, You are my companion. The life ahead, I know not, Be with me, guide me always, Lord, strengthen me and lead me on.",
      "Lord I desire to worship, And praise You Lord my Maker, Teach me and counsel me. You know my troubles, dear Lord, Some seek to take advantage, To harm me, Lord, protect my life.",
      "My children are Yours Jesus, You gave them as gift to me, Their father You have called I know not how to help them, I have no means to feed them, To You Lord, I commit them all.",
      "God You are Father for us, Christ Jesus you our Savior, Be with us Lord, I pray. For in You we have great peace, We have all that we need here, And we are safe in You our God."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 671",
    "verses": [
      "Father God and Lord Jehovah, Look upon me orphaned child, You are my Lord and provider, There is none to trust but You.",
      "In this life I have no parents, They are dead and in the grave. I rely on You dear, Jesus, You shall care for me and guide",
      "I remember, Lord Your promise, You shall not leave us orphans, You promised to come be with us, Comfort us Lord in this life.",
      "Jesus I am sad without You, Come to me, come in my heart. Help me trust in Thy grace, Jesus, Help me, life eternal give."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 672",
    "verses": [
      "Orphans and widows in the Lord, Come sing and praise the Lord [your God, Yield all your life and soul to Christ, Jesus will care and help you through.",
      "He is the Father of orphans, He is the Husband for widows. The Faithful God keeps promises, He shall be with you and provide.",
      "Perfect Husband, you have in God, The Perfect Father, you have now. Trust God and hope in Him always, Walk in His paths of truth and life."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 673",
    "verses": [
      "Jehovah, is Name of God, Be joyful now in His presence. Father of all orphans here, He is God Almighty to save, Jehovah His Name is great, He is Father for orphans.",
      "God is God for widows too, He takes care of all their troubles. God shall care, protect them all, With His Holy presence, keep them. He shall justify widows, God shall wipe away their tears.",
      "Come all widows. Come to Christ, Come all orphans, come to Jesus. Come and praise the Lord your God, He has dealt with all your troubles. Come and join the Saints above, Come and glorify the Lord."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 674",
    "verses": [
      "Lord of widows, Jesus the Christ, Your gracious mercies are so full. You know the needs of those bereaved, You know the troubles of widows.",
      "The widows seek to see You Lord, And come to You at Golgotha. To see You on the Cross of shame, You suffered there to save mankind.",
      "On that old Cross, where Jesus died, There is assurance of new life. Our burdens and our sins and all, Christ Jesus took away for us.",
      "Soon we shall see the Lord on high, Our comforter, we soon shall see. Our Savior shall be with us all, All suffering here shall cease at last.",
      "All widows and all orphans here, Come praise and worship Christ your Lord. He is a Father, Husband, Friend; Trust in the Lord forever more."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 675",
    "verses": [
      "O God, our help in ages past, Our hope for years to come, Our shelter from the stormy blast, And our eternal home.",
      "Under the shadow of Thy throne, Thy saints have dwelt secure; Sufficient is Thine arm alone, And our defence is sure.",
      "Before the hills in order stood, Or earth received her frame, From everlasting Thou art God, To endless years the same. ",
      "A thousand ages in Thy sight Are like an evening gone; Short as the watch that ends the night Before the rising sun.",
      "Time, like an ever-rolling stream, Bears all its sons away; They fly, forgotten, as a dream Dies at the opening day.",
      "O God, our help in ages past, Our hope for years to come, Be Thou our guide while troubles last, And our eternal home!"
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 676",
    "verses": [
      "In Thy great Name we walk, Lord God, In Thy Name we walk. No hope we have, save in You Lord, Hope is found in Christ.",
      "Gracious Lord, merciful God, Have mercy on humankind; Gracious Lord, merciful God, Have mercy on all people here!",
      "Take away Lord, love for evil, Take evil from us. Take away strife and all hatred, Take our sins away.",
      "Make the land fruitful, for harvest, Bless the land we have. Free us from slavery, oppression, Save us from them all.",
      "Give us good leaders to serve us, Servant leaders give. Choose for us wise men to guide us, Give us just leaders.",
      "Establish justice, for all men, Justice we all need. Unite us Father to serve you, Make us one, O Lord."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 677",
    "verses": [
      "Lord Jesus Christ, save us from strife, Save our nation, we cry to Thee. To You our Savior, we have come, We look to You, Lord, save our land.",
      "Lord, save the world, we cry to You, Evil and sin reign in this world. We are divided so much here, Knowledge is now a barrier great.",
      "Lord, save this vain world from decay, In vain we try, to save ourselves. Bless leaders with wisdom from You, The wisdom sin takes from our hearts.",
      "Lord Jesus, save this world, we pray, Grant leaders with a heart to serve. Save us from bloodshed, corruption, Save us from sin and evil men.",
      "Lord Jesus, come to save us now, Inspire Your Church to be a light. The salt and light to save the world, Establish peace in all our lands."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 678",
    "verses": [
      "We plead with You, Almighty God, Our President, come bless now. Grant wisdom, grace and all he needs, With justice, serve Your people. Grant Him to keep Your Word as rule, Help him to seek to please You first, Help him to serve all people.",
      "Help all submit to his service, Give honor, respect due him. Live justly, honest work to do, Live in peace and respect all. Lord grant true worship in our land, Give us the grace to be godly, Bless us and all in this land."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 679",
    "verses": [
      "O God of love, O King of peace, Make wars throughout the world to cease; The wrath of sinful man, restrain, Give peace, O God, give peace again!",
      "Remember, Lord, Thy works of old, The wonders that our fathers told; Remember not our sin’s dark stain, Give peace, O God, give peace again!",
      "Whom shall we trust but Thee, O Lord? Where rest but on Thy faithful Word? None ever called on thee in vain, Give peace, O God, give peace again!",
      "Where saints and angels dwell above, All hearts are knit in holy love; O bind us in that heavenly chain, Give peace, O God, give peace again!"
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 680",
    "verses": [
      "Mighty God of love, in majesty You reign Lord, The Lord who judges those that are so proud; Lord, make all princes and kings of earth confess wrong. See need to confess: Vengeance, Lord is Yours.",
      "Blessed Jesus You did come here as a poor man, You shared a manger with cows and with sheep. Help us Lord to be just, the poor with us to help! Be just, to all men that please You, O Lord.",
      "Holy Spirit, come and make us be holy, Lord. Help us seek justice for all people here. Give us the spirit that seeks the truth here always. Your glory to shine bright through us, O Lord.",
      "God the Father, Son and God the Holy Spirit, Bind all mankind now with cords of Your love. You alone we praise Lord; we’ll always praise Your Name. Father, Son, Spirit, we worship You God."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 682",
    "verses": [
      "Lord we plead now, heal the nations, Listen to the prayer we make. Grant that justice may prevail here, Grant us seek equity too. Fill us with love for each other, Peaceably live with others.",
      "Grant us freedom from oppression, From disasters rescue us. Save us from all wars and hatred, Grant us peace we so much need. Grant each nation be a blessing, Great advances we shall see.",
      "Take away all that is evil, All that leads to suffering here. Take away our greed and cunning, Laws unjust, take all away. Grant us seek Your justice always, Life is short, help us do right.",
      "God creator of this whole world, All on earth belong to You. Make us grow in righteousness Lord, Fill us with the life of Christ. That we may obey and serve You, Love all people here on earth."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 682",
    "verses": [
      "Fret not, trust in the Lord, And seek to do good always. Dwell in the land God gives, Seek to do right before Him. Delight in God your Lord, In Him alone, delight. Desires of all your heart, The Lord shall bless you with.",
      "Commit your way to God, Trust in the Lord your maker. If you will trust the Lord, The Lord shall act to save you. The Lord shall come bring forth, Your vindication, bring. Your light shall be so bright, As bright as noonday light.",
      "Be still before the Lord, Wait patiently before Him. Refrain from all anger, Fret not yourself for others. When evil men succeed, And prosper much in life. Forsake their evil ways, Be still before the Lord",
      "Wait patiently for God, The end of evil men comes. The wicked shall be gone, Soon they shall all be no more. The meek shall possess all, They shall delight themselves, In great prosperity, The meek shall all rejoice.",
      "The Lord God knows the days, Days set for all the blameless. Their heritage shall last, They shall abide forever. In shame and evil times, They shall be safe in God, In famine times, they’ll have What they need here and more.",
      "Salvation of righteous, Gift they have from Jehovah. God is their refuge here, In time of trouble, protects. The Lord delivers them, From evil men, saves them. The Lord protects His own, For they all trust in Him."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 683",
    "verses": [
      "Dear Lord answer me, I pray, In the day of trouble hear me. God of Jacob protect me, Lord Your Name I’ll praise and worship. Send help, Lord, I wait upon You, Send help from Your Sanctuary, Lord.",
      "Lord my God grant me support, From Zion, may God come bless me. Lord, regard the sacrifice, Favor all that I do for You. May the sacrifice I offer, Be a fragrant offering, dear Lord. ",
      "Grant my heart’s desire, O Lord, Fulfill now in me all Your plans. We shall shout for victory, Come with joy to praise You Father. In the Name of God set banners, Our petitions You have answered.",
      "Now I know God helps His Saints, God helps those He has anointed. God will answer them from Heav’n, From His Holy Home, He’ll answer. For the Lord knows all that are His, He will quickly answer, help them.",
      "Some will boast in chariots here, And some shall boast in their horses. But our boast is in the Lord, In the Name of God we boast now. Give us victory, King of Glory, When we call on You, Lord, answer."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 684",
    "verses": [
      "O Lord our God, our gracious King, Your will expresses always. To men and rulers and to kings, You give all authority. You have in place good governance, Your Word shows us what we must do, Help us to do Your will, God.",
      "We pray for all You set on high, Those You give authority. Give them Your Spirit, Lord we pray, That they may serve as please You. Give them the strength that they all need, Fill them with wisdom from above, That they may serve without fear.",
      "Help them to live in fear of You, With mind and body, for You. May justice be their rule in life, May they be just in all things. Graciously help all leaders here, Bless them and bless their homes, O Lord, Grant grace to be strong to serve.",
      "Under their term, may we progress, Let peace prevail under them. Give us Your grace to do the right, Serve with our strength for progress. In righteousness, we may all serve, Together pray to you to bless, Help us to live in honor.",
      "What is our duty, help us do, Pay all the taxes we owe. Work diligently in the land, Give to the nation her due. That we may have all that we need, For healthy building of the land, Make us good stewards, O Lord.",
      "Grant that this land may know You Lord, Help us acknowledge You God. Lord, be our God, we pray to You, Bless this land to be prosperous. May we all bow to worship You, King of all kings, we honor You, With all our hearts we praise You."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 685",
    "verses": [
      "Dear Lord and Father of our nation, You have been gracious to our land. You have forgiven all trespasses, You overlook our sinful ways. You did not send Your wrath on us, We have enjoyed much peace from You.",
      "Lord bless this nation still, we pray You, Be gracious Lord to us we pray. Be angry not, do not forsake us, Be merciful to us we pray. Lord grieve not over evil here, Lord hold back wrath from this nation.",
      "Hold back not peace You give this nation, May we Your blessings not forget. Teach us to know Your will, O Father, Abundantly, pour on us grace. We pray for peace from You, O Lord, Help us not walk in paths of sin.",
      "You are so near, You’ll save Your people, You hear their cry for mercy, Lord. They come to You in shame, with trembling, They come in grief, with burdens great. Lord hear our cries we seek You now, Be gracious to us save our land.",
      "Lord, give us grace and truth we need now, Peace, righteousness shall fill this land. Truth shall spread through our land with blessings, And justice shall rain from above. Come gracious Lord, come bless our land, Abundant peace give everyone."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 686",
    "verses": [
      "Come elders, come all children, Unite to praise the Lord God, Come sing the Lord worship; For we have peace and blessings Our nation God has blessed much. He has made us all victorious.",
      "God is our help in trouble, God is our strength and refuge, God is our God indeed; God made us His own nation, God blesses all our people, And God gives us victory always.",
      "We praise You and we, thank You, We bless the Lord for favor, Acknowledge His mercies; You have been on our side, Lord, The enemy You’ve scattered, All this abundance comes from You.",
      "We pray, O Lord, our Father, Abide with us and keep us, Let blessings remain here; Help us to walk in Your paths, Show us the way to Heaven, Grant us to be with You in Heav’n."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 687",
    "verses": [
      "God has blessed our land with peace, Victory He has given. Our land is blessed with God’s peace, Great refreshing land we have.",
      "We all come with grateful hearts, We give thanks for all Your gifts. In meekness we come to You, Give You thanks, O Lord, our God."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 688",
    "verses": [
      "God the Omnipotent! King who ordainest Thunder thy clarion, the lightning thy sword; Show forth thy pity on high where thou reignest: Give to us peace in our time, O Lord.",
      "God the All-merciful! Earth hath forsaken Thy ways all holy, and slighted thy word; Bid not thy wrath in its terrors awaken: Give to us peace in our time, O Lord.",
      "God, the All-righteous One! Earth hath deified; Thee yet to eternity standeth Thy word, Falsehood and wrong shall not tarry beside Thee: Give to us peace in our time, O Lord.",
      "God the All-provident! earth by thy chastening Yet shall to freedom and truth be restored; Through the thick darkness thy kingdom is hastening: Thou wilt give peace in our time, O Lord."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 689",
    "verses": [
      "Our Lord and heavenly Father God, Give us Your peace in these our times, Come drive away all enemies, Except You Lord, You Lord our God, Except You Lord!",
      "We plead with You our Father God, Be merciful, provide for us, Forgive our sins and trespasses, In You alone, we trust, O God, Lord, protect us.",
      "If You our God, shall hear our prayer, We shall give You our hearts and all, If You give us the peace we need, We shall be children of You Lord. Grant this to be."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 690",
    "verses": [
      "Our God Jehovah, Zebaoth, You are the Mighty God, Lord. Your glory is so splendid God, Earth trembles, reels before You. We bow before Your glorious Throne, Your Throne so great above the heavens, You are the Lord of lords, God.",
      "You are so great we testify, In clouds we see Your great works. The lightning and the thunder see, Reveal Your powerful voice here. The lightning comes from heav’n to earth, Frightening is such for all on earth, You send lightening where You please.",
      "The clouds full of water above, Give rain for water we need. Lightening and water You send down, Great are Your works, O Lord God. In Your Hands we all are on earth, You choose to do what pleases You, You may decide to wipe us.",
      "We are rebellious people Lord, We all deserve Your wrath, God. As You did of old to Korah, We all should perish in earth. As it was in the ancient times, When great flood swept all men away, We are all sinful, none right.",
      "Be merciful to us our God, All we have sinned, gone astray. We come for refuge, Lord receive, Cover with Your mighty wings. To You we come, most gracious God, Have mercy Lord, forgive our sins, We claim the promise of love.",
      "Watch over us we pray to You, Protect us from all evil. As You were with three men in fire, Be with us Lord, deliver. As You did for righteous Noah, As You saved him and all his kin, Save us, O Lord from peril.",
      "Stretch out Your Hand to bless us Lord, Bless us and bless all people. Lord You provide the food we need, Give us each day our daily bread. We thank You Lord for all Your gifts, We wait to see You on that Day, We shall be with You in Heav’n."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 691",
    "verses": [
      "Ascribe to God the Lord Jehovah, All beings above, bring Him honor, Ascribe to God the glory due. Ascribe to God all strength and glory, Ascribe the glory due to His Name.",
      "Come worship God in holiness. Come worship God and come with praises, Come with all thanks and lift Him High, Come glorify His Holy Name now, Ascribe to God the glory due.",
      "The voice of God is on the waters, The God of glory thunders loudly, The voice of God is powerful. The voice of God breaks all the cedars, The Lebanon, cedars, God’s voice breaks,",
      "His voice breaks oaks and twists them all. The calf skips and the young wild oxen, The calves of Lebanon do skip, The Lord God shakes all the creatures here, The voice of God makes all things move.",
      "The voice of God flashes like lightening, It flashes forth flames of great fire, The voice of God shakes wilderness. The voice of God lays bare the forest, The Lord shakes wilderness of Kadesh,",
      "All in His temple cry “Glory”. The Lord sits over the great floods here, The Lord sits enthroned as a King, May the Lord grant His strength to us all, Lord, bless Your people with Your peace."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 692",
    "verses": [
      "When we are in distress in life, And we are lost, hopeless, our lives. When there is none to help and save, We come to You our Lord and God.",
      "You are our comforter, O God, You are the Father of us all. We cry to You, Lord hear our prayer, We are in danger and distress.",
      "We lift our eyes, we lift our hearts, We lift them all to You, O Christ, Forgive us Lord our trespasses, Condemn us not, as we deserve.",
      "We come to You, with burdens all, We come to You with load we bear. Forsake us not in our distress, Our land is rotten and so sick.",
      "Look not upon our sin, O Lord, But Lord, forgive us all our sin. Great suffering we are in, O Lord, From trouble, Lord, deliver us.",
      "When You have come to save us Lord, May we give You all thanks and [praise! Help us to heed Your Word in life, Forever more, we must obey.",
      "Stretch out Your Hand to bless us Lord, Bless us and bless all people. Lord You provide the food we need, Give us each day our daily bread. We thank You Lord for all Your gifts, We wait to see You on that Day, We shall be with You in Heav’n."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 693",
    "verses": [
      "Take heart, my soul, fear not be peaceful, Be not like those that have no hope. Let nothing frighten you or worry, Look for a hope in God always. The Lord your Father, Savior God, He knows the troubles you are in.",
      "I am so lost I need You Jesus, Confused I am, none can comfort. I hear Your voice that calls the wanderer, Lord You know all and can rescue. You search for me, You dearly love, You’ll make the evil good for me.",
      "What do I need on earth to help me, I am from dust to dust will go. All that I gain is food and clothing, These last till death ends all for us. To earth and dust the body turns, Nothing we gain on earth will last.",
      "I came to earth poor, holding nothing, Naked was born from mother’s womb. Provision God made for my life here, Prepared them all before I came; Nothing I have but what God gives, My mother fed and cared for me.",
      "Material things don’t last, are transient, Why should I live for only these. What is of value, God provides us, In Him, I lack nothing in life. God gives us more than food and clothes, He gives eternal life in Christ.",
      "Good things for us and what shall harm us, The Lord alone knows what we need. When we see storms and we are worried, And we become so frightened here. The Lord reveals His glory then, He draws near to His loved ones here.",
      "My soul take heart for God is with you, Be comforted for all is well. The Lord has blessed with much already, Forget not this, and give Him thanks. All those that trust the Lord believe Things of this world do not much grieve.",
      "There is much that the Lord will give you, You cannot fathom His great love. When you lose treasures here in this life, Remember pilgrim only are. You have a Home with God above, There, treasures lasting are in store."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 694",
    "verses": [
      "Our Father, Almighty You are, Your anger is upon us. Therefore You’ve held the rain from us, The land is parched, the crops failed. The clouds have gathered over us, But they have no rain for the land, The ground, hard as stone, we see.",
      "Truly our sin is great, O Lord, We all deserve Your wrath, God. Your Word we have discarded Lord, Our sin is now before us. We come repentant and in grief, We plead with You for mercy Lord, Lord, forgive us now, we pray.",
      "For Thy Name’s sake, remember us, Consume us not in anger. Remember covenant promise, You are so merciful God. Our empty worship You need not, And none can give the rain we need, Lord, You alone bless with rain.",
      "We look to You our Lord and God, With heart and soul we seek You. Be gracious to us, stretch Your Hand, And bless the land with rain, Lord. You Lord, control weather and all, The clouds obey You and give rain, Bless the land with rain we pray.",
      "We come to ask, as You taught us, We come seeking for rain now. We ask forgiveness for our sins, Be filled with mercy, O Lord. Lord, make us not so sorrowful, Compassion, Lord from You we plead, Be gracious Lord to us now.",
      "For hardness of heart, we suffer, The land is dry, as our hearts. And as we seek rain from You Lord, Rain on us Holy Spirit. And help us now obey Your Word, And draw us closer Lord, we pray, Dwell in our hearts we pray, Lord."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 695",
    "verses": [
      "We thank You Lord, we praise Your Name, Accept the offering we bring, For You, O Lord have heard our cry, Our land You have blessed with much rain.",
      "You are the God, who answers prayer, Your grace is always sufficient, Our sin and trespasses, You know, You are so merciful to us.",
      "You feed the body and the soul, You give us food and righteousness. We praise You Lord for You are good, We trust You Lord, we worship You.",
      "For rain on earth we thank You, Lord, From this we have abundant crops, Much grain we harvest from the land, We have much water to drink here.",
      "The grain we sowed You’ve watered Lord, The seed the rain has watered now; They grow, Your glory to reveal, Receive our thanks for this, O Lord.",
      "We give You thanks for food we eat, All this has come from You, O Lord. Lord, give us grace to keep Your Word, And bless the land with rain, we pray."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 696",
    "verses": [
      "Almighty God we have from You, What we need to be blessed on earth, But we have gone our way Lord. We suffer for, our sins, O Lord, Good blessings You have held from us, Our disobedience is great.",
      "We find the promise in Your Word, Of curses when we forsake You, You shall withhold rain from us. The land shall be dry, hard as stone, It shall not yield the food we need, We shall all suffer from wrath.",
      "Lord we have gone astray from You, The land is full of sin and blood, We have forsaken You, Lord. We lack the rain, the ground is parched, The crops have failed, the land is dry, Lord we are suffering much here.",
      "What You have said has come to pass, There is great drought and famine here, We have been stiff-necked in sin. You have visited in Your wrath, The land is parched, the crops wither, And we all suffer the heat.",
      "The farms and gardens lack the rain, They are so dry, nothing grows there, Famine we face with anguish. Mountains are bare, the plains are dry, The cattle die, we have no food, For rain is lacking on earth.",
      "What can we do in this great plight, In vain we labor, ploughing fields, Dust only we have from this Dust, ashes we have in our land, The corn and wheat we have, perish, The land is cursed, yields nothing.",
      "O Lord, we pray, be merciful, Forgive our bloodguilt and all crime, Forgive our disobedience. We come before You pleading, Lord hear us now, forgive we pray, Bless us with rain abundant.",
      "Come Lord and bless our lands and fields, And multiply produce of farms, For food for us and cattle. That we may all be satisfied, And give You thanks, as we have peace, For Your own glory, bless, Lord.",
      "Help us, O Lord, to fear You now, Help us obey Your Word, O Lord, Help us to live to please You. That we may have great blessings, Prosperity when we obey, Lord, keep us in You always."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 697",
    "verses": [
      "Lord You control the rains that fall, You know how much we need here. The clouds have poured much rain for us, We now need, Lord, the sunshine. Lord, hear our prayer and end the rains, Give us the sunshine that we need, Bless us with joy of sunshine.",
      "The land is wet with much flooding, We grieve and suffer greatly. There is much water everywhere, The crops are drowned in water. Lord, stop the rain and give sunshine Give dry land for the crops to grow, Bless us with food we need here.",
      "For all our sin, we suffer much, Your wrath is great, we suffer. You bless the land when we do right, You bless with rain and sunshine. But when we turn our backs to You, We suffer from the curse You bring, Forgive us Lord, we pray You.",
      "Your truth is firm, unchangeable Your glory great is so full. What You have promised, You fulfill, Your covenant, You keep Lord Fatherly love, show us, our God, Your loving children we all are, We give You thanks and praise You.",
      "We seek Your favor, come to us, Dear Father, turn to bless us. We need much sunshine now, O Lord, Bless us with sunshine for growth. Forgive us Lord, we pray to You, Lord, heal the land and bless us now, Give us good crops to harvest."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 698",
    "verses": [
      "Light of God, eternal light, Light perpetual, shine upon us. Shine for us this glorious day, Take away the blindness from us. With great brightness come to us, Night is gone.",
      "Let the dew of mercy fall, Gently fall upon my soul Lord. Let the land that has been dry, Receive rain from You, O Father, Come and comfort us we pray, Always come.",
      "In Your great love come to us, Take away all sin and evil. Give us clean and contrite hearts, Pure hearts give us, as the heavens. Make us thirst for holiness, Life must seek.",
      "When the Morning dawns at last, We shall see You and be with You. Raise our bodies from the grave, On that Day Lord grant us, see You. We shall all rejoice that Day, Before You.",
      "Gracious, Righteous Sun, our Lord, Shine upon us, always lead us. Take away all sorrow Lord, Lead us Home, eternal peace give. We shall praise You always there, Praise You Lord."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  },

  {
    "name": "PHB 699",
    "verses": [

      "The sun is up, brightly it shines, It gives light to mankind, The Word of God too shines for me, It shines to make me pure.",
      "Father of Light, shine in my life, Shine brightly for me Lord. Shine in my mind, shine in my heart, Come live in me, dear Lord.",
      "When sun comes up and shines so bright, It drives away the night. When Lord You shine Your light in me, It drives away my sin.",
      "You are my life, my Savior Christ, Help me to shine so bright. Help me behold Thy glory Lord, Glory, be seen in me.",
      "As eagle soars high in the skies, It sees all things so well. My soul, soar up to Christ the Lord, And see His glory full.",
      "Where ever I may be on earth, Whatever I shall do, In all things Lord, help me to seek, To do as pleases You.",
      "Hide not Your face from me, O Lord, Keep me in Thy ways Lord. And care for me, always be near, Lead to eternity."
    ],
    "scripture": "",
    "author": "",
    "translator": ""
  }
