[
{
  "verses": [
    "Now, thank we all our God,\nWith hearts and hands and voices!\nWho wonderous things have done,\nIn whom this world rejoices.\nWho from our mother's arms,\nHas blessed us on our way,\nWith countless gifts of love,\nAnd still is ours today.",
    "Before our life on earth,\nThe Lord God knew and loved us.\n He freely gave all things,\nAnd more than we knew, gave us.\nTherefore we all must join\nTo sing in unison\nThe praises of our God;\nHe is the God of praise.",
    "Oh may this bounteous God,\nThrough all our lives be near us.\nWith ever joyful hearts,\nAnd blessed peace to cheer us!\nAnd keep us in His grace,\nAnd guide us when perplexed,\nAnd free us from all ills,\nIn this world and the next!",
    "All praise and thanks to God,\nWho reigns in highest Heaven.\nThe Father and the Son,\nAnd Spirit now be given.\nThe one eternal God,\nWhom earth and heaven adore,\nFor thus it was is now,\nAnd shall be evermore! "
  ],
  "name": "PHB 1",
  "scripture": "Psalm 107 vs 8-15; Psalm 95 vs 2; Eph. 1 vs 3-10; Eph. 5 vs 20",
  "author": "Martin Rinkart (1586-1649)",
  "translator": "Catherine Winkworth (1827-1878)"
},
{
"verses": [
"Praise to the Lord, the Almighty, the King of creation!\n O my soul, praise Him, for He is thy health ans salvation!\n All ye who hear, \n Now to His temple draw near;\n Praise Him in glad adoration.",
"Praise to the Lord, who o'er all things so wondrously reigneth,\n Shelters thee under His wings, yea, so gently sustaineth!\n Hast thou not seen\n How thy desires ever been\n Granted in what He ordaineth?",
"Praise to the Lord, who doth prosper thy work and defend thee;\n Surely His goodness and mercy here daily attend thee.\n Ponder anew\n What the Almighty can do,\n What the Almighty can do,\n If with His love he befriend thee.",
"Praise to the Lord, who when tempests their warfare are waging,\n Who, when the elements madly around thee are raging,\n Biddeth the cease,\n Turneth their fury to peace,\n Whirlwinds and waters assuaging.",
"Praise to the Lord, who, when darkness of sin is abounding,\n Who, when the godless do triumph, all virtue confounding,\n Sheddeth His light,\n Chaseth the horrors of night,\n Saints with His mercy surrounding.",
"Praise to the Lord, O let all that is in me adore Him!\n All that hath life and breadth, come now with praises before Him.\n Let the amen\n Sound from His people again,\n Gladly for aye we aadore Him."
],
"name": "PHB 2",
"scripture": "Psalm 57 vs 8-9; 103 vs 1-5; Deuteronomy 32 vs. 10-12.",
"author": "Joachin Neander (1650-1680)",
"translator": "Catherine Winkworth (1827-1878)"
},
{
"verses": [
"Sing ye saints, sing to the Savior,\n Jehovah is He.\n Give Him thanks, and praise Him always,\n Praise Him everywhere.\n Christians come, your Lord extol,\n Magnify His Blessed Name.\n Give Him thanks, and praise your\n [Savior, \n Glorify His Name.",
"You redeemed ones, blessed children, \nPeace you have in Christ.\n Joy and peace you have in Jesus,\n This God wants for you.\n For He loves all the children,\n And He cares for them always.\n For He guides them, and protects them,\n Glorify His Name.",
"Hosts of evil men may scare you,\n Satan's wicked foes.\n Saints of Christ, they fear no evil,\n In this battle fierce.\n For they have the Word of God,\n And with faith and prayer they fight.\n All equipped with God's own armor,\n Victorious they are.",
"People of God, Israel's children,\n Come rejoicing, now.\n For the Lord who made and saved you,\n Favor He bestows.\n Zion's children come with joy,\n Be assured that all is well.\n For the Lord, the God Almighty,\n Sovereign Lord is He."
],
"name": "PHB 3",
"scripture": "Psalm 149; Ephesians 6 vs. 11.",
"author": "Johannes Gottlieb Christaller",
"translator": "Catherine Winkworth (1827-1878)"
},
{
"verses": [
"If God would give me thousand tongues now, And thousand, thousands more than that; I shall use all to praise Him always, To glorify His Holy Name, And shall extol Him with my heart And glorify His Holy Name.",
"I shall proclaim His glorious splendors, And share with all, His wondrous works. His fame shall spread in earth and heaven, His righteousness to manifest; My heart and soul shall sing His praise. To magnify His Name abroad.",
"The forest trees with plants of all kinds, Come forth and praise the Lord your God. You grass and flowers of the fields here, So beautiful the Lord made you; Come forth display His glorious power, Come join the joyful praise of God.",
"Let all His works join in this worship, Revealing all His glorious works, And tell His splendor and His beauty, The splendor of His Majesty, Lift up your voice His creatures all, Speak of the Glory of the Lord.",
"We must give praise and thanks to our God, To God the Father of us all; From whom we have our bodies and minds, From whom we have the soul and all. The Lord who made and placed us here. That we may bear much fruit for Him!",
"Lift high and praise the Name of Jesus, For mercy great we have from Him. He has become our Lord and Savior, lie suffered much and died for us. From death He has delivered us, The Son of God saved us from sin.",
"All praise and thanks are due the Spirit, God Holy Spirit from on high. He gives to us new life in Jesus, He works to sanctify us all. The fruit of God is from His work, From Him we have a righteous life.",
"In all my life, you Lord have blessed me, I testify of your great love. In all my troubles and distresses, You Lord my God have been with me. In storms so fearful and so great, I have received your comfort, Lord. ",
"All living creatures praise your Makes, For He provides sustaining grace, For He is just and kind in nature, And hears the cries and prayers of all, To satisfy and save His own,All those who fear His Holy Name. ",
"The Lord preserves all those that love Him, But will destroy the wicked foes. My mouth shall speak His praises always, All saints shall praise Him ever more, For He is Everlasting God, And we shall glorify His Name. "
],
"name": "PHB 4",
"scripture": "Psalm 107 vs 8-15; Psalm 95 vs 2; Eph. 1 vs 3-10; Eph. 5 vs 20",
"author": "J. Mentzer, (1658-1734)",
"translator": ""
}
]
