[
  {
    "year": "2020",
    "theme": "Go and make disciples of all nations",
    "scripture": "Matthew 28:18-20",
    "introduction": "INTRODUCTION \nThe Theme Last year, a sequence was started with the aim of developing the ministry capacities of our church members. It started with a focus on understanding of the content of the gospel and being able to share the faith it generates in us with others. It is also considered as appropriate that this should be followed by how to nurture others into Christlikeness. Therefore, from the theme for the year ending (2018) - Let the Earth Hear — which focuses on EVANGELISM (SOUL WINNING EVANGELISM) through proclamation, the GAG has selected the theme GO AND MAKE DISCIPLES OF ALL NATIONS (Matt 28:18-20) for 2019 so as to focus on disciple making. \nThis was done to create the necessary link between evangelism and disciple making. In doing this, the challenge of the lack of a deliberate culture of disciple-making as an integral part of our daily living and the general church-life is targeted for transformation. \nThe Key Objective The key objective of this study therefore is to provide a foundational level material that prepares members to take up the ministry and the responsibility of nurturing ourselves and others into Christlikeness. The materials also aims at using the opportunities that already exist in our church, homes and communities for ministry. To this end, the material seeks to enhance the existing disciple making practices and also set the tone for successive endeavours that will work towards upgrading the capacity of our members into a culture of disciple-making ministry. This will enable us to disciple others across all the generational and service groups as well as across all social, professional, economic, etc., etc., classes in the P.C.G \nThe Structure of the whole Study Material The study is grouped into SECTIONS and there are six (6) sections in all. The material will be released in two parts. Part One contains sections 1-3. These lesson are the breakdown of the topic of the section and these are also linked up in succession. It is very important therefore to note that the whole study is actually a single unit that has been broken down into sections and lessons. \nThe Structure of the Lesson Expected Learning Outcomes (Lesson Objectives) In this Study Material, each lesson has a Lesson Objective. These objectives clearly state what each lesson is expected to achieve in the life of each person who studies the lessons. These objectives are intended to guide the study so that we can study by objectives. The aim is make sure we do not to leave the study to open chance hoping that they cause some change in the life of those who study these lessons. The objectives are also crafted to help us measure how much progress we make with each study because the objectives give us what to look out for in the lives of members so as to know if we are heading towards our target. \nBible Exploration and Truths Learned In the previous lessons plans, we combined the search for truth and its application together in the discussion questions. In this new format however, truth discovery and truth application are separated. This is for the particular reason of emphasizing the need to first discover truth clearly, to know its nature and what area of life it is most suited for. When this is done very well, we will be able to apply more accurately and appropriately. It is important therefore to focus on discovering truth very accurately and clearly at the Bible Exploration stage. It is expected that we will sum up this endeavour at the Truth Learned stage. At this stage, we will note all the truths we have learned from the exploration, stating them clearly so that we appropriately apply them, to life. \nLift Application Truth learned without applying it to life for transformation is a complete waste of time and energy. Truth learned will build faith and applying that faith to life by living it out will produce a life of faith (James 2:20). One without the other is actually useless. At this part of the study, we engage our life and living by using the truth we have learned to explore our lives. We do this so as to find out the specific and general areas of our lives that we must engage for transformation. Bible Exploration and Truth Learned will not be complete without applying these to life for transformation. \nAssignments To aid the application of truth to life and to give opportunity to each one of us to develop a functional life that demonstrate what the church and her members must be in their communities, each study ends with an assignment. If the Bible Exploration is the Heart of the Study and the Life Application is our benefit, the assignments are the opportunities that the study gives us to develop the culture of ministering. It is therefore, very important to explain the assignments very clearly at the end of each study and encourage members to do these assignments. We must following up on each other during the week and team up where necessary to do the assignments. At the beginning of each study, we must also receive feedback from each other. If we miss out on doing the assignments, we will lose the opportunity to develop ministry. As we have stated earlier, this study is connected to the ministry of evangelism. Indeed the study is on how to develop personal evangelistic practices (ministry) towards the goal of the formation of a culture. The approach of this study takes is that, it is through the assignments that we provide \nourselves with the opportunity to practice evangelism and by that develop the culture. In short the ASSIGNMENTS are so crucial that it is in doing them effectively that we make maximum use of the study and benefit from the study effectively. \n\nReview \n\nAfter completing each section, the next meeting should be devoted to a review of the whole section. This could be done either in the study groups, several groups together or together as a congregation. The aim of this is to emphasize the gains we expected to make from the section as well as introduce the new section. You will notice that each section begins with a very brief introduction. \nNote Taking \n\nThe Study Guides are designed to give us space to take notes. This is one of the feedback received on the review to the former design of the materials. With this design, we have combined a notebook with the study material. By this design we have a single book to carry along with us. By this design also, we encourage all of us who can write to actively take notes as we participate in the study.\n \nIt is with these explanations and expectations that we send out these lessons. We have very high hopes and trust that the we will all benefit greatly from this material and that this will give us the necessary input to a good study. \nGod bless you all \nREV GIDEON BUERNOR PUPLAMPU \nDirector, Ramseyer Training Centre \nBible Study Coordinator and Supervisor \n",
    "acknowledgement": "ACKNOWLEDGEMENT \nAgain this year as always, the church has to draw on the skills and capacities of several members to prepare the Study Material. We acknowledge the Christian Education Committee of the CLAN department for laying the necessary foundations for the execution of this task. \nThis team of writers were made up of the Rev'ds Andrew Shardow, Ebenezer Ahenkan. Owusu, Frederick Ashaley Kotey, Nicholas Odame (Mori, Lydia Annowaa, Letitia Adjei-Yeboah, Rose Buerkie Puplampu and Mr Eric Olcal, our senior citizen who worked with so much zeal and commitment. The writers team was coordinated and supervised by Rev Gideon Buernor Puplampu. \nThe trial session for the lessons was done with individuals and two congregation. The congregations were Ascension Congregation at Adabraka in the Ga Presbytery and the Mount Sinai Congregation at Yohe in the Manyakpongunor District in the Dangme Tongu Presbytery. These congregations and individuals readily accepted the request to conduct a test-run of some selected lessons in a full \"realtime setting\" of the study done as part of the Sunday Church Service. We acknowledge the commitment made towards this trials and how helpful they became to the final write up of the material. \nWe also acknowledge the Rev Dr Martin Obeng and the editorial team for working though the material. To this group of editors we also express gratitude for the meticulous work that eventually put the whole study material into its final form for production. With great expectations, we send out this year's material for use in our church for study, the practice of disciple making and the development of a culture of Christian Nurture. \nREV KWAKU BIO KYEAME Director, Department of Church Life and Nurture General Assembly Office Accra December 2018 ",
    "wordFromModerator": "A WORD FROM THE MODERATOR \nGreetings in the name of the lord Jesus Christ, Beloved members, we have gone through a year of study that called us to practice evangelism at the personal and group levels. Though this was new in its approach, we have feedback th - while some of us had some challenges in getting used to the new structure and style, P us have done very well with it. Several congregations have finished the study and even des/. ur to repeat the lessons so that they grasp the lessons and practice them very well. While there is no restriction on doing so, it is also necessary to be mindful that a different dimension letting the EARTH HEAR is to make disciples! If we are truly winning souls to jest's chri°f then we •cannot suspend the critical aspect of discipling such people. I urge all presbyterial; to keep mastering what we have studied and be actively involved in telling others about Jesus Christ. It is important to remember that we do not only tell others about Jesus Christ but also make progress and fulfil the command of Christ to MAKE DISCIPLES OF ALL NATIONS This theme is derived from Matthew 18:1840 and it is a call to disciple-making. I must state that our Lord Jesus never separated evangelism from disciple-making. Jesus made this clear right from the call of the first disciples to the day he gave the Great Commission to all his followers. The first disciples also focused on making those they came into contact with followers of Jesus Christ. However, only a disciple can truly disciple others. We must, therefore, make sure that we ourselves have been discipled before we attempt to disciple others. We also need to train and nurture ourselves to be efficient in disciple making. The Presbyterian Church of Ghana is poised to increase her membership to at least One Million, Five Hundred Thousand (1,500,000) within the next five years and every church member has a role to play if this objective is to be realized. This study was designed to do equip members and it must inspire us to commit to disciple making intentionally and effectively. Let us all study with all the dedication, love and obedience, fully relying on the Holy Spirit's power and guidance so that we will see our members maturing and discipling others. I dedicate this study material to all who desire to see everyone who profess Christ grow intl Christlikeness. At the General Assembly Office and the General Assembly Council, we `mil all that we are able to support the congregations and individual church members $o that together, we will MAKE DISCIPLES OF ALL NATIONS for Christ. Peace Be Unto You. \nRT. REV. PROF J. O. Y MANTE \nModerator of General Assembly \nPresbyterian Church of Ghana \nChurch House, Osu, Accra \nDecember 2018. ",
    "sections": [
      {
        "title": "The Portrait of a True Disciple",
        "introduction": "Introduction \nThe word disciple is used many times in the Gospels mainly in reference to the twelve disciples of Jesus Christ (e.g. Matt. 1 0: 1 , Luke 6:13). It is also used in the Acts of the Apostles to describe a wider circle of people beyond the twelve to include the followers of Jesus who were attracted to Him because of His teachings and miraculous works. In addition, the Bible describes disciples as followers of traditions of faith (Matt. 22:16, John 9:28, Acts 6: 1-2, 7, Acts I 1:26). In the context of this study, we can simply define a disciple as a 'follower of Jesus Christ'. Jesus defined the goal of discipling in Luke 6: 40 when He said \"a student is not above his teacher but everyone who is trained will be like his teacher\" Discipling therefore, conveys a teaching and learning relationship between a teacher and a learner where the learner yearns to become like the teacher. Other portions of Scripture refer to discipling as master-servant relationship where the servant is taught, trained and nurtured to accept and obey the instructions of the master or teacher. Like the twelve disciples, we are to avail ourselves to Jesus so that we can be nurtured into his likeness - Christlikeness. \nAgain, in 2 Corinthians 3: 18, we read that those who turn to the Lord, enter the process of being transformed into the image of the Lord Jesus Christ. Discipling therefore, is a process whereby the learners are trained in a well-defined relationship to become like the teacher. The ultimate of growth in the life of Christ is stated vividly in Luke 2: 52 - \"And Jesus grew in wisdom and stature and in favour with God and man.\" This portion of Scripture indicates the areas of maturity that a true disciple should yearn to grow in; growth in her relationship towards  God (spiritual), growth in her relationship towards the physical self (Stature), growth in her relationship towards cognitive self (wisdom) and growth in her relationship towards others  (Social life). As a church, it is imperative that we understand the processes and characteristics that are involved in this growth towards Christlikeness. It is also important for us to know the demands that this transformation will make on us. Session One of the study will therefore aim at explaining in clear and vivid terms, who a true disciple is in all Christlikeness, as portrayed in the Scriptures. The understanding we gain will then become the working definition and portrait of the disciple that we must all desire to become and make every effort to achieve it.",
        "lessons": [
          {
            "title": "The Growing Disciple In Her Relationship With God",
            "introduction": "Becoming like Christ should be the ultimate aim of any true disciple. The true disciple 13 must bear in mind that discipleship is a continuous process which must be practiced on daily basis. Put in another way, the desire to live in Christlikeness must be a lifestyle and not an event. This act of becoming like Christ cannot be practiced without the indwelling of the Holy Spirit and requires that the true disciple knows the ways and means of growing towards God in all our Christlike pursuit. In this lesson, we shall search the Scriptures to identify the components and qualities of a life that is growing towards God and the demand that this makes on the disciple who is desiring to become like Christ in character.",
            "scriptures": "Romans 6: 12 -14 (John 15: 1-8, 2 Tim 2: 1 - 10)",
            "content": "Markdown Data",
            "objectives": ["Identify the components of a life that is growing in relation to God;","Name the characteristics of a life that is growing in relation to God;","Clearly explain the demands that these characteristics make on the disciple. "],
            "exploration": ["Read Romans 6:12-14. \nIdentify and discuss four key behaviours that point to a life that is growing towards God. ", "Read 2 Timothy 2: 1-6. In the passage, Paul points out a number of passage. many of these qualities as is possible, from qualities (attitudes) of a spiritually growing disciple. Identify as many of these qualities as is possible, from the passage.","Read John 15:1-8. In the passage, Jesus describes the nature of the union that will bind him to His disciples and grow into a fruitful relationship. Identify the unique features in this union from the passage."],
            "application": ["Refer to your answers in the Bible Exploration. For each of the qualities, attitudes, nature and demands you have named or identified, do a self-assessment. Compare these characteristics to yourself and consider how well you are progressing in your growth towards God. \n", "What have you discovered?\n", "How well are you doing on a scale of 1 to 10 if you were to grade yourself? ","What are some specific ways by which we can intentionally work at growing progressively in our relationship with God? "],
            "assignment": "Refer to your answers to questions 1 and 2 under Bible Exploration and meditate on the qualities mentioned regarding the Christian's growth in her relationship with God and identify which ones are more challenging for you. You will share your answer in the next meeting. Refer to your answers to question 3 under Bible Exploration. Throughout the week, meditate on the relationship which must exist in the union between Christ Jesus and the true disciple. Identify ways of living that enhance this relationship. You will share this in our next meeting ",
            "conclusion": "The true disciple is continually being transformed to become like Christ. ",
            "remember": "Growing towards God requires growing into Christ-likeness in our daily Christian Living "
          }
        ]
      }
    ]
  }
]
